const 盈亏问题03亏亏问题=[
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少6张积分卡；如果每个同学发14张积分卡，就会少123张积分卡．",correctOption:"59 ",incorrectOptions:["29","16","50",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少2张积分卡；如果每个同学发6张积分卡，就会少11张积分卡．",correctOption:"7 ",incorrectOptions:["76","80","50",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少2张积分卡；如果每个同学发10张积分卡，就会少38张积分卡．",correctOption:"52 ",incorrectOptions:["71","22","65",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少5张积分卡；如果每个同学发10张积分卡，就会少82张积分卡．",correctOption:"28 ",incorrectOptions:["49","63","30",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少6张积分卡；如果每个同学发7张积分卡，就会少21张积分卡．",correctOption:"14 ",incorrectOptions:["71","44","20",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少2张积分卡；如果每个同学发3张积分卡，就会少11张积分卡．",correctOption:"16 ",incorrectOptions:["21","37","75",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少4张积分卡；如果每个同学发9张积分卡，就会少28张积分卡．",correctOption:"8 ",incorrectOptions:["47","71","39",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少5张积分卡；如果每个同学发12张积分卡，就会少82张积分卡．",correctOption:"50 ",incorrectOptions:["36","57","23",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少2张积分卡；如果每个同学发9张积分卡，就会少29张积分卡．",correctOption:"52 ",incorrectOptions:["44","57","16",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少6张积分卡；如果每个同学发6张积分卡，就会少18张积分卡．",correctOption:"54 ",incorrectOptions:["44","25","53",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少2张积分卡；如果每个同学发13张积分卡，就会少58张积分卡．",correctOption:"33 ",incorrectOptions:["59","26","12",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少5张积分卡；如果每个同学发6张积分卡，就会少11张积分卡．",correctOption:"1 ",incorrectOptions:["31","35","67",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少3张积分卡；如果每个同学发13张积分卡，就会少17张积分卡．",correctOption:"9 ",incorrectOptions:["39","14","10",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少2张积分卡；如果每个同学发9张积分卡，就会少17张积分卡．",correctOption:"10 ",incorrectOptions:["12","61","55",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少2张积分卡；如果每个同学发9张积分卡，就会少86张积分卡．",correctOption:"22 ",incorrectOptions:["64","78","71",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少3张积分卡；如果每个同学发8张积分卡，就会少27张积分卡．",correctOption:"21 ",incorrectOptions:["40","39","56",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少3张积分卡；如果每个同学发11张积分卡，就会少48张积分卡．",correctOption:"7 ",incorrectOptions:["49","11","50",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少6张积分卡；如果每个同学发11张积分卡，就会少66张积分卡．",correctOption:"66 ",incorrectOptions:["32","61","30",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少6张积分卡；如果每个同学发6张积分卡，就会少18张积分卡．",correctOption:"6 ",incorrectOptions:["55","17","63",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少2张积分卡；如果每个同学发7张积分卡，就会少57张积分卡．",correctOption:"20 ",incorrectOptions:["63","69","39",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少6张积分卡；如果每个同学发9张积分卡，就会少69张积分卡．",correctOption:"12 ",incorrectOptions:["28","13","73",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少2张积分卡；如果每个同学发8张积分卡，就会少58张积分卡．",correctOption:"54 ",incorrectOptions:["35","24","44",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少2张积分卡；如果每个同学发9张积分卡，就会少80张积分卡．",correctOption:"37 ",incorrectOptions:["20","68","32",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少5张积分卡；如果每个同学发10张积分卡，就会少53张积分卡．",correctOption:"7 ",incorrectOptions:["61","72","64",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少5张积分卡；如果每个同学发14张积分卡，就会少117张积分卡．",correctOption:"79 ",incorrectOptions:["24","12","23",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少4张积分卡；如果每个同学发6张积分卡，就会少16张积分卡．",correctOption:"8 ",incorrectOptions:["35","30","13",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少5张积分卡；如果每个同学发12张积分卡，就会少23张积分卡．",correctOption:"1 ",incorrectOptions:["72","21","42",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少6张积分卡；如果每个同学发7张积分卡，就会少13张积分卡．",correctOption:"36 ",incorrectOptions:["43","52","55",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少4张积分卡；如果每个同学发11张积分卡，就会少94张积分卡．",correctOption:"16 ",incorrectOptions:["49","73","58",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少4张积分卡；如果每个同学发12张积分卡，就会少94张积分卡．",correctOption:"86 ",incorrectOptions:["52","77","17",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少2张积分卡；如果每个同学发8张积分卡，就会少47张积分卡．",correctOption:"25 ",incorrectOptions:["59","17","43",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少3张积分卡；如果每个同学发9张积分卡，就会少63张积分卡．",correctOption:"72 ",incorrectOptions:["26","46","56",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少6张积分卡；如果每个同学发13张积分卡，就会少90张积分卡．",correctOption:"66 ",incorrectOptions:["18","35","36",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少6张积分卡；如果每个同学发8张积分卡，就会少30张积分卡．",correctOption:"34 ",incorrectOptions:["13","23","44",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少3张积分卡；如果每个同学发6张积分卡，就会少23张积分卡．",correctOption:"37 ",incorrectOptions:["45","10","11",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少3张积分卡；如果每个同学发6张积分卡，就会少8张积分卡．",correctOption:"22 ",incorrectOptions:["47","34","27",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少2张积分卡；如果每个同学发5张积分卡，就会少15张积分卡．",correctOption:"50 ",incorrectOptions:["26","38","76",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少6张积分卡；如果每个同学发11张积分卡，就会少96张积分卡．",correctOption:"69 ",incorrectOptions:["71","44","38",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少5张积分卡；如果每个同学发14张积分卡，就会少125张积分卡．",correctOption:"85 ",incorrectOptions:["59","63","57",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少5张积分卡；如果每个同学发12张积分卡，就会少109张积分卡．",correctOption:"47 ",incorrectOptions:["62","40","12",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少3张积分卡；如果每个同学发6张积分卡，就会少23张积分卡．",correctOption:"37 ",incorrectOptions:["41","13","43",]},
{equation: "老师给班里同学发积分卡．如果每个同学发4张积分卡，就会少6张积分卡；如果每个同学发8张积分卡，就会少46张积分卡．",correctOption:"34 ",incorrectOptions:["39","63","73",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少4张积分卡；如果每个同学发11张积分卡，就会少49张积分卡．",correctOption:"50 ",incorrectOptions:["24","69","80",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少3张积分卡；如果每个同学发7张积分卡，就会少29张积分卡．",correctOption:"62 ",incorrectOptions:["43","24","71",]},
{equation: "老师给班里同学发积分卡．如果每个同学发6张积分卡，就会少3张积分卡；如果每个同学发12张积分卡，就会少69张积分卡．",correctOption:"63 ",incorrectOptions:["67","29","10",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少4张积分卡；如果每个同学发11张积分卡，就会少52张积分卡．",correctOption:"36 ",incorrectOptions:["55","17","49",]},
{equation: "老师给班里同学发积分卡．如果每个同学发2张积分卡，就会少3张积分卡；如果每个同学发5张积分卡，就会少21张积分卡．",correctOption:"9 ",incorrectOptions:["30","12","66",]},
{equation: "老师给班里同学发积分卡．如果每个同学发3张积分卡，就会少4张积分卡；如果每个同学发9张积分卡，就会少16张积分卡．",correctOption:"2 ",incorrectOptions:["77","27","19",]},
{equation: "老师给班里同学发积分卡．如果每个同学发5张积分卡，就会少3张积分卡；如果每个同学发14张积分卡，就会少129张积分卡．",correctOption:"67 ",incorrectOptions:["52","65","17",]},


]



const 盈亏问题02盈盈问题=[
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下112根香蕉；如果每只猴子分14根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"13 ",incorrectOptions:["1","10","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下99根香蕉；如果每只猴子分12根香蕉，还剩下9根香蕉．那么共有几只猴子？",correctOption:"10 ",incorrectOptions:["8","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下9根香蕉；如果每只猴子分5根香蕉，还剩下3根香蕉．那么共有几只猴子？",correctOption:"3 ",incorrectOptions:["4","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下12根香蕉；如果每只猴子分5根香蕉，还剩下6根香蕉．那么共有几只猴子？",correctOption:"2 ",incorrectOptions:["1","10","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下29根香蕉；如果每只猴子分12根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"3 ",incorrectOptions:["8","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下44根香蕉；如果每只猴子分11根香蕉，还剩下2根香蕉．那么共有几只猴子？",correctOption:"6 ",incorrectOptions:["8","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下84根香蕉；如果每只猴子分13根香蕉，还剩下4根香蕉．那么共有几只猴子？",correctOption:"10 ",incorrectOptions:["1","8","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下19根香蕉；如果每只猴子分12根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"2 ",incorrectOptions:["8","3","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下49根香蕉；如果每只猴子分10根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"7 ",incorrectOptions:["4","5","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下26根香蕉；如果每只猴子分5根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"7 ",incorrectOptions:["1","10","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下69根香蕉；如果每只猴子分8根香蕉，还剩下4根香蕉．那么共有几只猴子？",correctOption:"13 ",incorrectOptions:["8","4","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下16根香蕉；如果每只猴子分7根香蕉，还剩下2根香蕉．那么共有几只猴子？",correctOption:"7 ",incorrectOptions:["8","5","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下11根香蕉；如果每只猴子分7根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"2 ",incorrectOptions:["1","10","4",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下28根香蕉；如果每只猴子分8根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"4 ",incorrectOptions:["8","3","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下96根香蕉；如果每只猴子分11根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"13 ",incorrectOptions:["4","6","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下40根香蕉；如果每只猴子分13根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"5 ",incorrectOptions:["1","10","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下10根香蕉；如果每只猴子分3根香蕉，还剩下2根香蕉．那么共有几只猴子？",correctOption:"8 ",incorrectOptions:["6","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下14根香蕉；如果每只猴子分6根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"3 ",incorrectOptions:["4","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下38根香蕉；如果每只猴子分8根香蕉，还剩下2根香蕉．那么共有几只猴子？",correctOption:"9 ",incorrectOptions:["1","10","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下30根香蕉；如果每只猴子分8根香蕉，还剩下6根香蕉．那么共有几只猴子？",correctOption:"4 ",incorrectOptions:["3","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下29根香蕉；如果每只猴子分8根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"6 ",incorrectOptions:["4","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下47根香蕉；如果每只猴子分11根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"8 ",incorrectOptions:["1","10","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下27根香蕉；如果每只猴子分11根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"4 ",incorrectOptions:["8","5","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下18根香蕉；如果每只猴子分7根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"2 ",incorrectOptions:["8","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下17根香蕉；如果每只猴子分8根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"4 ",incorrectOptions:["8","6","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下68根香蕉；如果每只猴子分9根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"9 ",incorrectOptions:["4","6","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下22根香蕉；如果每只猴子分10根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"3 ",incorrectOptions:["1","10","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下51根香蕉；如果每只猴子分6根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"11 ",incorrectOptions:["6","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下107根香蕉；如果每只猴子分11根香蕉，还剩下3根香蕉．那么共有几只猴子？",correctOption:"13 ",incorrectOptions:["4","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下116根香蕉；如果每只猴子分14根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"12 ",incorrectOptions:["1","10","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下95根香蕉；如果每只猴子分10根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"11 ",incorrectOptions:["3","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下116根香蕉；如果每只猴子分10根香蕉，还剩下4根香蕉．那么共有几只猴子？",correctOption:"14 ",incorrectOptions:["4","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下69根香蕉；如果每只猴子分15根香蕉，还剩下6根香蕉．那么共有几只猴子？",correctOption:"7 ",incorrectOptions:["1","10","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下6根香蕉；如果每只猴子分7根香蕉，还剩下4根香蕉．那么共有几只猴子？",correctOption:"2 ",incorrectOptions:["8","4","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下76根香蕉；如果每只猴子分9根香蕉，还剩下6根香蕉．那么共有几只猴子？",correctOption:"10 ",incorrectOptions:["8","5","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下38根香蕉；如果每只猴子分11根香蕉，还剩下2根香蕉．那么共有几只猴子？",correctOption:"4 ",incorrectOptions:["6","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下110根香蕉；如果每只猴子分12根香蕉，还剩下2根香蕉．那么共有几只猴子？",correctOption:"12 ",incorrectOptions:["3","5","7",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下11根香蕉；如果每只猴子分3根香蕉，还剩下5根香蕉．那么共有几只猴子？",correctOption:"6 ",incorrectOptions:["1","10","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下19根香蕉；如果每只猴子分8根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"4 ",incorrectOptions:["3","2","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下71根香蕉；如果每只猴子分12根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"9 ",incorrectOptions:["4","5","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下18根香蕉；如果每只猴子分6根香蕉，还剩下7根香蕉．那么共有几只猴子？",correctOption:"11 ",incorrectOptions:["1","10","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下118根香蕉；如果每只猴子分12根香蕉，还剩下6根香蕉．那么共有几只猴子？",correctOption:"14 ",incorrectOptions:["8","4","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分2根香蕉，还剩下9根香蕉；如果每只猴子分5根香蕉，还剩下3根香蕉．那么共有几只猴子？",correctOption:"2 ",incorrectOptions:["8","4","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下84根香蕉；如果每只猴子分11根香蕉，还剩下9根香蕉．那么共有几只猴子？",correctOption:"15 ",incorrectOptions:["4","5","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分5根香蕉，还剩下46根香蕉；如果每只猴子分13根香蕉，还剩下6根香蕉．那么共有几只猴子？",correctOption:"5 ",incorrectOptions:["1","10","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下51根香蕉；如果每只猴子分12根香蕉，还剩下3根香蕉．那么共有几只猴子？",correctOption:"6 ",incorrectOptions:["8","4","5",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分6根香蕉，还剩下79根香蕉；如果每只猴子分13根香蕉，还剩下9根香蕉．那么共有几只猴子？",correctOption:"10 ",incorrectOptions:["8","4","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下86根香蕉；如果每只猴子分10根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"13 ",incorrectOptions:["4","5","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分4根香蕉，还剩下35根香蕉；如果每只猴子分8根香蕉，还剩下3根香蕉．那么共有几只猴子？",correctOption:"8 ",incorrectOptions:["1","10","6",]},
{equation: "雁雁把一些香蕉分给猴子们．如果每只猴子分3根香蕉，还剩下44根香蕉；如果每只猴子分6根香蕉，还剩下8根香蕉．那么共有几只猴子？",correctOption:"12 ",incorrectOptions:["8","4","6",]},



]



const  盈亏问题01分配中比较=[
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了17捆草．后来又来了2只羊，分给它们同样的草后，只剩下了13捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["1","10","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了25捆草．后来又来了2只羊，分给它们同样的草后，只剩下了19捆草．那么每只羊分到多少捆草．",correctOption:"3 ",incorrectOptions:["8","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了31捆草．后来又来了2只羊，分给它们同样的草后，只剩下了19捆草．那么每只羊分到多少捆草．",correctOption:"6 ",incorrectOptions:["4","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了22捆草．后来又来了6只羊，分给它们同样的草后，只剩下了10捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["1","10","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了29捆草．后来又来了3只羊，分给它们同样的草后，只剩下了20捆草．那么每只羊分到多少捆草．",correctOption:"3 ",incorrectOptions:["8","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了30捆草．后来又来了5只羊，分给它们同样的草后，只剩下了10捆草．那么每只羊分到多少捆草．",correctOption:"4 ",incorrectOptions:["8","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了21捆草．后来又来了3只羊，分给它们同样的草后，只剩下了15捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["1","10","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了30捆草．后来又来了4只羊，分给它们同样的草后，只剩下了18捆草．那么每只羊分到多少捆草．",correctOption:"3 ",incorrectOptions:["8","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了73捆草．后来又来了6只羊，分给它们同样的草后，只剩下了19捆草．那么每只羊分到多少捆草．",correctOption:"9 ",incorrectOptions:["4","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了54捆草．后来又来了5只羊，分给它们同样的草后，只剩下了14捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["1","10","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了28捆草．后来又来了6只羊，分给它们同样的草后，只剩下了16捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["8","4","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了66捆草．后来又来了6只羊，分给它们同样的草后，只剩下了12捆草．那么每只羊分到多少捆草．",correctOption:"9 ",incorrectOptions:["8","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了28捆草．后来又来了2只羊，分给它们同样的草后，只剩下了14捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["1","10","4",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了29捆草．后来又来了7只羊，分给它们同样的草后，只剩下了15捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["8","4","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了48捆草．后来又来了6只羊，分给它们同样的草后，只剩下了18捆草．那么每只羊分到多少捆草．",correctOption:"5 ",incorrectOptions:["4","6","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了60捆草．后来又来了6只羊，分给它们同样的草后，只剩下了18捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["1","10","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了41捆草．后来又来了3只羊，分给它们同样的草后，只剩下了17捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["6","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了52捆草．后来又来了5只羊，分给它们同样的草后，只剩下了12捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["4","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了40捆草．后来又来了4只羊，分给它们同样的草后，只剩下了12捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["1","10","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了50捆草．后来又来了5只羊，分给它们同样的草后，只剩下了10捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["3","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了36捆草．后来又来了2只羊，分给它们同样的草后，只剩下了18捆草．那么每只羊分到多少捆草．",correctOption:"9 ",incorrectOptions:["4","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了68捆草．后来又来了7只羊，分给它们同样的草后，只剩下了12捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["1","10","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了39捆草．后来又来了4只羊，分给它们同样的草后，只剩下了19捆草．那么每只羊分到多少捆草．",correctOption:"5 ",incorrectOptions:["8","4","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了35捆草．后来又来了4只羊，分给它们同样的草后，只剩下了19捆草．那么每只羊分到多少捆草．",correctOption:"4 ",incorrectOptions:["8","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了36捆草．后来又来了4只羊，分给它们同样的草后，只剩下了12捆草．那么每只羊分到多少捆草．",correctOption:"6 ",incorrectOptions:["8","4","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了42捆草．后来又来了4只羊，分给它们同样的草后，只剩下了10捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["4","6","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了21捆草．后来又来了3只羊，分给它们同样的草后，只剩下了12捆草．那么每只羊分到多少捆草．",correctOption:"3 ",incorrectOptions:["1","10","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了86捆草．后来又来了9只羊，分给它们同样的草后，只剩下了14捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["6","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了82捆草．后来又来了9只羊，分给它们同样的草后，只剩下了10捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["4","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了55捆草．后来又来了7只羊，分给它们同样的草后，只剩下了13捆草．那么每只羊分到多少捆草．",correctOption:"6 ",incorrectOptions:["1","10","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了32捆草．后来又来了4只羊，分给它们同样的草后，只剩下了16捆草．那么每只羊分到多少捆草．",correctOption:"4 ",incorrectOptions:["3","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了34捆草．后来又来了2只羊，分给它们同样的草后，只剩下了18捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["4","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了21捆草．后来又来了5只羊，分给它们同样的草后，只剩下了11捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["1","10","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了85捆草．后来又来了8只羊，分给它们同样的草后，只剩下了13捆草．那么每只羊分到多少捆草．",correctOption:"9 ",incorrectOptions:["8","4","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了75捆草．后来又来了9只羊，分给它们同样的草后，只剩下了12捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["8","5","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了35捆草．后来又来了6只羊，分给它们同样的草后，只剩下了11捆草．那么每只羊分到多少捆草．",correctOption:"4 ",incorrectOptions:["6","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了39捆草．后来又来了7只羊，分给它们同样的草后，只剩下了11捆草．那么每只羊分到多少捆草．",correctOption:"4 ",incorrectOptions:["3","5","7",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了55捆草．后来又来了5只羊，分给它们同样的草后，只剩下了10捆草．那么每只羊分到多少捆草．",correctOption:"9 ",incorrectOptions:["1","10","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了45捆草．后来又来了5只羊，分给它们同样的草后，只剩下了10捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["3","2","5",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了67捆草．后来又来了8只羊，分给它们同样的草后，只剩下了11捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["4","5","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了28捆草．后来又来了2只羊，分给它们同样的草后，只剩下了14捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["1","10","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了23捆草．后来又来了5只羊，分给它们同样的草后，只剩下了13捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["8","4","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了55捆草．后来又来了7只羊，分给它们同样的草后，只剩下了20捆草．那么每只羊分到多少捆草．",correctOption:"5 ",incorrectOptions:["8","4","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了60捆草．后来又来了5只羊，分给它们同样的草后，只剩下了20捆草．那么每只羊分到多少捆草．",correctOption:"8 ",incorrectOptions:["4","5","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了31捆草．后来又来了3只羊，分给它们同样的草后，只剩下了19捆草．那么每只羊分到多少捆草．",correctOption:"4 ",incorrectOptions:["1","10","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了28捆草．后来又来了4只羊，分给它们同样的草后，只剩下了16捆草．那么每只羊分到多少捆草．",correctOption:"3 ",incorrectOptions:["8","4","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了58捆草．后来又来了8只羊，分给它们同样的草后，只剩下了18捆草．那么每只羊分到多少捆草．",correctOption:"5 ",incorrectOptions:["8","4","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了27捆草．后来又来了8只羊，分给它们同样的草后，只剩下了11捆草．那么每只羊分到多少捆草．",correctOption:"2 ",incorrectOptions:["4","5","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了53捆草．后来又来了5只羊，分给它们同样的草后，只剩下了18捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["1","10","6",]},
{equation: "旦旦把一捆捆的草分给羊，每只羊分到的一样多，剩下了73捆草．后来又来了8只羊，分给它们同样的草后，只剩下了17捆草．那么每只羊分到多少捆草．",correctOption:"7 ",incorrectOptions:["8","4","6",]},

]



const  线性代数04内外积与正切=[
{equation: "\\begin{gather}直角坐标系中有两点A(-7,-7)、B(4,-5)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-7,-7)\\otimes(4,-5)}{(-7,-7)\\cdot(4,-5)}\\\\ (-7-7i)(4+5i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "9",incorrectOptions:["\\frac{8}{7}","-1","-\\frac{8}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,5)、B(-4,-6)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-4,5)\\otimes(-4,-6)}{(-4,5)\\cdot(-4,-6)}\\\\ (-4+5i)(-4+6i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{22}{7}",incorrectOptions:["-\\frac{1}{5}","\\frac{2}{3}","8"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,-8)、B(-4,5)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(8,-8)\\otimes(-4,5)}{(8,-8)\\cdot(-4,5)}\\\\ (8-8i)(-4-5i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{1}{9}",incorrectOptions:["-\\frac{2}{7}","-\\frac{2}{7}","\\frac{5}{4}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,7)、B(0,-7)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(4,7)\\otimes(0,-7)}{(4,7)\\cdot(0,-7)}\\\\ (4+7i)(0+7i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{4}{7}",incorrectOptions:["0","-\\frac{7}{8}","1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,1)、B(5,-10)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(8,1)\\otimes(5,-10)}{(8,1)\\cdot(5,-10)}\\\\ (8+i)(5+10i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{17}{6}",incorrectOptions:["-\\frac{5}{2}","4","1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,4)、B(0,3)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(1,4)\\otimes(0,3)}{(1,4)\\cdot(0,3)}\\\\ (1+4i)(0-3i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{1}{4}",incorrectOptions:["-\\frac{1}{2}","1","-\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-1)、B(-9,-6)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-2,-1)\\otimes(-9,-6)}{(-2,-1)\\cdot(-9,-6)}\\\\ (-2-i)(-9+6i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{1}{8}",incorrectOptions:["-\\frac{1}{3}","-1","2"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,-10)、B(-9,6)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-3,-10)\\otimes(-9,6)}{(-3,-10)\\cdot(-9,6)}\\\\ (-3-10i)(-9-6i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{36}{11}",incorrectOptions:["\\frac{3}{4}","-\\frac{8}{3}","-\\frac{8}{7}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,-1)、B(-6,-6)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(3,-1)\\otimes(-6,-6)}{(3,-1)\\cdot(-6,-6)}\\\\ (3-i)(-6+6i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-2",incorrectOptions:["-\\frac{3}{8}","-\\frac{3}{4}","\\frac{1}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-8,6)、B(0,8)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-8,6)\\otimes(0,8)}{(-8,6)\\cdot(0,8)}\\\\ (-8+6i)(0-8i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{4}{3}",incorrectOptions:["-6","\\frac{1}{3}","\\frac{7}{9}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,5)、B(-8,-10)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-5,5)\\otimes(-8,-10)}{(-5,5)\\cdot(-8,-10)}\\\\ (-5+5i)(-8+10i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-9",incorrectOptions:["0","\\frac{4}{7}","-\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,-6)、B(0,-9)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-5,-6)\\otimes(0,-9)}{(-5,-6)\\cdot(0,-9)}\\\\ (-5-6i)(0+9i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{5}{6}",incorrectOptions:["-\\frac{6}{7}","-1","3"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-6,-2)、B(-2,-3)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-6,-2)\\otimes(-2,-3)}{(-6,-2)\\cdot(-2,-3)}\\\\ (-6-2i)(-2+3i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{7}{9}",incorrectOptions:["\\frac{9}{2}","-\\frac{1}{4}","-2"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-8,5)、B(0,3)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-8,5)\\otimes(0,3)}{(-8,5)\\cdot(0,3)}\\\\ (-8+5i)(0-3i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{8}{5}",incorrectOptions:["0","-\\frac{4}{5}","-8"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,6)、B(-8,-4)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(8,6)\\otimes(-8,-4)}{(8,6)\\cdot(-8,-4)}\\\\ (8+6i)(-8+4i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{2}{11}",incorrectOptions:["-\\frac{4}{7}","-\\frac{7}{8}","-\\frac{5}{8}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,7)、B(5,-6)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(4,7)\\otimes(5,-6)}{(4,7)\\cdot(5,-6)}\\\\ (4+7i)(5+6i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{59}{22}",incorrectOptions:["-\\frac{7}{5}","-\\frac{3}{4}","-\\frac{7}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,5)、B(7,-10)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-2,5)\\otimes(7,-10)}{(-2,5)\\cdot(7,-10)}\\\\ (-2+5i)(7+10i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{15}{64}",incorrectOptions:["\\frac{6}{7}","\\frac{4}{3}","-\\frac{5}{8}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,6)、B(4,-10)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(0,6)\\otimes(4,-10)}{(0,6)\\cdot(4,-10)}\\\\ (0+6i)(4+10i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{2}{5}",incorrectOptions:["-\\frac{1}{3}","0","-5"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-7)、B(4,3)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(0,-7)\\otimes(4,3)}{(0,-7)\\cdot(4,3)}\\\\ (0-7i)(4-3i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{4}{3}",incorrectOptions:["5","-\\frac{1}{3}","-\\frac{1}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,6)、B(-4,1)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-7,6)\\otimes(-4,1)}{(-7,6)\\cdot(-4,1)}\\\\ (-7+6i)(-4-i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{1}{2}",incorrectOptions:["-\\frac{1}{9}","\\frac{7}{4}","-\\frac{1}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-9,-6)、B(7,6)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-9,-6)\\otimes(7,6)}{(-9,-6)\\cdot(7,6)}\\\\ (-9-6i)(7-6i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{4}{33}",incorrectOptions:["-3","-\\frac{1}{4}","\\frac{1}{8}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,3)、B(2,1)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(7,3)\\otimes(2,1)}{(7,3)\\cdot(2,1)}\\\\ (7+3i)(2-i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{1}{17}",incorrectOptions:["-1","\\frac{3}{8}","-\\frac{1}{7}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,4)、B(4,-1)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(8,4)\\otimes(4,-1)}{(8,4)\\cdot(4,-1)}\\\\ (8+4i)(4+i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{6}{7}",incorrectOptions:["-6","4","\\frac{7}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-8,4)、B(-10,7)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-8,4)\\otimes(-10,7)}{(-8,4)\\cdot(-10,7)}\\\\ (-8+4i)(-10-7i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{4}{27}",incorrectOptions:["-1","-\\frac{8}{7}","-\\frac{1}{4}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,0)、B(7,0)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(3,0)\\otimes(7,0)}{(3,0)\\cdot(7,0)}\\\\ (3+0i)(7+0i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "0",incorrectOptions:["\\frac{1}{3}","-\\frac{4}{9}","\\frac{5}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,-7)、B(-7,-8)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-7,-7)\\otimes(-7,-8)}{(-7,-7)\\cdot(-7,-8)}\\\\ (-7-7i)(-7+8i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "\\frac{1}{15}",incorrectOptions:["-\\frac{4}{5}","-1","0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(5,-1)、B(-3,1)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(5,-1)\\otimes(-3,1)}{(5,-1)\\cdot(-3,1)}\\\\ (5-i)(-3-i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{1}{8}",incorrectOptions:["-\\frac{10}{7}","-1","-\\frac{9}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,4)、B(-1,-5)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(4,4)\\otimes(-1,-5)}{(4,4)\\cdot(-1,-5)}\\\\ (4+4i)(-1+5i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{2}{3}",incorrectOptions:["-\\frac{1}{5}","\\frac{3}{4}","-\\frac{3}{10}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-6,-9)、B(8,3)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-6,-9)\\otimes(8,3)}{(-6,-9)\\cdot(8,3)}\\\\ (-6-9i)(8-3i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{18}{25}",incorrectOptions:["-4","\\frac{8}{3}","\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,-10)、B(6,7)\\textup{;}\\\\则tan∠AOB=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\ tan∠AOB=\\frac{(-1,-10)\\otimes(6,7)}{(-1,-10)\\cdot(6,7)}\\\\ (-1-10i)(6-7i)=? \\\\向量法,复数法,解析法,面积法(有推导才有用)...... \\end{gather}",correctOption: "-\\frac{53}{76}",incorrectOptions:["-\\frac{3}{4}","-1","-\\frac{1}{7}"]},
]








const 方程应用牛吃草最多能放几头牛=[
{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么56天能把草吃完；如果只放养18头牛,那么48天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["11 ","9","6"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养13头牛,那么75天能把草吃完；如果只放养20头牛,那么40天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["11 ","6","8"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养12头牛,那么44天能把草吃完；如果只放养15头牛,那么32天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["6 ","3","11"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养12头牛,那么28天能把草吃完；如果只放养11头牛,那么32天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["9 ","2","10"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么66天能把草吃完；如果只放养17头牛,那么60天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "6",incorrectOptions:["3 ","2","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养13头牛,那么70天能把草吃完；如果只放养19头牛,那么40天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["10 ","7","11"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养19头牛,那么65天能把草吃完；如果只放养18头牛,那么70天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["2 ","6","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养19头牛,那么32天能把草吃完；如果只放养12头牛,那么60天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["8 ","7","2"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养22头牛,那么63天能把草吃完；如果只放养16头牛,那么105天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "7",incorrectOptions:["4 ","3","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养21头牛,那么84天能把草吃完；如果只放养19头牛,那么98天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "7",incorrectOptions:["5 ","3","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养15头牛,那么70天能把草吃完；如果只放养19头牛,那么50天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["10 ","8","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养15头牛,那么33天能把草吃完；如果只放养14头牛,那么36天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["6 ","10","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养18头牛,那么21天能把草吃完；如果只放养10头牛,那么45天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["7 ","6","11"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养19头牛,那么60天能把草吃完；如果只放养17头牛,那么70天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["10 ","8","4"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养12头牛,那么36天能把草吃完；如果只放养13头牛,那么32天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["6 ","2","10"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养11头牛,那么56天能把草吃完；如果只放养18头牛,那么28天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["6 ","10","2"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养19头牛,那么63天能把草吃完；如果只放养16头牛,那么84天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "7",incorrectOptions:["4 ","6","5"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养18头牛,那么35天能把草吃完；如果只放养12头牛,那么65天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["8 ","4","11"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养13头牛,那么28天能把草吃完；如果只放养11头牛,那么36天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["11 ","8","3"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么50天能把草吃完；如果只放养15头牛,那么55天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["4 ","7","3"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么78天能把草吃完；如果只放养19头牛,那么60天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "6",incorrectOptions:["10 ","11","7"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养15头牛,那么42天能把草吃完；如果只放养17头牛,那么36天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["9 ","7","2"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养19头牛,那么48天能把草吃完；如果只放养16头牛,那么60天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["9 ","3","10"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养21头牛,那么105天能把草吃完；如果只放养22头牛,那么98天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "7",incorrectOptions:["4 ","10","3"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养20头牛,那么50天能把草吃完；如果只放养15头牛,那么75天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["10 ","9","11"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养23头牛,那么120天能把草吃完；如果只放养22头牛,那么130天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "10",incorrectOptions:["2 ","9","3"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么24天能把草吃完；如果只放养11头牛,那么39天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["6 ","10","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养21头牛,那么112天能把草吃完；如果只放养22头牛,那么104天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "8",incorrectOptions:["9 ","10","7"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养20头牛,那么77天能把草吃完；如果只放养18头牛,那么91天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "7",incorrectOptions:["5 ","11","3"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养14头牛,那么70天能把草吃完；如果只放养19头牛,那么45天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["8 ","2","7"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养11头牛,那么18天能把草吃完；如果只放养9头牛,那么24天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["11 ","6","10"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养10头牛,那么39天能把草吃完；如果只放养16头牛,那么21天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["4 ","5","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养18头牛,那么70天能把草吃完；如果只放养17头牛,那么77天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "7",incorrectOptions:["3 ","4","9"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么24天能把草吃完；如果只放养10头牛,那么48天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["6 ","9","11"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养14头牛,那么39天能把草吃完；如果只放养16头牛,那么33天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["2 ","10","4"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养20头牛,那么54天能把草吃完；如果只放养15头牛,那么84天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "6",incorrectOptions:["9 ","11","10"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养22头牛,那么126天能把草吃完；如果只放养23头牛,那么117天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "9",incorrectOptions:["2 ","7","4"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养23头牛,那么150天能把草吃完；如果只放养25头牛,那么130天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "10",incorrectOptions:["4 ","8","7"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么45天能把草吃完；如果只放养14头牛,那么55天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["10 ","6","8"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养16头牛,那么90天能把草吃完；如果只放养21头牛,那么60天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "6",incorrectOptions:["5 ","8","2"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养25头牛,那么143天能把草吃完；如果只放养24头牛,那么154天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "11",incorrectOptions:["3 ","2","4"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养21头牛,那么117天能把草吃完；如果只放养22头牛,那么108天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "9",incorrectOptions:["8 ","2","5"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养10头牛,那么39天能把草吃完；如果只放养16头牛,那么21天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["2 ","11","7"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养13头牛,那么56天能把草吃完；如果只放养18头牛,那么36天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["2 ","11","3"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养15头牛,那么40天能把草吃完；如果只放养14头牛,那么44天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["9 ","7","5"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养25头牛,那么120天能把草吃完；如果只放养22头牛,那么150天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "10",incorrectOptions:["2 ","7","5"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养11头牛,那么56天能把草吃完；如果只放养18头牛,那么28天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "4",incorrectOptions:["3 ","11","5"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养18头牛,那么18天能把草吃完；如果只放养9头牛,那么45天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "3",incorrectOptions:["5 ","10","6"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养24头牛,那么99天能把草吃完；如果只放养20头牛,那么135天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "9",incorrectOptions:["4 ","7","11"]},

{equation: "有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。如果在牧场上放养13头牛,那么70天能把草吃完；如果只放养19头牛,那么40天能把草吃完。如果要想一直有草吃,那么最多放几头牛？",correctOption: "5",incorrectOptions:["6 ","11","2"]},




]



const 直角坐标系运算04点到直线距离 =[

{equation: "\\begin{gather}直角坐标系中有直线-2x-y+12=0\\textup{;}\\\\则点(-9,-10)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "8\\sqrt{5}",incorrectOptions:["\\frac{23\\sqrt{5}}{5}","\\frac{11\\sqrt{5}}{5}","\\frac{27\\sqrt{5}}{5}"]},

{equation: "\\begin{gather}直角坐标系中有直线x+2y-7=0\\textup{;}\\\\则点(-3,-5)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "4\\sqrt{5}",incorrectOptions:["\\frac{16\\sqrt{5}}{5}","\\frac{24\\sqrt{5}}{5}","\\frac{12\\sqrt{5}}{5}"]},

{equation: "\\begin{gather}直角坐标系中有直线-2x+3y+32=0\\textup{;}\\\\则点(-2,0)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{36\\sqrt{13}}{13}",incorrectOptions:["\\frac{18\\sqrt{13}}{13}","\\frac{23\\sqrt{13}}{13}","\\frac{17\\sqrt{13}}{13}"]},

{equation: "\\begin{gather}直角坐标系中有直线-6x+5y-34=0\\textup{;}\\\\则点(-2,-5)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{47\\sqrt{61}}{61}",incorrectOptions:["\\frac{23\\sqrt{61}}{61}","\\frac{28\\sqrt{61}}{61}","\\frac{10\\sqrt{61}}{61}"]},

{equation: "\\begin{gather}直角坐标系中有直线x+6y+38=0\\textup{;}\\\\则点(-5,3)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{51\\sqrt{37}}{37}",incorrectOptions:["\\frac{15\\sqrt{37}}{37}","\\frac{17\\sqrt{37}}{37}","\\frac{24\\sqrt{37}}{37}"]},

{equation: "\\begin{gather}直角坐标系中有直线-14x+13y-10=0\\textup{;}\\\\则点(3,-6)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{26\\sqrt{365}}{73}",incorrectOptions:["\\frac{21\\sqrt{365}}{365}","\\frac{26\\sqrt{365}}{365}","\\frac{22\\sqrt{365}}{365}"]},

{equation: "\\begin{gather}直角坐标系中有直线-x-y+3=0\\textup{;}\\\\则点(3,0)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "0",incorrectOptions:["\\frac{\\sqrt{2}}{2}","\\frac{3\\sqrt{2}}{2}","\\frac{21\\sqrt{2}}{2}"]},

{equation: "\\begin{gather}直角坐标系中有直线10x+7y+12=0\\textup{;}\\\\则点(-9,-1)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{85\\sqrt{149}}{149}",incorrectOptions:["\\frac{16\\sqrt{149}}{149}","\\frac{14\\sqrt{149}}{149}","\\frac{11\\sqrt{149}}{149}"]},

{equation: "\\begin{gather}直角坐标系中有直线-x+2y-13=0\\textup{;}\\\\则点(-5,-5)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{18\\sqrt{5}}{5}",incorrectOptions:["\\frac{12\\sqrt{5}}{5}","\\frac{13\\sqrt{5}}{5}","\\frac{16\\sqrt{5}}{5}"]},

{equation: "\\begin{gather}直角坐标系中有直线-5x-y+13=0\\textup{;}\\\\则点(-4,7)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\sqrt{26}",incorrectOptions:["\\frac{27\\sqrt{26}}{26}","\\frac{21\\sqrt{26}}{26}","\\frac{9\\sqrt{26}}{26}"]},

{equation: "\\begin{gather}直角坐标系中有直线13x+6y+54=0\\textup{;}\\\\则点(-4,7)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{44\\sqrt{205}}{205}",incorrectOptions:["\\frac{26\\sqrt{205}}{205}","\\frac{27\\sqrt{205}}{205}","\\frac{23\\sqrt{205}}{205}"]},


{equation: "\\begin{gather}直角坐标系中有直线7x+10y-11=0\\textup{;}\\\\则点(7,7)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{108\\sqrt{149}}{149}",incorrectOptions:["\\frac{17\\sqrt{149}}{149}","\\frac{13\\sqrt{149}}{149}","\\frac{11\\sqrt{149}}{149}"]},

{equation: "\\begin{gather}直角坐标系中有直线4x+9y+40=0\\textup{;}\\\\则点(-8,-7)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{55\\sqrt{97}}{97}",incorrectOptions:["\\frac{13\\sqrt{97}}{97}","\\frac{17\\sqrt{97}}{97}","\\frac{28\\sqrt{97}}{97}"]},



{equation: "\\begin{gather}直角坐标系中有直线3x+11y-64=0\\textup{;}\\\\则点(-9,-6)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{157\\sqrt{130}}{130}",incorrectOptions:["\\frac{23\\sqrt{130}}{130}","\\frac{20\\sqrt{130}}{13}","\\frac{18\\sqrt{130}}{65}"]},




{equation: "\\begin{gather}直角坐标系中有直线16x+9y+17=0\\textup{;}\\\\则点(2,-9)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{32\\sqrt{337}}{337}",incorrectOptions:["\\frac{12\\sqrt{337}}{337}","\\frac{19\\sqrt{337}}{337}","\\frac{25\\sqrt{337}}{337}"]},

{equation: "\\begin{gather}直角坐标系中有直线x-12y-79=0\\textup{;}\\\\则点(-7,5)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{146\\sqrt{145}}{145}",incorrectOptions:["\\frac{15\\sqrt{145}}{145}","\\frac{23\\sqrt{145}}{145}","\\frac{18\\sqrt{145}}{145}"]},



{equation: "\\begin{gather}直角坐标系中有直线-x+y+4=0\\textup{;}\\\\则点(-7,-6)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{5\\sqrt{2}}{2}",incorrectOptions:["13\\sqrt{2}","8\\sqrt{2}","\\frac{15\\sqrt{2}}{2}"]},


{equation: "\\begin{gather}直角坐标系中有直线3x-y-5=0\\textup{;}\\\\则点(-2,4)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{\\sqrt{10}}{2}",incorrectOptions:["\\frac{19\\sqrt{10}}{10}","\\frac{9\\sqrt{10}}{5}","\\frac{27\\sqrt{10}}{10}"]},



{equation: "\\begin{gather}直角坐标系中有直线-3x-y+11=0\\textup{;}\\\\则点(-2,5)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{6\\sqrt{10}}{5}",incorrectOptions:["\\frac{12\\sqrt{10}}{5}","\\frac{7\\sqrt{10}}{10}","\\frac{7\\sqrt{10}}{10}"]},

{equation: "\\begin{gather}直角坐标系中有直线-7x-2y-35=0\\textup{;}\\\\则点(4,-8)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{47\\sqrt{53}}{53}",incorrectOptions:["\\frac{11\\sqrt{26}}{26}","\\frac{20\\sqrt{17}}{17}","\\frac{7\\sqrt{10}}{5}"]},

{equation: "\\begin{gather}直角坐标系中有直线x+3y-7=0\\textup{;}\\\\则点(1,6)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{6\\sqrt{10}}{5}",incorrectOptions:["\\frac{9\\sqrt{10}}{10}","\\frac{14\\sqrt{10}}{5}","\\frac{8\\sqrt{10}}{5}"]},

{equation: "\\begin{gather}直角坐标系中有直线3x+y-23=0\\textup{;}\\\\则点(-4,-3)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{19\\sqrt{10}}{5}",incorrectOptions:["\\frac{13\\sqrt{10}}{5}","\\frac{6\\sqrt{10}}{5}","\\frac{13\\sqrt{10}}{10}"]},

{equation: "\\begin{gather}直角坐标系中有直线3x-2y+22=0\\textup{;}\\\\则点(2,-8)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{44\\sqrt{13}}{13}",incorrectOptions:["\\frac{28\\sqrt{13}}{13}","\\frac{16\\sqrt{13}}{13}","\\frac{15\\sqrt{13}}{13}"]},



{equation: "\\begin{gather}直角坐标系中有直线-x-2y-3=0\\textup{;}\\\\则点(8,-9)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{7\\sqrt{5}}{5}",incorrectOptions:["\\frac{18\\sqrt{5}}{5}","\\frac{23\\sqrt{5}}{5}","\\frac{12\\sqrt{5}}{5}"]},


{equation: "\\begin{gather}直角坐标系中有直线-5x+3y+23=0\\textup{;}\\\\则点(7,0)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{12\\sqrt{34}}{17}",incorrectOptions:["\\frac{15\\sqrt{34}}{34}","\\frac{10\\sqrt{34}}{17}","\\frac{13\\sqrt{34}}{34}"]},


{equation: "\\begin{gather}直角坐标系中有直线-x+3y-17=0\\textup{;}\\\\则点(2,-2)到直线AB距离\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\比例法;向量法;公式法......\\end{gather}",correctOption: "\\frac{5\\sqrt{10}}{2}",incorrectOptions:["\\frac{17\\sqrt{10}}{5}","\\frac{16\\sqrt{10}}{5}","\\frac{26\\sqrt{10}}{5}"]},





]




const 直角坐标系运算03两点求解析式 =[

{equation: "\\begin{gather}直角坐标系中有两点A(-9,-6)、B(-8,-8)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "2x+y+24=0",incorrectOptions:["-10x-9y-46=0","-x-y-10=0","-3x+17y+109=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,-8)、B(7,5)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-13x+y+86=0",incorrectOptions:["-4x+5y+12=0","-5x-4y-45=0","-13x-10y-50=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-2)、B(7,2)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-4x+7y+14=0",incorrectOptions:["9x-14y+39=0","-11x-14y+40=0","x-3y+17=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,-6)、B(6,-5)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-x+10y+56=0",incorrectOptions:["5x+4y-24=0","7x+6y-20=0","-5x-9y-66=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,-9)、B(8,3)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-12x+13y+57=0",incorrectOptions:["11x-12y+39=0","-5x-3y+40=0","13x+15y+12=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,-5)、B(6,-2)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-3x+5y+28=0",incorrectOptions:["13x+4y+59=0","7x-8y+9=0","3x+14y-7=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(5,1)、B(-8,-7)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "8x-13y-27=0",incorrectOptions:["7x-11y-27=0","-5x+6y-10=0","3x-7y+38=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,6)、B(-9,-9)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "15x-13y+18=0",incorrectOptions:["-11x-3y-68=0","-16x-5y-93=0","-7x+2y-1=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-10)、B(0,7)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-17x+2y-14=0",incorrectOptions:["2x+6y+35=0","5x-14y-34=0","-3x-8y+25=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,-1)、B(-5,-6)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "5x-11y-41=0",incorrectOptions:["-17x-13y+2=0","7x-3y+34=0","2x-3y+19=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,0)、B(-9,-3)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "3x+y+30=0",incorrectOptions:["-6x-y+2=0","-11x+12y+52=0","-6x-y-54=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-9,-2)、B(2,7)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-9x+11y-59=0",incorrectOptions:["-13x+8y+46=0","8x-11y-24=0","12x-5y+58=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,1)、B(-3,8)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-7x+y-29=0",incorrectOptions:["2x-7y-16=0","x+10y+44=0","-15x-2y+104=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,-4)、B(-2,5)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "3x+y+1=0",incorrectOptions:["10x-7y-24=0","-17x-18y-26=0","-3x-y-15=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-8,4)、B(7,7)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-x+5y-28=0",incorrectOptions:["9x-8y-48=0","-x-7y+33=0","-12x-13y-4=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,3)、B(0,2)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "x-3y+6=0",incorrectOptions:["-4x-5y+10=0","-13x-11y-27=0","5x+3y-2=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-7)、B(3,4)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-11x+3y+21=0",incorrectOptions:["4x+3y+34=0","x+10y+59=0","x+3y+22=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,-3)、B(-1,-6)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "x+y+7=0",incorrectOptions:["-6x+8y+7=0","-4x-6y-50=0","4x-13y-106=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-8,-9)、B(-3,7)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-16x+5y-83=0",incorrectOptions:["-x+10y+51=0","16x-7y-86=0","18x+5y+22=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,-7)、B(4,-1)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-3x-y+11=0",incorrectOptions:["2x-4y-20=0","-3x-4y+9=0","-5x-12y+8=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-7)、B(-1,4)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-11x-y-7=0",incorrectOptions:["-6x+7y-37=0","x-6y+51=0","-5x+3y-39=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,-3)、B(8,0)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-3x+4y+24=0",incorrectOptions:["9x+y-62=0","-3x+8y+16=0","-x+y+1=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-9,2)、B(4,-2)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "4x+13y+10=0",incorrectOptions:["-2x-7y+37=0","7x+9y-21=0","-8x+3y=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,6)、B(-2,-1)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "7x+y+15=0",incorrectOptions:["-8x+9y+26=0","-7x+8y+59=0","-7x+3y-18=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(2,0)、B(-10,-8)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "2x-3y-4=0",incorrectOptions:["-x-y-5=0","-2x-15y-76=0","x+2y-10=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,0)、B(7,-10)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "10x+17y+100=0",incorrectOptions:["5x-2y+35=0","-x-y-2=0","x-4y-19=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,6)、B(-3,-2)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "8x-7y+10=0",incorrectOptions:["3x+11y+90=0","3x+4y+18=0","x-6y+25=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,8)、B(-7,6)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "x-5y+37=0",incorrectOptions:["-7x-3y+20=0","x-8y-76=0","-6x+5y+8=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,1)、B(3,7)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "-6x-y+25=0",incorrectOptions:["15x-y+7=0","-9x+14y+3=0","-3x+2y-12=0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,0)、B(-6,-3)\\textup{;}\\\\直线AB解析式l_{AB}:\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\\\方程法\\textup{;}斜截法\\textup{;}拉格朗日插值法\\textup{;}共线面积为零法......\\end{gather}",correctOption: "x-3y-3=0",incorrectOptions:["x+15y-81=0","-x-2y-15=0","-2x-9y-44=0"]},

]





const  方程应用行程02变速到达 =[
{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升5千米，则36小时到达。\\\\如果每小时减少5千米，则126小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "56",incorrectOptions:["9 ","45","40"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升1千米，则80小时到达。\\\\如果每小时减少2千米，则110小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "88",incorrectOptions:["16 ","12","12"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则110小时到达。\\\\如果每小时减少1千米，则209小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "190",incorrectOptions:["55 ","28","12"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则8小时到达。\\\\如果每小时减少2千米，则48小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "24",incorrectOptions:["30 ","35","8"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升9千米，则10小时到达。\\\\如果每小时减少3千米，则70小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "28",incorrectOptions:["30 ","12","14"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升7千米，则44小时到达。\\\\如果每小时减少7千米，则198小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "72",incorrectOptions:["18 ","4","16"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升2千米，则45小时到达。\\\\如果每小时减少4千米，则99小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "55",incorrectOptions:["110 ","77","10"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升1千米，则66小时到达。\\\\如果每小时减少5千米，则132小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "72",incorrectOptions:["77 ","81","30"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升6千米，则22小时到达。\\\\如果每小时减少9千米，则187小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "34",incorrectOptions:["99 ","24","64"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则11小时到达。\\\\如果每小时减少10千米，则209小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "19",incorrectOptions:["18 ","12","40"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升10千米，则20小时到达。\\\\如果每小时减少1千米，则75小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "60",incorrectOptions:["70 ","45","30"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则6小时到达。\\\\如果每小时减少1千米，则33小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "22",incorrectOptions:["100 ","36","70"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升9千米，则99小时到达。\\\\如果每小时减少2千米，则220小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "180",incorrectOptions:["72 ","100","60"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升4千米，则11小时到达。\\\\如果每小时减少10千米，则165小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "15",incorrectOptions:["63 ","90","64"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升6千米，则3小时到达。\\\\如果每小时减少2千米，则27小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "9",incorrectOptions:["50 ","110","20"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升10千米，则15小时到达。\\\\如果每小时减少2千米，则75小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "45",incorrectOptions:["4 ","44","42"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升10千米，则18小时到达。\\\\如果每小时减少7千米，则171小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "38",incorrectOptions:["21 ","24","72"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升4千米，则24小时到达。\\\\如果每小时减少5千米，则96小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "36",incorrectOptions:["48 ","40","35"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升5千米，则36小时到达。\\\\如果每小时减少5千米，则126小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "56",incorrectOptions:["88 ","48","10"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升10千米，则55小时到达。\\\\如果每小时减少6千米，则231小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "105",incorrectOptions:["10 ","12","18"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升9千米，则40小时到达。\\\\如果每小时减少3千米，则136小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "85",incorrectOptions:["42 ","20","80"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升1千米，则63小时到达。\\\\如果每小时减少2千米，则90小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "70",incorrectOptions:["50 ","55","21"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则30小时到达。\\\\如果每小时减少1千米，则84小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "70",incorrectOptions:["25 ","6","30"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则14小时到达。\\\\如果每小时减少5千米，则105小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "30",incorrectOptions:["36 ","14","50"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升9千米，则24小时到达。\\\\如果每小时减少2千米，则90小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "60",incorrectOptions:["72 ","18","100"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升10千米，则42小时到达。\\\\如果每小时减少1千米，则119小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "102",incorrectOptions:["100 ","30","20"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升6千米，则56小时到达。\\\\如果每小时减少1千米，则112小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "98",incorrectOptions:["18 ","36","27"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升5千米，则60小时到达。\\\\如果每小时减少4千米，则150小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "90",incorrectOptions:["15 ","27","30"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升2千米，则18小时到达。\\\\如果每小时减少7千米，则99小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "22",incorrectOptions:["18 ","30","15"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则42小时到达。\\\\如果每小时减少1千米，则105小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "90",incorrectOptions:["48 ","33","22"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则80小时到达。\\\\如果每小时减少2千米，则180小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "144",incorrectOptions:["40 ","33","9"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升5千米，则45小时到达。\\\\如果每小时减少4千米，则126小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "70",incorrectOptions:["18 ","77","49"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升4千米，则40小时到达。\\\\如果每小时减少6千米，则140小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "56",incorrectOptions:["18 ","14","27"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升7千米，则88小时到达。\\\\如果每小时减少3千米，则198小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "144",incorrectOptions:["6 ","16","32"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升5千米，则24小时到达。\\\\如果每小时减少2千米，则66小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "44",incorrectOptions:["20 ","48","18"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升2千米，则24小时到达。\\\\如果每小时减少2千米，则48小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "32",incorrectOptions:["10 ","18","33"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升5千米，则8小时到达。\\\\如果每小时减少2千米，则36小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "18",incorrectOptions:["70 ","27","56"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升2千米，则9小时到达。\\\\如果每小时减少8千米，则99小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "11",incorrectOptions:["80 ","40","12"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升9千米，则40小时到达。\\\\如果每小时减少3千米，则136小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "85",incorrectOptions:["20 ","4","50"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升2千米，则80小时到达。\\\\如果每小时减少2千米，则120小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "96",incorrectOptions:["121 ","10","64"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升1千米，则9小时到达。\\\\如果每小时减少8千米，则90小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "10",incorrectOptions:["70 ","88","72"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升7千米，则40小时到达。\\\\如果每小时减少3千米，则120小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "75",incorrectOptions:["88 ","44","24"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则99小时到达。\\\\如果每小时减少2千米，则209小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "171",incorrectOptions:["100 ","16","12"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升2千米，则55小时到达。\\\\如果每小时减少6千米，则143小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "65",incorrectOptions:["32 ","80","77"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升10千米，则66小时到达。\\\\如果每小时减少5千米，则231小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "126",incorrectOptions:["12 ","15","110"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则50小时到达。\\\\如果每小时减少5千米，则180小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "90",incorrectOptions:["42 ","77","15"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升9千米，则8小时到达。\\\\如果每小时减少2千米，则52小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "26",incorrectOptions:["45 ","55","36"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升3千米，则60小时到达。\\\\如果每小时减少4千米，则130小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "78",incorrectOptions:["99 ","20","30"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则6小时到达。\\\\如果每小时减少1千米，则33小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "22",incorrectOptions:["77 ","40","6"]},

{equation: "\\[{\\begin{array}{c}汽车从A地向B地出发。\\\\汽车速度如果每小时提升8千米，则88小时到达。\\\\如果每小时减少3千米，则209小时到达。。\\\\请问如果按原速度几小时到达？\\end{array}}\\]",correctOption: "152",incorrectOptions:["22 ","6","20"]},


]


const  方程应用行程01简单相遇追及 =[
{equation: "\\[{\\begin{array}{c}AB两相距126千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时39千米，\\\\乙车速度为每小时18千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "6",incorrectOptions:["5 ","8","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距34千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时29千米，\\\\乙车速度为每小时12千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["4 ","6","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距115千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时33千米，\\\\乙车速度为每小时10千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "5",incorrectOptions:["9 ","7","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距21千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时35千米，\\\\乙车速度为每小时28千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["9 ","4","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距45千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时25千米，\\\\乙车速度为每小时10千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["7 ","5","8"]},

{equation: "\\[{\\begin{array}{c}AB两相距34千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时30千米，\\\\乙车速度为每小时13千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["4 ","5","1"]},

{equation: "\\[{\\begin{array}{c}AB两相距30千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时28千米，\\\\乙车速度为每小时18千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["8 ","6","1"]},

{equation: "\\[{\\begin{array}{c}AB两相距64千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时39千米，\\\\乙车速度为每小时23千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "4",incorrectOptions:["9 ","8","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距68千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时33千米，\\\\乙车速度为每小时16千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "4",incorrectOptions:["3 ","6","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距40千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时22千米，\\\\乙车速度为每小时12千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "4",incorrectOptions:["9 ","8","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距16千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时22千米，\\\\乙车速度为每小时14千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["1 ","4","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距84千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时31千米，\\\\乙车速度为每小时17千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "6",incorrectOptions:["3 ","2","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距24千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时34千米，\\\\乙车速度为每小时22千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["3 ","9","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距22千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时23千米，\\\\乙车速度为每小时12千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["8 ","6","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距39千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时32千米，\\\\乙车速度为每小时19千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["5 ","7","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距46千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时39千米，\\\\乙车速度为每小时16千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["6 ","4","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距42千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时35千米，\\\\乙车速度为每小时14千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["3 ","9","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距24千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时34千米，\\\\乙车速度为每小时26千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["5 ","7","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距18千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时35千米，\\\\乙车速度为每小时26千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["4 ","1","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距90千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时34千米，\\\\乙车速度为每小时16千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "5",incorrectOptions:["9 ","8","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距26千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时26千米，\\\\乙车速度为每小时13千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["9 ","6","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距22千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时33千米，\\\\乙车速度为每小时22千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["4 ","1","8"]},

{equation: "\\[{\\begin{array}{c}AB两相距88千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时33千米，\\\\乙车速度为每小时11千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "4",incorrectOptions:["1 ","6","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距12千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时30千米，\\\\乙车速度为每小时24千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["3 ","6","1"]},

{equation: "\\[{\\begin{array}{c}AB两相距108千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时32千米，\\\\乙车速度为每小时20千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "9",incorrectOptions:["4 ","1","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距21千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时22千米，\\\\乙车速度为每小时15千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["6 ","7","1"]},

{equation: "\\[{\\begin{array}{c}AB两相距64千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时31千米，\\\\乙车速度为每小时15千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "4",incorrectOptions:["1 ","8","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距21千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时30千米，\\\\乙车速度为每小时23千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["5 ","1","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距33千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时31千米，\\\\乙车速度为每小时20千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["2 ","4","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距48千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时28千米，\\\\乙车速度为每小时12千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["8 ","7","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距63千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时37千米，\\\\乙车速度为每小时28千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "7",incorrectOptions:["9 ","3","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距30千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时26千米，\\\\乙车速度为每小时20千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "5",incorrectOptions:["7 ","9","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距54千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时23千米，\\\\乙车速度为每小时17千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "9",incorrectOptions:["1 ","6","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距39千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时32千米，\\\\乙车速度为每小时19千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["5 ","8","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距51千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时28千米，\\\\乙车速度为每小时11千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["8 ","4","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距60千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时26千米，\\\\乙车速度为每小时11千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "4",incorrectOptions:["2 ","5","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距18千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时25千米，\\\\乙车速度为每小时19千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["2 ","8","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距38千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时29千米，\\\\乙车速度为每小时10千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["4 ","1","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距133千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时32千米，\\\\乙车速度为每小时13千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "7",incorrectOptions:["9 ","3","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距57千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时29千米，\\\\乙车速度为每小时10千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["1 ","4","8"]},

{equation: "\\[{\\begin{array}{c}AB两相距24千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时38千米，\\\\乙车速度为每小时26千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "2",incorrectOptions:["4 ","5","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距30千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时25千米，\\\\乙车速度为每小时15千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["5 ","9","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距60千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时35千米，\\\\乙车速度为每小时15千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "3",incorrectOptions:["1 ","7","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距64千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时35千米，\\\\乙车速度为每小时19千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "4",incorrectOptions:["6 ","2","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距168千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时34千米，\\\\乙车速度为每小时13千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "8",incorrectOptions:["5 ","3","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距126千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时39千米，\\\\乙车速度为每小时21千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "7",incorrectOptions:["4 ","3","1"]},

{equation: "\\[{\\begin{array}{c}AB两相距120千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时39千米，\\\\乙车速度为每小时19千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "6",incorrectOptions:["7 ","1","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距56千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时28千米，\\\\乙车速度为每小时21千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "8",incorrectOptions:["3 ","1","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距112千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时38千米，\\\\乙车速度为每小时22千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "7",incorrectOptions:["4 ","9","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距95千米。\\\\甲车在后，乙车在前。同向而行。\\\\甲车速度为每小时31千米，\\\\乙车速度为每小时12千米。\\\\请问同时出发后几小时甲车追及乙车？\\end{array}}\\]",correctOption: "5",incorrectOptions:["6 ","8","2"]},
{equation: "\\[{\\begin{array}{c}AB两相距96千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为22千米每小时，\\\\乙车速度为26千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["8 ","3","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距117千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为14千米每小时，\\\\乙车速度为25千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["2 ","6","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距175千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为13千米每小时，\\\\乙车速度为22千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "5",incorrectOptions:["4 ","2","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距205千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为20千米每小时，\\\\乙车速度为21千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "5",incorrectOptions:["4 ","3","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距308千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为28千米每小时，\\\\乙车速度为16千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["5 ","8","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距69千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为10千米每小时，\\\\乙车速度为13千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["8 ","5","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距148千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为20千米每小时，\\\\乙车速度为17千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "4",incorrectOptions:["1 ","9","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距74千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为24千米每小时，\\\\乙车速度为13千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["1 ","6","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距240千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为18千米每小时，\\\\乙车速度为22千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "6",incorrectOptions:["4 ","9","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距75千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为12千米每小时，\\\\乙车速度为13千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["7 ","5","8"]},

{equation: "\\[{\\begin{array}{c}AB两相距203千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为17千米每小时，\\\\乙车速度为12千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["1 ","2","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距360千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为29千米每小时，\\\\乙车速度为16千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "8",incorrectOptions:["1 ","3","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距140千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为19千米每小时，\\\\乙车速度为16千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "4",incorrectOptions:["2 ","3","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距58千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为11千米每小时，\\\\乙车速度为18千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["3 ","7","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距328千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为23千米每小时，\\\\乙车速度为18千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "8",incorrectOptions:["6 ","7","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距64千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为14千米每小时，\\\\乙车速度为18千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["7 ","1","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距99千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为21千米每小时，\\\\乙车速度为12千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["1 ","9","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距108千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为13千米每小时，\\\\乙车速度为23千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["5 ","9","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距161千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为11千米每小时，\\\\乙车速度为12千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["5 ","9","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距225千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为24千米每小时，\\\\乙车速度为21千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "5",incorrectOptions:["7 ","4","1"]},

{equation: "\\[{\\begin{array}{c}AB两相距308千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为21千米每小时，\\\\乙车速度为23千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["9 ","3","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距96千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为21千米每小时，\\\\乙车速度为11千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["8 ","9","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距252千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为11千米每小时，\\\\乙车速度为25千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["3 ","9","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距144千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为25千米每小时，\\\\乙车速度为23千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["6 ","9","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距63千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为11千米每小时，\\\\乙车速度为10千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["8 ","7","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距56千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为10千米每小时，\\\\乙车速度为18千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["9 ","5","8"]},

{equation: "\\[{\\begin{array}{c}AB两相距235千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为27千米每小时，\\\\乙车速度为20千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "5",incorrectOptions:["8 ","4","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距78千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为26千米每小时，\\\\乙车速度为13千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["7 ","9","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距126千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为15千米每小时，\\\\乙车速度为27千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["2 ","7","8"]},

{equation: "\\[{\\begin{array}{c}AB两相距205千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为14千米每小时，\\\\乙车速度为27千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "5",incorrectOptions:["1 ","9","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距129千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为15千米每小时，\\\\乙车速度为28千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["2 ","5","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距264千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为10千米每小时，\\\\乙车速度为23千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "8",incorrectOptions:["5 ","6","1"]},

{equation: "\\[{\\begin{array}{c}AB两相距116千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为18千米每小时，\\\\乙车速度为11千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "4",incorrectOptions:["1 ","8","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距144千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为26千米每小时，\\\\乙车速度为22千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["7 ","1","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距203千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为14千米每小时，\\\\乙车速度为15千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["6 ","4","9"]},

{equation: "\\[{\\begin{array}{c}AB两相距111千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为19千米每小时，\\\\乙车速度为18千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["4 ","8","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距66千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为20千米每小时，\\\\乙车速度为13千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["1 ","7","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距396千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为28千米每小时，\\\\乙车速度为16千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "9",incorrectOptions:["2 ","1","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距315千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为12千米每小时，\\\\乙车速度为23千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "9",incorrectOptions:["4 ","6","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距110千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为10千米每小时，\\\\乙车速度为12千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "5",incorrectOptions:["2 ","4","6"]},

{equation: "\\[{\\begin{array}{c}AB两相距185千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为25千米每小时，\\\\乙车速度为12千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "5",incorrectOptions:["8 ","7","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距360千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为29千米每小时，\\\\乙车速度为16千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "8",incorrectOptions:["4 ","2","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距203千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为15千米每小时，\\\\乙车速度为14千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["1 ","3","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距80千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为13千米每小时，\\\\乙车速度为27千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["8 ","3","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距156千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为24千米每小时，\\\\乙车速度为28千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "3",incorrectOptions:["8 ","1","7"]},

{equation: "\\[{\\begin{array}{c}AB两相距76千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为26千米每小时，\\\\乙车速度为12千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "2",incorrectOptions:["1 ","8","5"]},

{equation: "\\[{\\begin{array}{c}AB两相距246千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为20千米每小时，\\\\乙车速度为21千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "6",incorrectOptions:["9 ","7","4"]},

{equation: "\\[{\\begin{array}{c}AB两相距180千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为20千米每小时，\\\\乙车速度为25千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "4",incorrectOptions:["7 ","8","3"]},

{equation: "\\[{\\begin{array}{c}AB两相距96千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为14千米每小时，\\\\乙车速度为10千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "4",incorrectOptions:["1 ","9","2"]},

{equation: "\\[{\\begin{array}{c}AB两相距329千米。\\\\甲车从A地出发，乙车从B地出发。相向而行。\\\\甲车速度为19千米每小时，\\\\乙车速度为28千米每小时。\\\\请问同时出发后几小时相遇？\\end{array}}\\]",correctOption: "7",incorrectOptions:["5 ","1","4"]},


]


const   方程应用空瓶与水杯  =[

{equation: "\\[{\\begin{gather} 现在有一空瓶加入7杯水后重66千克;\\\\如果空瓶加入10杯水后重87千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=17千克 \\\\ 一杯水重=7千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=19千克 \\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=31 千克\\\\ 一杯水重=2千克\\end{cases}","\\begin{cases} 空瓶=13千克 \\\\ 一杯水重=8千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重47千克;\\\\如果空瓶加入10杯水后重68千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=39 千克\\\\ 一杯水重=2千克\\end{cases}","\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=1千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重40千克;\\\\如果空瓶加入8杯水后重50千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=34千克 \\\\ 一杯水重=2千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=33千克 \\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=33 千克\\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=3千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入2杯水后重29千克;\\\\如果空瓶加入9杯水后重50千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=23千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=15千克 \\\\ 一杯水重=2千克\\end{cases}","\\begin{cases} 空瓶=13 千克\\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=13千克 \\\\ 一杯水重=4千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入4杯水后重42千克;\\\\如果空瓶加入7杯水后重66千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=10千克 \\\\ 一杯水重=8千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=29千克 \\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=34 千克\\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=27千克 \\\\ 一杯水重=3千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入7杯水后重70千克;\\\\如果空瓶加入10杯水后重88千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=6千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=29千克 \\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=39 千克\\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=12千克 \\\\ 一杯水重=3千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重34千克;\\\\如果空瓶加入9杯水后重66千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=4千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=29千克 \\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=22 千克\\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=18千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重20千克;\\\\如果空瓶加入8杯水后重26千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=10千克 \\\\ 一杯水重=2千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=21千克 \\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=38 千克\\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=11千克 \\\\ 一杯水重=5千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入4杯水后重65千克;\\\\如果空瓶加入5杯水后重75千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=25千克 \\\\ 一杯水重=10千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=10千克 \\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=20 千克\\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=29千克 \\\\ 一杯水重=4千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重34千克;\\\\如果空瓶加入7杯水后重42千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=2千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=20千克 \\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=31 千克\\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=35千克 \\\\ 一杯水重=7千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重46千克;\\\\如果空瓶加入8杯水后重96千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=10千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=28 千克\\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=5千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重24千克;\\\\如果空瓶加入9杯水后重64千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=19千克 \\\\ 一杯水重=5千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=36千克 \\\\ 一杯水重=2千克\\end{cases}","\\begin{cases} 空瓶=26 千克\\\\ 一杯水重=2千克\\end{cases}","\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=7千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入9杯水后重60千克;\\\\如果空瓶加入10杯水后重63千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=33千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=21 千克\\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=8千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重48千克;\\\\如果空瓶加入2杯水后重58千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=10千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=15千克 \\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=33 千克\\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=1千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重46千克;\\\\如果空瓶加入6杯水后重49千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=31千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=14 千克\\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=27千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重59千克;\\\\如果空瓶加入4杯水后重68千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=32千克 \\\\ 一杯水重=9千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=35千克 \\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=15 千克\\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=27千克 \\\\ 一杯水重=10千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重40千克;\\\\如果空瓶加入7杯水后重56千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=4千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=33千克 \\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=16 千克\\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=26千克 \\\\ 一杯水重=8千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重20千克;\\\\如果空瓶加入4杯水后重29千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=17千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=13千克 \\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=22 千克\\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=24千克 \\\\ 一杯水重=8千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入9杯水后重54千克;\\\\如果空瓶加入10杯水后重58千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=18千克 \\\\ 一杯水重=4千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=30 千克\\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=26千克 \\\\ 一杯水重=5千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重36千克;\\\\如果空瓶加入10杯水后重90千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=6千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=37千克 \\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=33 千克\\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=27千克 \\\\ 一杯水重=5千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入6杯水后重78千克;\\\\如果空瓶加入7杯水后重86千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=8千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=23千克 \\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=33 千克\\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=31千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入4杯水后重48千克;\\\\如果空瓶加入7杯水后重63千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=5千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=33千克 \\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=18 千克\\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=21千克 \\\\ 一杯水重=3千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入7杯水后重19千克;\\\\如果空瓶加入10杯水后重22千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=12千克 \\\\ 一杯水重=1千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=20千克 \\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=34 千克\\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=18千克 \\\\ 一杯水重=5千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重79千克;\\\\如果空瓶加入6杯水后重88千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=34千克 \\\\ 一杯水重=9千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=26千克 \\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=36 千克\\\\ 一杯水重=2千克\\end{cases}","\\begin{cases} 空瓶=13千克 \\\\ 一杯水重=4千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入7杯水后重31千克;\\\\如果空瓶加入10杯水后重37千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=17千克 \\\\ 一杯水重=2千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=31 千克\\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=15千克 \\\\ 一杯水重=4千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重32千克;\\\\如果空瓶加入7杯水后重52千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=17千克 \\\\ 一杯水重=5千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=12千克 \\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=16 千克\\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=1千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重52千克;\\\\如果空瓶加入7杯水后重60千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=32千克 \\\\ 一杯水重=4千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=17 千克\\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=31千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入7杯水后重70千克;\\\\如果空瓶加入8杯水后重78千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=8千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=21 千克\\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=2千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重79千克;\\\\如果空瓶加入9杯水后重111千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=8千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=37千克 \\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=22 千克\\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=13千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入8杯水后重37千克;\\\\如果空瓶加入9杯水后重39千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=21千克 \\\\ 一杯水重=2千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=25千克 \\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=15 千克\\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=23千克 \\\\ 一杯水重=10千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重41千克;\\\\如果空瓶加入7杯水后重73千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=17千克 \\\\ 一杯水重=8千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=31千克 \\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=27 千克\\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=10千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入2杯水后重45千克;\\\\如果空瓶加入9杯水后重115千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=25千克 \\\\ 一杯水重=10千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=36千克 \\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=29 千克\\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=36千克 \\\\ 一杯水重=4千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重29千克;\\\\如果空瓶加入4杯水后重34千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=5千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=22千克 \\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=38 千克\\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=1千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重47千克;\\\\如果空瓶加入5杯水后重79千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=8千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=2千克\\end{cases}","\\begin{cases} 空瓶=38 千克\\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=10千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重39千克;\\\\如果空瓶加入8杯水后重54千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=5千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=10 千克\\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=34千克 \\\\ 一杯水重=3千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重29千克;\\\\如果空瓶加入10杯水后重36千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=26千克 \\\\ 一杯水重=1千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=12千克 \\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=35 千克\\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=22千克 \\\\ 一杯水重=7千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入2杯水后重48千克;\\\\如果空瓶加入9杯水后重118千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=10千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=14 千克\\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=37千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重29千克;\\\\如果空瓶加入6杯水后重32千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=14千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=19千克 \\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=21 千克\\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=2千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重32千克;\\\\如果空瓶加入7杯水后重36千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=22千克 \\\\ 一杯水重=2千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=13千克 \\\\ 一杯水重=4千克\\end{cases}","\\begin{cases} 空瓶=32 千克\\\\ 一杯水重=3千克\\end{cases}","\\begin{cases} 空瓶=26千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重26千克;\\\\如果空瓶加入2杯水后重36千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=10千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=23千克 \\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=24 千克\\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=23千克 \\\\ 一杯水重=5千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重57千克;\\\\如果空瓶加入7杯水后重69千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=27千克 \\\\ 一杯水重=6千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=21千克 \\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=37 千克\\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=15千克 \\\\ 一杯水重=1千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入7杯水后重100千克;\\\\如果空瓶加入8杯水后重110千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=10千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=35千克 \\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=15 千克\\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=17千克 \\\\ 一杯水重=9千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重42千克;\\\\如果空瓶加入7杯水后重96千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=33千克 \\\\ 一杯水重=9千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=21千克 \\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=21 千克\\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=16千克 \\\\ 一杯水重=2千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重39千克;\\\\如果空瓶加入10杯水后重67千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=27千克 \\\\ 一杯水重=4千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=20 千克\\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=36千克 \\\\ 一杯水重=9千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入2杯水后重25千克;\\\\如果空瓶加入3杯水后重29千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=17千克 \\\\ 一杯水重=4千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=29千克 \\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=35 千克\\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=18千克 \\\\ 一杯水重=5千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入3杯水后重31千克;\\\\如果空瓶加入7杯水后重59千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=10千克 \\\\ 一杯水重=7千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=19 千克\\\\ 一杯水重=8千克\\end{cases}","\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=6千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入2杯水后重40千克;\\\\如果空瓶加入9杯水后重47千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=1千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=39千克 \\\\ 一杯水重=6千克\\end{cases}","\\begin{cases} 空瓶=31 千克\\\\ 一杯水重=9千克\\end{cases}","\\begin{cases} 空瓶=15千克 \\\\ 一杯水重=3千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重54千克;\\\\如果空瓶加入8杯水后重72千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=24千克 \\\\ 一杯水重=6千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=18千克 \\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=25 千克\\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=23千克 \\\\ 一杯水重=1千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入1杯水后重36千克;\\\\如果空瓶加入6杯水后重51千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=33千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=7千克\\end{cases}","\\begin{cases} 空瓶=15 千克\\\\ 一杯水重=5千克\\end{cases}","\\begin{cases} 空瓶=30千克 \\\\ 一杯水重=4千克\\end{cases}",]},

{equation: "\\[{\\begin{gather} 现在有一空瓶加入5杯水后重53千克;\\\\如果空瓶加入8杯水后重62千克;\\\\请问空瓶有多重,一杯水又有多重呢？\\\\你可以有多少种方法来分析呢?\\end{gather}}\\] ",correctOption:"\\begin{cases} 空瓶=38千克 \\\\ 一杯水重=3千克\\end{cases} ",incorrectOptions:["\\begin{cases} 空瓶=28千克 \\\\ 一杯水重=1千克\\end{cases}","\\begin{cases} 空瓶=21 千克\\\\ 一杯水重=10千克\\end{cases}","\\begin{cases} 空瓶=15千克 \\\\ 一杯水重=4千克\\end{cases}",]},

]




const  根式运算03根式完全平方公式  =[


{equation: "\\[{(\\sqrt{11}+\\sqrt{2})^2=?}\\]",correctOption: "13+2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{5}","13+4\\sqrt{3}","13+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{7}+\\sqrt{11})^2=?}\\]",correctOption: "18+2\\sqrt{77}",incorrectOptions:["18+2\\sqrt{30}","18+6\\sqrt{2}","18+2\\sqrt{6}"]},

{equation: "\\[{(\\sqrt{7}+\\sqrt{5})^2=?}\\]",correctOption: "12+2\\sqrt{35}",incorrectOptions:["12+2\\sqrt{5}","12+6\\sqrt{2}","12+2\\sqrt{42}"]},

{equation: "\\[{(\\sqrt{6}+\\sqrt{11})^2=?}\\]",correctOption: "17+2\\sqrt{66}",incorrectOptions:["17+2\\sqrt{6}","17+2\\sqrt{21}","17+6\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{5}+\\sqrt{11})^2=?}\\]",correctOption: "16+2\\sqrt{55}",incorrectOptions:["16+2\\sqrt{2}","16+2\\sqrt{42}","16+2\\sqrt{21}"]},

{equation: "\\[{(\\sqrt{6}+\\sqrt{7})^2=?}\\]",correctOption: "13+2\\sqrt{42}",incorrectOptions:["13+2\\sqrt{7}","13+2\\sqrt{30}","13+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{7}+\\sqrt{11})^2=?}\\]",correctOption: "18+2\\sqrt{77}",incorrectOptions:["18+2\\sqrt{10}","18+2\\sqrt{2}","18+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{7}+\\sqrt{5})^2=?}\\]",correctOption: "12+2\\sqrt{35}",incorrectOptions:["12+4\\sqrt{3}","12+2\\sqrt{21}","12+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{6}+\\sqrt{3})^2=?}\\]",correctOption: "9+6\\sqrt{2}",incorrectOptions:["9+2\\sqrt{2}","9+2\\sqrt{10}","9+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{3}+\\sqrt{10})^2=?}\\]",correctOption: "13+2\\sqrt{30}",incorrectOptions:["13+4\\sqrt{3}","13+2\\sqrt{21}","13+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{2}+\\sqrt{11})^2=?}\\]",correctOption: "13+2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{3}","13+2\\sqrt{21}","13+2\\sqrt{30}"]},

{equation: "\\[{(\\sqrt{6}+\\sqrt{7})^2=?}\\]",correctOption: "13+2\\sqrt{42}",incorrectOptions:["13+2\\sqrt{35}","13+2\\sqrt{15}","13+2\\sqrt{14}"]},

{equation: "\\[{(\\sqrt{7}+\\sqrt{11})^2=?}\\]",correctOption: "18+2\\sqrt{77}",incorrectOptions:["18+2\\sqrt{21}","18+2\\sqrt{7}","18+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{2}+\\sqrt{5})^2=?}\\]",correctOption: "7+2\\sqrt{10}",incorrectOptions:["7+2\\sqrt{6}","7+2\\sqrt{3}","7+2\\sqrt{14}"]},

{equation: "\\[{(\\sqrt{3}+\\sqrt{2})^2=?}\\]",correctOption: "5+2\\sqrt{6}",incorrectOptions:["5+2\\sqrt{10}","5+2\\sqrt{7}","5+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{3}+\\sqrt{10})^2=?}\\]",correctOption: "13+2\\sqrt{30}",incorrectOptions:["13+6\\sqrt{2}","13+4\\sqrt{3}","13+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{6}+\\sqrt{10})^2=?}\\]",correctOption: "16+4\\sqrt{15}",incorrectOptions:["16+2\\sqrt{6}","16+2\\sqrt{42}","16+2\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{6}+\\sqrt{7})^2=?}\\]",correctOption: "13+2\\sqrt{42}",incorrectOptions:["13+2\\sqrt{10}","13+2\\sqrt{21}","13+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{7}+\\sqrt{5})^2=?}\\]",correctOption: "12+2\\sqrt{35}",incorrectOptions:["12+6\\sqrt{2}","12+2\\sqrt{14}","12+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{10}+\\sqrt{2})^2=?}\\]",correctOption: "12+4\\sqrt{5}",incorrectOptions:["12+4\\sqrt{3}","12+2\\sqrt{5}","12+2\\sqrt{30}"]},

{equation: "\\[{(\\sqrt{2}+\\sqrt{10})^2=?}\\]",correctOption: "12+4\\sqrt{5}",incorrectOptions:["12+2\\sqrt{15}","12+2\\sqrt{3}","12+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{11}+\\sqrt{2})^2=?}\\]",correctOption: "13+2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{2}","13+2\\sqrt{6}","13+2\\sqrt{14}"]},

{equation: "\\[{(\\sqrt{11}+\\sqrt{6})^2=?}\\]",correctOption: "17+2\\sqrt{66}",incorrectOptions:["17+2\\sqrt{14}","17+2\\sqrt{2}","17+2\\sqrt{6}"]},

{equation: "\\[{(\\sqrt{10}+\\sqrt{2})^2=?}\\]",correctOption: "12+4\\sqrt{5}",incorrectOptions:["12+2\\sqrt{42}","12+2\\sqrt{7}","12+2\\sqrt{10}"]},

{equation: "\\[{(\\sqrt{10}+\\sqrt{6})^2=?}\\]",correctOption: "16+4\\sqrt{15}",incorrectOptions:["16+2\\sqrt{21}","16+2\\sqrt{42}","16+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{10}+\\sqrt{6})^2=?}\\]",correctOption: "16+4\\sqrt{15}",incorrectOptions:["16+2\\sqrt{5}","16+2\\sqrt{15}","16+2\\sqrt{30}"]},

{equation: "\\[{(\\sqrt{3}+\\sqrt{6})^2=?}\\]",correctOption: "9+6\\sqrt{2}",incorrectOptions:["9+4\\sqrt{3}","9+2\\sqrt{2}","9+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{3}+\\sqrt{5})^2=?}\\]",correctOption: "8+2\\sqrt{15}",incorrectOptions:["8+2\\sqrt{30}","8+2\\sqrt{7}","8+2\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{6}+\\sqrt{2})^2=?}\\]",correctOption: "8+4\\sqrt{3}",incorrectOptions:["8+2\\sqrt{10}","8+2\\sqrt{6}","8+2\\sqrt{14}"]},

{equation: "\\[{(\\sqrt{5}+\\sqrt{7})^2=?}\\]",correctOption: "12+2\\sqrt{35}",incorrectOptions:["12+2\\sqrt{3}","12+2\\sqrt{30}","12+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{7})^2=?}\\]",correctOption: "9-2\\sqrt{14}",incorrectOptions:["9+2\\sqrt{10}","9-2\\sqrt{21}","9+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{10})^2=?}\\]",correctOption: "17-2\\sqrt{70}",incorrectOptions:["17+2\\sqrt{10}","17-2\\sqrt{42}","17+2\\sqrt{6}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{3})^2=?}\\]",correctOption: "14-2\\sqrt{33}",incorrectOptions:["14+6\\sqrt{2}","14-2\\sqrt{6}","14+2\\sqrt{14}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{7})^2=?}\\]",correctOption: "13-2\\sqrt{42}",incorrectOptions:["13+2\\sqrt{10}","13-2\\sqrt{6}","13+2\\sqrt{30}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{7})^2=?}\\]",correctOption: "13-2\\sqrt{42}",incorrectOptions:["13+2\\sqrt{30}","13-2\\sqrt{2}","13+2\\sqrt{6}"]},

{equation: "\\[{(\\sqrt{10}-\\sqrt{11})^2=?}\\]",correctOption: "21-2\\sqrt{110}",incorrectOptions:["21+2\\sqrt{42}","21-2\\sqrt{30}","21+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{3})^2=?}\\]",correctOption: "5-2\\sqrt{6}",incorrectOptions:["5+6\\sqrt{2}","5-2\\sqrt{30}","5+2\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{10}-\\sqrt{11})^2=?}\\]",correctOption: "21-2\\sqrt{110}",incorrectOptions:["21+2\\sqrt{5}","21-2\\sqrt{6}","21+2\\sqrt{21}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{11})^2=?}\\]",correctOption: "13-2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{2}","13-2\\sqrt{42}","13+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{10})^2=?}\\]",correctOption: "17-2\\sqrt{70}",incorrectOptions:["17+2\\sqrt{5}","17-2\\sqrt{15}","17+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{10})^2=?}\\]",correctOption: "17-2\\sqrt{70}",incorrectOptions:["17+2\\sqrt{6}","17-2\\sqrt{42}","17+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{10}-\\sqrt{11})^2=?}\\]",correctOption: "21-2\\sqrt{110}",incorrectOptions:["21+2\\sqrt{21}","21-2\\sqrt{3}","21+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{3})^2=?}\\]",correctOption: "10-2\\sqrt{21}",incorrectOptions:["10+2\\sqrt{10}","10-4\\sqrt{3}","10+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{2})^2=?}\\]",correctOption: "8-4\\sqrt{3}",incorrectOptions:["8+2\\sqrt{30}","8-2\\sqrt{7}","8+2\\sqrt{10}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{11})^2=?}\\]",correctOption: "13-2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{42}","13-2\\sqrt{30}","13+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{3}-\\sqrt{6})^2=?}\\]",correctOption: "9-6\\sqrt{2}",incorrectOptions:["9+2\\sqrt{21}","9-2\\sqrt{10}","9+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{5})^2=?}\\]",correctOption: "16-2\\sqrt{55}",incorrectOptions:["16+2\\sqrt{35}","16-2\\sqrt{42}","16+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{5})^2=?}\\]",correctOption: "12-2\\sqrt{35}",incorrectOptions:["12+2\\sqrt{10}","12-2\\sqrt{6}","12+2\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{5}-\\sqrt{7})^2=?}\\]",correctOption: "12-2\\sqrt{35}",incorrectOptions:["12+2\\sqrt{15}","12-2\\sqrt{42}","12+2\\sqrt{30}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{7})^2=?}\\]",correctOption: "9-2\\sqrt{14}",incorrectOptions:["9+2\\sqrt{7}","9-2\\sqrt{2}","9+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{11})^2=?}\\]",correctOption: "17-2\\sqrt{66}",incorrectOptions:["17+2\\sqrt{14}","17-2\\sqrt{6}","17+2\\sqrt{42}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{7})^2=?}\\]",correctOption: "9-2\\sqrt{14}",incorrectOptions:["9+2\\sqrt{15}","9-2\\sqrt{21}","9+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{5})^2=?}\\]",correctOption: "11-2\\sqrt{30}",incorrectOptions:["11+2\\sqrt{5}","11-2\\sqrt{6}","11+2\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{5}-\\sqrt{3})^2=?}\\]",correctOption: "8-2\\sqrt{15}",incorrectOptions:["8+4\\sqrt{3}","8-2\\sqrt{30}","8+2\\sqrt{42}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{5})^2=?}\\]",correctOption: "11-2\\sqrt{30}",incorrectOptions:["11+2\\sqrt{6}","11-2\\sqrt{3}","11+6\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{5})^2=?}\\]",correctOption: "16-2\\sqrt{55}",incorrectOptions:["16+2\\sqrt{15}","16-2\\sqrt{10}","16+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{3})^2=?}\\]",correctOption: "10-2\\sqrt{21}",incorrectOptions:["10+2\\sqrt{30}","10-2\\sqrt{6}","10+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{7})^2=?}\\]",correctOption: "18-2\\sqrt{77}",incorrectOptions:["18+4\\sqrt{3}","18-2\\sqrt{2}","18+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{10}-\\sqrt{2})^2=?}\\]",correctOption: "12-4\\sqrt{5}",incorrectOptions:["12+2\\sqrt{7}","12-2\\sqrt{6}","12+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{6})^2=?}\\]",correctOption: "17-2\\sqrt{66}",incorrectOptions:["17+2\\sqrt{6}","17-2\\sqrt{14}","17+2\\sqrt{21}"]},
{equation: "\\[{(-\\sqrt{3}-\\sqrt{6})^2=?}\\]",correctOption: "9+6\\sqrt{2}",incorrectOptions:["9+2\\sqrt{30}","9-2\\sqrt{6}","9+4\\sqrt{3}"]},

{equation: "\\[{(-\\sqrt{2}-\\sqrt{6})^2=?}\\]",correctOption: "8+4\\sqrt{3}",incorrectOptions:["8+6\\sqrt{2}","8-2\\sqrt{14}","8+2\\sqrt{42}"]},

{equation: "\\[{(-\\sqrt{2}-\\sqrt{11})^2=?}\\]",correctOption: "13+2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{30}","13-2\\sqrt{42}","13+2\\sqrt{5}"]},

{equation: "\\[{(-\\sqrt{10}-\\sqrt{11})^2=?}\\]",correctOption: "21+2\\sqrt{110}",incorrectOptions:["21+6\\sqrt{2}","21-2\\sqrt{15}","21+2\\sqrt{5}"]},

{equation: "\\[{(-\\sqrt{11}-\\sqrt{2})^2=?}\\]",correctOption: "13+2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{5}","13-2\\sqrt{2}","13+2\\sqrt{10}"]},

{equation: "\\[{(-\\sqrt{10}-\\sqrt{2})^2=?}\\]",correctOption: "12+4\\sqrt{5}",incorrectOptions:["12+2\\sqrt{15}","12-2\\sqrt{30}","12+2\\sqrt{10}"]},

{equation: "\\[{(-\\sqrt{7}-\\sqrt{2})^2=?}\\]",correctOption: "9+2\\sqrt{14}",incorrectOptions:["9+2\\sqrt{15}","9-2\\sqrt{6}","9+6\\sqrt{2}"]},

{equation: "\\[{(-\\sqrt{7}-\\sqrt{5})^2=?}\\]",correctOption: "12+2\\sqrt{35}",incorrectOptions:["12+2\\sqrt{3}","12-4\\sqrt{3}","12+2\\sqrt{10}"]},

{equation: "\\[{(-\\sqrt{10}-\\sqrt{2})^2=?}\\]",correctOption: "12+4\\sqrt{5}",incorrectOptions:["12+2\\sqrt{42}","12-2\\sqrt{30}","12+2\\sqrt{10}"]},

{equation: "\\[{(-\\sqrt{5}-\\sqrt{7})^2=?}\\]",correctOption: "12+2\\sqrt{35}",incorrectOptions:["12+2\\sqrt{42}","12-4\\sqrt{3}","12+2\\sqrt{6}"]},

{equation: "\\[{(-\\sqrt{5}-\\sqrt{11})^2=?}\\]",correctOption: "16+2\\sqrt{55}",incorrectOptions:["16+2\\sqrt{6}","16-2\\sqrt{42}","16+2\\sqrt{7}"]},

{equation: "\\[{(-\\sqrt{2}-\\sqrt{10})^2=?}\\]",correctOption: "12+4\\sqrt{5}",incorrectOptions:["12+2\\sqrt{21}","12-2\\sqrt{6}","12+6\\sqrt{2}"]},

{equation: "\\[{(-\\sqrt{5}-\\sqrt{2})^2=?}\\]",correctOption: "7+2\\sqrt{10}",incorrectOptions:["7+2\\sqrt{30}","7-2\\sqrt{2}","7+2\\sqrt{21}"]},

{equation: "\\[{(-\\sqrt{5}-\\sqrt{3})^2=?}\\]",correctOption: "8+2\\sqrt{15}",incorrectOptions:["8+2\\sqrt{21}","8-2\\sqrt{10}","8+2\\sqrt{7}"]},

{equation: "\\[{(-\\sqrt{11}-\\sqrt{10})^2=?}\\]",correctOption: "21+2\\sqrt{110}",incorrectOptions:["21+2\\sqrt{6}","21-2\\sqrt{42}","21+4\\sqrt{3}"]},

{equation: "\\[{(-\\sqrt{2}-\\sqrt{11})^2=?}\\]",correctOption: "13+2\\sqrt{22}",incorrectOptions:["13+2\\sqrt{21}","13-2\\sqrt{30}","13+2\\sqrt{6}"]},

{equation: "\\[{(-\\sqrt{7}-\\sqrt{10})^2=?}\\]",correctOption: "17+2\\sqrt{70}",incorrectOptions:["17+2\\sqrt{7}","17-2\\sqrt{2}","17+6\\sqrt{2}"]},

{equation: "\\[{(-\\sqrt{2}-\\sqrt{7})^2=?}\\]",correctOption: "9+2\\sqrt{14}",incorrectOptions:["9+2\\sqrt{35}","9-2\\sqrt{6}","9+2\\sqrt{5}"]},

{equation: "\\[{(-\\sqrt{11}-\\sqrt{3})^2=?}\\]",correctOption: "14+2\\sqrt{33}",incorrectOptions:["14+6\\sqrt{2}","14-2\\sqrt{42}","14+2\\sqrt{7}"]},

{equation: "\\[{(-\\sqrt{11}-\\sqrt{3})^2=?}\\]",correctOption: "14+2\\sqrt{33}",incorrectOptions:["14+2\\sqrt{14}","14-2\\sqrt{5}","14+2\\sqrt{6}"]},

{equation: "\\[{(-\\sqrt{5}-\\sqrt{2})^2=?}\\]",correctOption: "7+2\\sqrt{10}",incorrectOptions:["7+2\\sqrt{3}","7-2\\sqrt{15}","7+4\\sqrt{3}"]},

{equation: "\\[{(-\\sqrt{3}-\\sqrt{2})^2=?}\\]",correctOption: "5+2\\sqrt{6}",incorrectOptions:["5+2\\sqrt{30}","5-2\\sqrt{5}","5+2\\sqrt{14}"]},

{equation: "\\[{(-\\sqrt{3}-\\sqrt{5})^2=?}\\]",correctOption: "8+2\\sqrt{15}",incorrectOptions:["8+2\\sqrt{7}","8-2\\sqrt{35}","8+2\\sqrt{10}"]},

{equation: "\\[{(-\\sqrt{11}-\\sqrt{10})^2=?}\\]",correctOption: "21+2\\sqrt{110}",incorrectOptions:["21+2\\sqrt{2}","21-4\\sqrt{3}","21+2\\sqrt{6}"]},

{equation: "\\[{(-\\sqrt{10}-\\sqrt{7})^2=?}\\]",correctOption: "17+2\\sqrt{70}",incorrectOptions:["17+2\\sqrt{14}","17-2\\sqrt{7}","17+2\\sqrt{10}"]},

{equation: "\\[{(-\\sqrt{3}-\\sqrt{2})^2=?}\\]",correctOption: "5+2\\sqrt{6}",incorrectOptions:["5+2\\sqrt{21}","5-2\\sqrt{7}","5+6\\sqrt{2}"]},

{equation: "\\[{(-\\sqrt{11}-\\sqrt{5})^2=?}\\]",correctOption: "16+2\\sqrt{55}",incorrectOptions:["16+2\\sqrt{30}","16-2\\sqrt{21}","16+2\\sqrt{6}"]},

{equation: "\\[{(-\\sqrt{6}-\\sqrt{5})^2=?}\\]",correctOption: "11+2\\sqrt{30}",incorrectOptions:["11+4\\sqrt{3}","11-2\\sqrt{21}","11+2\\sqrt{3}"]},

{equation: "\\[{(-\\sqrt{3}-\\sqrt{10})^2=?}\\]",correctOption: "13+2\\sqrt{30}",incorrectOptions:["13+2\\sqrt{6}","13-2\\sqrt{2}","13+2\\sqrt{5}"]},

{equation: "\\[{(-\\sqrt{5}-\\sqrt{7})^2=?}\\]",correctOption: "12+2\\sqrt{35}",incorrectOptions:["12+2\\sqrt{7}","12-2\\sqrt{15}","12+2\\sqrt{14}"]},
{equation: "\\[{(\\sqrt{6}-\\sqrt{2})^2=?}\\]",correctOption: "8-4\\sqrt{3}",incorrectOptions:["4-4\\sqrt{3}","8-6\\sqrt{2}","8+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{2})^2=?}\\]",correctOption: "9-2\\sqrt{14}",incorrectOptions:["5-2\\sqrt{14}","9-2\\sqrt{3}","9+2\\sqrt{42}"]},

{equation: "\\[{(\\sqrt{5}-\\sqrt{3})^2=?}\\]",correctOption: "8-2\\sqrt{15}",incorrectOptions:["2-2\\sqrt{15}","8-2\\sqrt{21}","8+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{10}-\\sqrt{3})^2=?}\\]",correctOption: "13-2\\sqrt{30}",incorrectOptions:["7-2\\sqrt{30}","13-2\\sqrt{2}","13+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{5})^2=?}\\]",correctOption: "11-2\\sqrt{30}",incorrectOptions:["1-2\\sqrt{30}","11-2\\sqrt{10}","11+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{3}-\\sqrt{6})^2=?}\\]",correctOption: "9-6\\sqrt{2}",incorrectOptions:["3-6\\sqrt{2}","9-2\\sqrt{42}","9+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{5}-\\sqrt{11})^2=?}\\]",correctOption: "16-2\\sqrt{55}",incorrectOptions:["6-2\\sqrt{55}","16-2\\sqrt{35}","16+2\\sqrt{42}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{6})^2=?}\\]",correctOption: "13-2\\sqrt{42}",incorrectOptions:["1-2\\sqrt{42}","13-2\\sqrt{6}","13+2\\sqrt{5}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{10})^2=?}\\]",correctOption: "17-2\\sqrt{70}",incorrectOptions:["3-2\\sqrt{70}","17-2\\sqrt{3}","17+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{3})^2=?}\\]",correctOption: "9-6\\sqrt{2}",incorrectOptions:["3-6\\sqrt{2}","9-2\\sqrt{6}","9+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{2})^2=?}\\]",correctOption: "13-2\\sqrt{22}",incorrectOptions:["9-2\\sqrt{22}","13-2\\sqrt{5}","13+2\\sqrt{6}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{3})^2=?}\\]",correctOption: "14-2\\sqrt{33}",incorrectOptions:["8-2\\sqrt{33}","14-2\\sqrt{6}","14+2\\sqrt{7}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{6})^2=?}\\]",correctOption: "8-4\\sqrt{3}",incorrectOptions:["4-4\\sqrt{3}","8-2\\sqrt{15}","8+2\\sqrt{21}"]},

{equation: "\\[{(\\sqrt{10}-\\sqrt{11})^2=?}\\]",correctOption: "21-2\\sqrt{110}",incorrectOptions:["1-2\\sqrt{110}","21-2\\sqrt{10}","21+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{2})^2=?}\\]",correctOption: "9-2\\sqrt{14}",incorrectOptions:["5-2\\sqrt{14}","9-2\\sqrt{15}","9+2\\sqrt{6}"]},

{equation: "\\[{(\\sqrt{10}-\\sqrt{11})^2=?}\\]",correctOption: "21-2\\sqrt{110}",incorrectOptions:["1-2\\sqrt{110}","21-2\\sqrt{35}","21+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{2})^2=?}\\]",correctOption: "13-2\\sqrt{22}",incorrectOptions:["9-2\\sqrt{22}","13-2\\sqrt{2}","13+2\\sqrt{14}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{5})^2=?}\\]",correctOption: "7-2\\sqrt{10}",incorrectOptions:["3-2\\sqrt{10}","7-6\\sqrt{2}","7+2\\sqrt{35}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{3})^2=?}\\]",correctOption: "5-2\\sqrt{6}",incorrectOptions:["1-2\\sqrt{6}","5-2\\sqrt{7}","5+2\\sqrt{30}"]},

{equation: "\\[{(\\sqrt{5}-\\sqrt{3})^2=?}\\]",correctOption: "8-2\\sqrt{15}",incorrectOptions:["2-2\\sqrt{15}","8-2\\sqrt{14}","8+6\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{6})^2=?}\\]",correctOption: "8-4\\sqrt{3}",incorrectOptions:["4-4\\sqrt{3}","8-2\\sqrt{3}","8+2\\sqrt{15}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{5})^2=?}\\]",correctOption: "16-2\\sqrt{55}",incorrectOptions:["6-2\\sqrt{55}","16-2\\sqrt{35}","16+2\\sqrt{10}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{7})^2=?}\\]",correctOption: "18-2\\sqrt{77}",incorrectOptions:["4-2\\sqrt{77}","18-2\\sqrt{10}","18+2\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{7}-\\sqrt{5})^2=?}\\]",correctOption: "12-2\\sqrt{35}",incorrectOptions:["2-2\\sqrt{35}","12-6\\sqrt{2}","12+2\\sqrt{10}"]},

{equation: "\\[{(\\sqrt{11}-\\sqrt{5})^2=?}\\]",correctOption: "16-2\\sqrt{55}",incorrectOptions:["6-2\\sqrt{55}","16-4\\sqrt{3}","16+2\\sqrt{10}"]},

{equation: "\\[{(\\sqrt{3}-\\sqrt{10})^2=?}\\]",correctOption: "13-2\\sqrt{30}",incorrectOptions:["7-2\\sqrt{30}","13-2\\sqrt{10}","13+2\\sqrt{21}"]},

{equation: "\\[{(\\sqrt{2}-\\sqrt{7})^2=?}\\]",correctOption: "9-2\\sqrt{14}",incorrectOptions:["5-2\\sqrt{14}","9-2\\sqrt{15}","9+6\\sqrt{2}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{10})^2=?}\\]",correctOption: "16-4\\sqrt{15}",incorrectOptions:["4-4\\sqrt{15}","16-2\\sqrt{6}","16+4\\sqrt{3}"]},

{equation: "\\[{(\\sqrt{6}-\\sqrt{11})^2=?}\\]",correctOption: "17-2\\sqrt{66}",incorrectOptions:["5-2\\sqrt{66}","17-2\\sqrt{10}","17+2\\sqrt{6}"]},

{equation: "\\[{(\\sqrt{5}-\\sqrt{10})^2=?}\\]",correctOption: "15-10\\sqrt{2}",incorrectOptions:["5-10\\sqrt{2}","15-6\\sqrt{2}","15+2\\sqrt{6}"]},




]




const 根式运算02根式乘法有理化 =[

{equation: "\\[{\\sqrt{70}\\cdot\\sqrt{70}=?}\\]",correctOption: "70",incorrectOptions:["7\\sqrt{14}","14\\sqrt{2}","10\\sqrt{35}"]},

{equation: "\\[{3\\sqrt{2}\\cdot\\sqrt{21}=?}\\]",correctOption: "3\\sqrt{42}",incorrectOptions:["9\\sqrt{2}","6\\sqrt{2}","7\\sqrt{6}"]},

{equation: "\\[{\\sqrt{6}\\cdot9=?}\\]",correctOption: "9\\sqrt{6}",incorrectOptions:["6\\sqrt{10}","27\\sqrt{2}","9\\sqrt{5}"]},

{equation: "\\[{3\\sqrt{2}\\cdot5=?}\\]",correctOption: "15\\sqrt{2}",incorrectOptions:["3\\sqrt{3}","20","10\\sqrt{3}"]},

{equation: "\\[{\\sqrt{70}\\cdot2\\sqrt{10}=?}\\]",correctOption: "20\\sqrt{7}",incorrectOptions:["14\\sqrt{5}","4\\sqrt{21}","20\\sqrt{2}"]},

{equation: "\\[{\\sqrt{30}\\cdot\\sqrt{3}=?}\\]",correctOption: "3\\sqrt{10}",incorrectOptions:["12\\sqrt{14}","3\\sqrt{3}","\\sqrt{35}"]},

{equation: "\\[{4\\sqrt{3}\\cdot4=?}\\]",correctOption: "16\\sqrt{3}",incorrectOptions:["6\\sqrt{5}","4\\sqrt{6}","8\\sqrt{5}"]},

{equation: "\\[{2\\sqrt{14}\\cdot3\\sqrt{3}=?}\\]",correctOption: "6\\sqrt{42}",incorrectOptions:["7\\sqrt{10}","6\\sqrt{14}","9\\sqrt{15}"]},

{equation: "\\[{6\\sqrt{2}\\cdot2\\sqrt{14}=?}\\]",correctOption: "24\\sqrt{7}",incorrectOptions:["18\\sqrt{6}","8\\sqrt{3}","14\\sqrt{3}"]},

{equation: "\\[{2\\sqrt{5}\\cdot3\\sqrt{2}=?}\\]",correctOption: "6\\sqrt{10}",incorrectOptions:["2","3\\sqrt{42}","6"]},

{equation: "\\[{5\\sqrt{2}\\cdot\\sqrt{10}=?}\\]",correctOption: "10\\sqrt{5}",incorrectOptions:["10\\sqrt{3}","2\\sqrt{7}","20"]},

{equation: "\\[{2\\sqrt{2}\\cdot3=?}\\]",correctOption: "6\\sqrt{2}",incorrectOptions:["16\\sqrt{5}","18\\sqrt{2}","\\sqrt{7}"]},

{equation: "\\[{\\sqrt{35}\\cdot2\\sqrt{10}=?}\\]",correctOption: "10\\sqrt{14}",incorrectOptions:["14\\sqrt{3}","10\\sqrt{3}","8\\sqrt{30}"]},

{equation: "\\[{5\\cdot2=?}\\]",correctOption: "10",incorrectOptions:["20","4\\sqrt{6}","\\sqrt{10}"]},

{equation: "\\[{3\\sqrt{6}\\cdot\\sqrt{42}=?}\\]",correctOption: "18\\sqrt{7}",incorrectOptions:["12","6\\sqrt{2}","7\\sqrt{30}"]},

{equation: "\\[{2\\sqrt{10}\\cdot2\\sqrt{10}=?}\\]",correctOption: "40",incorrectOptions:["8\\sqrt{6}","10\\sqrt{6}","8\\sqrt{5}"]},

{equation: "\\[{3\\sqrt{7}\\cdot3\\sqrt{10}=?}\\]",correctOption: "9\\sqrt{70}",incorrectOptions:["7\\sqrt{42}","18\\sqrt{5}","20\\sqrt{7}"]},

{equation: "\\[{\\sqrt{14}\\cdot2\\sqrt{6}=?}\\]",correctOption: "4\\sqrt{21}",incorrectOptions:["2\\sqrt{14}","3\\sqrt{2}","8\\sqrt{15}"]},

{equation: "\\[{3\\cdot3\\sqrt{5}=?}\\]",correctOption: "9\\sqrt{5}",incorrectOptions:["9\\sqrt{42}","10\\sqrt{2}","18"]},

{equation: "\\[{\\sqrt{5}\\cdot3=?}\\]",correctOption: "3\\sqrt{5}",incorrectOptions:["5\\sqrt{6}","18","2\\sqrt{3}"]},

{equation: "\\[{4\\sqrt{2}\\cdot\\sqrt{15}=?}\\]",correctOption: "4\\sqrt{30}",incorrectOptions:["8\\sqrt{42}","5\\sqrt{3}","3\\sqrt{6}"]},

{equation: "\\[{6\\cdot4\\sqrt{3}=?}\\]",correctOption: "24\\sqrt{3}",incorrectOptions:["9\\sqrt{42}","6\\sqrt{5}","8\\sqrt{7}"]},

{equation: "\\[{3\\sqrt{2}\\cdot2\\sqrt{3}=?}\\]",correctOption: "6\\sqrt{6}",incorrectOptions:["2\\sqrt{10}","18","2\\sqrt{6}"]},

{equation: "\\[{2\\sqrt{6}\\cdot3\\sqrt{2}=?}\\]",correctOption: "12\\sqrt{3}",incorrectOptions:["12\\sqrt{10}","9\\sqrt{7}","8\\sqrt{3}"]},

{equation: "\\[{2\\sqrt{7}\\cdot6=?}\\]",correctOption: "12\\sqrt{7}",incorrectOptions:["4\\sqrt{14}","9\\sqrt{2}","16"]},

{equation: "\\[{2\\sqrt{15}\\cdot\\sqrt{70}=?}\\]",correctOption: "10\\sqrt{42}",incorrectOptions:["6\\sqrt{14}","56","20\\sqrt{3}"]},

{equation: "\\[{\\sqrt{35}\\cdot6=?}\\]",correctOption: "6\\sqrt{35}",incorrectOptions:["5","18\\sqrt{3}","16"]},

{equation: "\\[{3\\sqrt{7}\\cdot2\\sqrt{5}=?}\\]",correctOption: "6\\sqrt{35}",incorrectOptions:["9\\sqrt{10}","40","4\\sqrt{7}"]},

{equation: "\\[{2\\sqrt{2}\\cdot3\\sqrt{2}=?}\\]",correctOption: "12",incorrectOptions:["4\\sqrt{42}","9\\sqrt{2}","6\\sqrt{10}"]},

{equation: "\\[{2\\sqrt{7}\\cdot3\\sqrt{7}=?}\\]",correctOption: "42",incorrectOptions:["14\\sqrt{6}","18","14"]},


]

const 线性代数03向量叉乘外积 =[
{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-10,-9),B(-8,2); \\\\ 计算:(-10,-9)\\otimes (-8,2)=?\\\\\\begin{array} {|cc|} -10&-9 \\\\-8& 2\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-10,-9); B(-8,2);C(-2,-8)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-92",incorrectOptions:["-31","54","18"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-5,3),B(-8,3); \\\\ 计算:(-5,3)\\otimes (-8,3)=?\\\\\\begin{array} {|cc|} -5&3 \\\\-8& 3\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-5,3); B(-8,3);C(-3,-8)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "9",incorrectOptions:["80","-25","73"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-2,-5),B(-9,8); \\\\ 计算:(-2,-5)\\otimes (-9,8)=?\\\\\\begin{array} {|cc|} -2&-5 \\\\-9& 8\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-2,-5); B(-9,8);C(-8,-9)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-61",incorrectOptions:["-36","67","89"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(7,2),B(6,6); \\\\ 计算:(7,2)\\otimes (6,6)=?\\\\\\begin{array} {|cc|} 7&2 \\\\6& 6\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(7,2); B(6,6);C(-6,6)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "30",incorrectOptions:["-6","-64","41"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,-5),B(3,-7); \\\\ 计算:(-1,-5)\\otimes (3,-7)=?\\\\\\begin{array} {|cc|} -1&-5 \\\\3& -7\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-1,-5); B(3,-7);C(7,3)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "22",incorrectOptions:["-70","6","67"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,4),B(-8,1); \\\\ 计算:(-1,4)\\otimes (-8,1)=?\\\\\\begin{array} {|cc|} -1&4 \\\\-8& 1\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-1,4); B(-8,1);C(-1,-8)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "31",incorrectOptions:["83","52","28"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-9,2),B(-10,-9); \\\\ 计算:(-9,2)\\otimes (-10,-9)=?\\\\\\begin{array} {|cc|} -9&2 \\\\-10& -9\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-9,2); B(-10,-9);C(9,-10)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "101",incorrectOptions:["-92","-9","-49"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(1,7),B(8,0); \\\\ 计算:(1,7)\\otimes (8,0)=?\\\\\\begin{array} {|cc|} 1&7 \\\\8& 0\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(1,7); B(8,0);C(0,8)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-56",incorrectOptions:["53","-98","51"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-3,-10),B(7,-5); \\\\ 计算:(-3,-10)\\otimes (7,-5)=?\\\\\\begin{array} {|cc|} -3&-10 \\\\7& -5\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-3,-10); B(7,-5);C(5,7)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "85",incorrectOptions:["-7","52","35"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-7,8),B(0,-7); \\\\ 计算:(-7,8)\\otimes (0,-7)=?\\\\\\begin{array} {|cc|} -7&8 \\\\0& -7\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-7,8); B(0,-7);C(7,0)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "49",incorrectOptions:["-1","53","-56"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,-10),B(-4,-5); \\\\ 计算:(-1,-10)\\otimes (-4,-5)=?\\\\\\begin{array} {|cc|} -1&-10 \\\\-4& -5\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-1,-10); B(-4,-5);C(5,-4)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-35",incorrectOptions:["39","41","47"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(6,3),B(8,-9); \\\\ 计算:(6,3)\\otimes (8,-9)=?\\\\\\begin{array} {|cc|} 6&3 \\\\8& -9\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(6,3); B(8,-9);C(9,8)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-78",incorrectOptions:["48","-82","64"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(0,3),B(-4,2); \\\\ 计算:(0,3)\\otimes (-4,2)=?\\\\\\begin{array} {|cc|} 0&3 \\\\-4& 2\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(0,3); B(-4,2);C(-2,-4)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "12",incorrectOptions:["-67","-41","-81"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-5,-5),B(4,-2); \\\\ 计算:(-5,-5)\\otimes (4,-2)=?\\\\\\begin{array} {|cc|} -5&-5 \\\\4& -2\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-5,-5); B(4,-2);C(2,4)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "30",incorrectOptions:["24","15","-44"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-9,-4),B(-1,-10); \\\\ 计算:(-9,-4)\\otimes (-1,-10)=?\\\\\\begin{array} {|cc|} -9&-4 \\\\-1& -10\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-9,-4); B(-1,-10);C(10,-1)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "86",incorrectOptions:["-37","31","-51"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-7,-5),B(1,1); \\\\ 计算:(-7,-5)\\otimes (1,1)=?\\\\\\begin{array} {|cc|} -7&-5 \\\\1& 1\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-7,-5); B(1,1);C(-1,1)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-2",incorrectOptions:["-62","-98","-54"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-5,1),B(7,-5); \\\\ 计算:(-5,1)\\otimes (7,-5)=?\\\\\\begin{array} {|cc|} -5&1 \\\\7& -5\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-5,1); B(7,-5);C(5,7)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "18",incorrectOptions:["30","16","97"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-5,6),B(5,-6); \\\\ 计算:(-5,6)\\otimes (5,-6)=?\\\\\\begin{array} {|cc|} -5&6 \\\\5& -6\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-5,6); B(5,-6);C(6,5)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "0",incorrectOptions:["32","17","19"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(8,-3),B(-10,-7); \\\\ 计算:(8,-3)\\otimes (-10,-7)=?\\\\\\begin{array} {|cc|} 8&-3 \\\\-10& -7\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(8,-3); B(-10,-7);C(7,-10)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-86",incorrectOptions:["-72","-24","51"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(7,-10),B(-1,-2); \\\\ 计算:(7,-10)\\otimes (-1,-2)=?\\\\\\begin{array} {|cc|} 7&-10 \\\\-1& -2\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(7,-10); B(-1,-2);C(2,-1)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-24",incorrectOptions:["80","8","-10"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(5,5),B(-6,1); \\\\ 计算:(5,5)\\otimes (-6,1)=?\\\\\\begin{array} {|cc|} 5&5 \\\\-6& 1\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(5,5); B(-6,1);C(-1,-6)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "35",incorrectOptions:["84","-14","-68"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(5,7),B(-1,4); \\\\ 计算:(5,7)\\otimes (-1,4)=?\\\\\\begin{array} {|cc|} 5&7 \\\\-1& 4\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(5,7); B(-1,4);C(-4,-1)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "27",incorrectOptions:["-15","17","89"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-10,2),B(5,-5); \\\\ 计算:(-10,2)\\otimes (5,-5)=?\\\\\\begin{array} {|cc|} -10&2 \\\\5& -5\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-10,2); B(5,-5);C(5,5)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "40",incorrectOptions:["83","-83","22"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-2,-7),B(-4,-8); \\\\ 计算:(-2,-7)\\otimes (-4,-8)=?\\\\\\begin{array} {|cc|} -2&-7 \\\\-4& -8\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-2,-7); B(-4,-8);C(8,-4)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-12",incorrectOptions:["-3","-97","49"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(3,1),B(-8,-9); \\\\ 计算:(3,1)\\otimes (-8,-9)=?\\\\\\begin{array} {|cc|} 3&1 \\\\-8& -9\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(3,1); B(-8,-9);C(9,-8)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-19",incorrectOptions:["-35","42","61"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-10,1),B(-6,5); \\\\ 计算:(-10,1)\\otimes (-6,5)=?\\\\\\begin{array} {|cc|} -10&1 \\\\-6& 5\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-10,1); B(-6,5);C(-5,-6)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-44",incorrectOptions:["-14","82","-33"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(6,-4),B(-4,5); \\\\ 计算:(6,-4)\\otimes (-4,5)=?\\\\\\begin{array} {|cc|} 6&-4 \\\\-4& 5\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(6,-4); B(-4,5);C(-5,-4)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "14",incorrectOptions:["27","-86","-83"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-5,-4),B(0,6); \\\\ 计算:(-5,-4)\\otimes (0,6)=?\\\\\\begin{array} {|cc|} -5&-4 \\\\0& 6\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-5,-4); B(0,6);C(-6,0)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-30",incorrectOptions:["-94","84","6"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-5,-9),B(-7,-10); \\\\ 计算:(-5,-9)\\otimes (-7,-10)=?\\\\\\begin{array} {|cc|} -5&-9 \\\\-7& -10\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(-5,-9); B(-7,-10);C(10,-7)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-13",incorrectOptions:["-86","26","-78"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(5,-6),B(-8,3); \\\\ 计算:(5,-6)\\otimes (-8,3)=?\\\\\\begin{array} {|cc|} 5&-6 \\\\-8& 3\\\\\\end{array}=? \\\\在坐标系中画出O(0,0);A(5,-6); B(-8,3);C(-3,-8)。 \\\\三角形面积S△OAB\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系?! \\end{gather}",correctOption: "-33",incorrectOptions:["-6","-71","-56"]},

]




const 线性代数02向量点乘内积 =[
{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(8,5),B(3,-10); \\\\ 计算:(8,5)\\cdot (3,-10)=? \\\\在坐标系中画出O(0,0);A(8,5); B(3,-10);C(10,3)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-26",incorrectOptions:["-16","0","85"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(5,-7),B(-3,-7); \\\\ 计算:(5,-7)\\cdot (-3,-7)=? \\\\在坐标系中画出O(0,0);A(5,-7); B(-3,-7);C(7,-3)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "34",incorrectOptions:["-57","75","-74"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(2,-9),B(-9,2); \\\\ 计算:(2,-9)\\cdot (-9,2)=? \\\\在坐标系中画出O(0,0);A(2,-9); B(-9,2);C(-2,-9)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-36",incorrectOptions:["10","22","-88"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(1,8),B(-2,-2); \\\\ 计算:(1,8)\\cdot (-2,-2)=? \\\\在坐标系中画出O(0,0);A(1,8); B(-2,-2);C(2,-2)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-18",incorrectOptions:["-16","-5","-52"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-9,5),B(-7,3); \\\\ 计算:(-9,5)\\cdot (-7,3)=? \\\\在坐标系中画出O(0,0);A(-9,5); B(-7,3);C(-3,-7)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "78",incorrectOptions:["-39","-82","2"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(7,8),B(-8,7); \\\\ 计算:(7,8)\\cdot (-8,7)=? \\\\在坐标系中画出O(0,0);A(7,8); B(-8,7);C(-7,-8)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "0",incorrectOptions:["-18","88","-92"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-10,-1),B(-8,-8); \\\\ 计算:(-10,-1)\\cdot (-8,-8)=? \\\\在坐标系中画出O(0,0);A(-10,-1); B(-8,-8);C(8,-8)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "88",incorrectOptions:["-25","90","2"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-9,-1),B(-10,-3); \\\\ 计算:(-9,-1)\\cdot (-10,-3)=? \\\\在坐标系中画出O(0,0);A(-9,-1); B(-10,-3);C(3,-10)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "93",incorrectOptions:["75","-86","-44"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(4,3),B(-4,5); \\\\ 计算:(4,3)\\cdot (-4,5)=? \\\\在坐标系中画出O(0,0);A(4,3); B(-4,5);C(-5,-4)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-1",incorrectOptions:["-5","9","-34"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(1,-3),B(0,-3); \\\\ 计算:(1,-3)\\cdot (0,-3)=? \\\\在坐标系中画出O(0,0);A(1,-3); B(0,-3);C(3,0)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "9",incorrectOptions:["77","88","-53"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-4,-1),B(8,6); \\\\ 计算:(-4,-1)\\cdot (8,6)=? \\\\在坐标系中画出O(0,0);A(-4,-1); B(8,6);C(-6,8)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-38",incorrectOptions:["-82","50","88"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,-2),B(2,-4); \\\\ 计算:(-1,-2)\\cdot (2,-4)=? \\\\在坐标系中画出O(0,0);A(-1,-2); B(2,-4);C(4,2)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "6",incorrectOptions:["-43","93","84"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-10,3),B(-8,-6); \\\\ 计算:(-10,3)\\cdot (-8,-6)=? \\\\在坐标系中画出O(0,0);A(-10,3); B(-8,-6);C(6,-8)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "62",incorrectOptions:["2","77","9"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,-5),B(2,6); \\\\ 计算:(-1,-5)\\cdot (2,6)=? \\\\在坐标系中画出O(0,0);A(-1,-5); B(2,6);C(-6,2)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-32",incorrectOptions:["-26","-3","6"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(4,-1),B(-1,1); \\\\ 计算:(4,-1)\\cdot (-1,1)=? \\\\在坐标系中画出O(0,0);A(4,-1); B(-1,1);C(-1,-1)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-5",incorrectOptions:["92","-40","-64"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,-10),B(-9,-4); \\\\ 计算:(-1,-10)\\cdot (-9,-4)=? \\\\在坐标系中画出O(0,0);A(-1,-10); B(-9,-4);C(4,-9)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "49",incorrectOptions:["-88","-100","-17"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-10,-2),B(-8,4); \\\\ 计算:(-10,-2)\\cdot (-8,4)=? \\\\在坐标系中画出O(0,0);A(-10,-2); B(-8,4);C(-4,-8)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "72",incorrectOptions:["50","-69","89"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,3),B(-10,4); \\\\ 计算:(-1,3)\\cdot (-10,4)=? \\\\在坐标系中画出O(0,0);A(-1,3); B(-10,4);C(-4,-10)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "22",incorrectOptions:["38","-50","-25"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-8,3),B(-3,-6); \\\\ 计算:(-8,3)\\cdot (-3,-6)=? \\\\在坐标系中画出O(0,0);A(-8,3); B(-3,-6);C(6,-3)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "6",incorrectOptions:["48","-28","82"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-8,-3),B(-9,-10); \\\\ 计算:(-8,-3)\\cdot (-9,-10)=? \\\\在坐标系中画出O(0,0);A(-8,-3); B(-9,-10);C(10,-9)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "102",incorrectOptions:["-24","98","-51"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(6,-10),B(8,-9); \\\\ 计算:(6,-10)\\cdot (8,-9)=? \\\\在坐标系中画出O(0,0);A(6,-10); B(8,-9);C(9,8)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "138",incorrectOptions:["83","-94","58"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-3,5),B(6,-9); \\\\ 计算:(-3,5)\\cdot (6,-9)=? \\\\在坐标系中画出O(0,0);A(-3,5); B(6,-9);C(9,6)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-63",incorrectOptions:["59","71","-97"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-3,5),B(8,6); \\\\ 计算:(-3,5)\\cdot (8,6)=? \\\\在坐标系中画出O(0,0);A(-3,5); B(8,6);C(-6,8)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "6",incorrectOptions:["-14","22","-67"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-1,-7),B(4,-3); \\\\ 计算:(-1,-7)\\cdot (4,-3)=? \\\\在坐标系中画出O(0,0);A(-1,-7); B(4,-3);C(3,4)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "17",incorrectOptions:["3","28","56"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(2,-3),B(-10,4); \\\\ 计算:(2,-3)\\cdot (-10,4)=? \\\\在坐标系中画出O(0,0);A(2,-3); B(-10,4);C(-4,-10)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-32",incorrectOptions:["50","9","51"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(8,6),B(-9,6); \\\\ 计算:(8,6)\\cdot (-9,6)=? \\\\在坐标系中画出O(0,0);A(8,6); B(-9,6);C(-6,-9)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-36",incorrectOptions:["93","20","-95"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-5,5),B(-9,-10); \\\\ 计算:(-5,5)\\cdot (-9,-10)=? \\\\在坐标系中画出O(0,0);A(-5,5); B(-9,-10);C(10,-9)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-5",incorrectOptions:["-16","-66","23"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-9,-1),B(4,4); \\\\ 计算:(-9,-1)\\cdot (4,4)=? \\\\在坐标系中画出O(0,0);A(-9,-1); B(4,4);C(-4,4)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-40",incorrectOptions:["-94","-83","-89"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-6,-5),B(2,-10); \\\\ 计算:(-6,-5)\\cdot (2,-10)=? \\\\在坐标系中画出O(0,0);A(-6,-5); B(2,-10);C(10,2)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "38",incorrectOptions:["-93","-96","-5"]},

{equation: "\\begin{gather}向量是代数基础;\\\\ 已知点A(-10,-6),B(6,2); \\\\ 计算:(-10,-6)\\cdot (6,2)=? \\\\在坐标系中画出O(0,0);A(-10,-6); B(6,2);C(-2,6)。 \\\\三角形面积S△OAC\\times2=?。 \\\\OA、OB、OC以及它们之间的投影长有什么关系? \\end{gather}",correctOption: "-72",incorrectOptions:["-35","-78","-74"]},
]

 


const 函数01二次最值01 =[
{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x-5;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-21",incorrectOptions:["当x=-2时;f(x)最小值=-4","当x=-10时;f(x)最小值=-10","当x=-8时;f(x)最小值=-10"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+6x;\\\\ \\begin{array}{|c|c|c|} \\hline 3&3x& \\\\ \\hline x&x^2&3x\\\\ \\hline &x&3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-3时;f(x)最小值=-9",incorrectOptions:["当x=8时;f(x)最小值=-5","当x=-3时;f(x)最小值=4","当x=6时;f(x)最小值=-6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x+1;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-15",incorrectOptions:["当x=-3时;f(x)最小值=4","当x=-2时;f(x)最小值=-10","当x=1时;f(x)最小值=-2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x-2;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-11",incorrectOptions:["当x=-9时;f(x)最小值=-5","当x=-10时;f(x)最小值=-6","当x=6时;f(x)最小值=6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x-1;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-5",incorrectOptions:["当x=-10时;f(x)最小值=0","当x=1时;f(x)最小值=2","当x=-1时;f(x)最小值=8"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x-2;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-18",incorrectOptions:["当x=-7时;f(x)最小值=-2","当x=-5时;f(x)最小值=5","当x=3时;f(x)最小值=3"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x-1;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-17",incorrectOptions:["当x=-4时;f(x)最小值=0","当x=7时;f(x)最小值=7","当x=-2时;f(x)最小值=3"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x+1;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-3",incorrectOptions:["当x=7时;f(x)最小值=-4","当x=-8时;f(x)最小值=-3","当x=-6时;f(x)最小值=-7"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x+1;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-3",incorrectOptions:["当x=5时;f(x)最小值=-7","当x=-7时;f(x)最小值=-2","当x=-2时;f(x)最小值=7"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x+2;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-14",incorrectOptions:["当x=3时;f(x)最小值=-9","当x=2时;f(x)最小值=-5","当x=1时;f(x)最小值=-6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+2x-4;\\\\ \\begin{array}{|c|c|c|} \\hline 1&1x& \\\\ \\hline x&x^2&1x\\\\ \\hline &x&1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-1时;f(x)最小值=-5",incorrectOptions:["当x=7时;f(x)最小值=-9","当x=2时;f(x)最小值=-5","当x=-3时;f(x)最小值=-6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-16",incorrectOptions:["当x=2时;f(x)最小值=7","当x=-1时;f(x)最小值=-10","当x=-7时;f(x)最小值=3"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+6x+3;\\\\ \\begin{array}{|c|c|c|} \\hline 3&3x& \\\\ \\hline x&x^2&3x\\\\ \\hline &x&3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-3时;f(x)最小值=-6",incorrectOptions:["当x=-5时;f(x)最小值=2","当x=7时;f(x)最小值=3","当x=1时;f(x)最小值=-2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x+2;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-2",incorrectOptions:["当x=-7时;f(x)最小值=-4","当x=5时;f(x)最小值=4","当x=-3时;f(x)最小值=-9"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x-3;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-19",incorrectOptions:["当x=8时;f(x)最小值=6","当x=-5时;f(x)最小值=-1","当x=5时;f(x)最小值=0"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+6x+1;\\\\ \\begin{array}{|c|c|c|} \\hline 3&3x& \\\\ \\hline x&x^2&3x\\\\ \\hline &x&3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-3时;f(x)最小值=-8",incorrectOptions:["当x=-6时;f(x)最小值=0","当x=6时;f(x)最小值=-6","当x=8时;f(x)最小值=0"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x-4;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-8",incorrectOptions:["当x=-5时;f(x)最小值=0","当x=2时;f(x)最小值=-2","当x=-6时;f(x)最小值=-7"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+6x-4;\\\\ \\begin{array}{|c|c|c|} \\hline 3&3x& \\\\ \\hline x&x^2&3x\\\\ \\hline &x&3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-3时;f(x)最小值=-13",incorrectOptions:["当x=-7时;f(x)最小值=2","当x=-5时;f(x)最小值=-2","当x=-4时;f(x)最小值=-4"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x+1;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-3",incorrectOptions:["当x=7时;f(x)最小值=-2","当x=-1时;f(x)最小值=3","当x=-6时;f(x)最小值=-6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x+1;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-8",incorrectOptions:["当x=-8时;f(x)最小值=0","当x=0时;f(x)最小值=-9","当x=1时;f(x)最小值=-3"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x-2;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-6",incorrectOptions:["当x=-8时;f(x)最小值=-10","当x=-1时;f(x)最小值=-4","当x=-10时;f(x)最小值=-5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x-5;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-21",incorrectOptions:["当x=-8时;f(x)最小值=-9","当x=5时;f(x)最小值=3","当x=4时;f(x)最小值=-10"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x+1;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-8",incorrectOptions:["当x=2时;f(x)最小值=-5","当x=3时;f(x)最小值=3","当x=0时;f(x)最小值=-4"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-2x+2;\\\\ \\begin{array}{|c|c|c|} \\hline -1&-1x& \\\\ \\hline x&x^2&-1x\\\\ \\hline &x&-1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=1时;f(x)最小值=1",incorrectOptions:["当x=-6时;f(x)最小值=-1","当x=3时;f(x)最小值=8","当x=5时;f(x)最小值=-9"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+2x-5;\\\\ \\begin{array}{|c|c|c|} \\hline 1&1x& \\\\ \\hline x&x^2&1x\\\\ \\hline &x&1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-1时;f(x)最小值=-6",incorrectOptions:["当x=-10时;f(x)最小值=-9","当x=5时;f(x)最小值=7","当x=0时;f(x)最小值=-4"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x+3;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-6",incorrectOptions:["当x=7时;f(x)最小值=-5","当x=8时;f(x)最小值=-9","当x=5时;f(x)最小值=-10"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x-3;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-7",incorrectOptions:["当x=5时;f(x)最小值=-8","当x=4时;f(x)最小值=-5","当x=3时;f(x)最小值=5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x-4;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-20",incorrectOptions:["当x=4时;f(x)最小值=-4","当x=-2时;f(x)最小值=6","当x=-10时;f(x)最小值=-9"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x-5;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-9",incorrectOptions:["当x=7时;f(x)最小值=6","当x=4时;f(x)最小值=-1","当x=-6时;f(x)最小值=-10"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x-5;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-14",incorrectOptions:["当x=-5时;f(x)最小值=7","当x=-9时;f(x)最小值=-10","当x=-7时;f(x)最小值=3"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x+3;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-13",incorrectOptions:["当x=3时;f(x)最小值=3","当x=8时;f(x)最小值=2","当x=-3时;f(x)最小值=-2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x-1;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-5",incorrectOptions:["当x=-10时;f(x)最小值=3","当x=7时;f(x)最小值=5","当x=8时;f(x)最小值=-8"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x-5;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-21",incorrectOptions:["当x=6时;f(x)最小值=-3","当x=1时;f(x)最小值=3","当x=-8时;f(x)最小值=-2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+2x+2;\\\\ \\begin{array}{|c|c|c|} \\hline 1&1x& \\\\ \\hline x&x^2&1x\\\\ \\hline &x&1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-1时;f(x)最小值=1",incorrectOptions:["当x=-5时;f(x)最小值=6","当x=-1时;f(x)最小值=-8","当x=-7时;f(x)最小值=6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-2x;\\\\ \\begin{array}{|c|c|c|} \\hline -1&-1x& \\\\ \\hline x&x^2&-1x\\\\ \\hline &x&-1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=1时;f(x)最小值=-1",incorrectOptions:["当x=-5时;f(x)最小值=-9","当x=3时;f(x)最小值=-2","当x=-4时;f(x)最小值=-10"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x+2;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-14",incorrectOptions:["当x=-3时;f(x)最小值=-4","当x=6时;f(x)最小值=-1","当x=7时;f(x)最小值=-2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+6x-1;\\\\ \\begin{array}{|c|c|c|} \\hline 3&3x& \\\\ \\hline x&x^2&3x\\\\ \\hline &x&3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-3时;f(x)最小值=-10",incorrectOptions:["当x=-1时;f(x)最小值=-8","当x=1时;f(x)最小值=-9","当x=2时;f(x)最小值=2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x-2;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-11",incorrectOptions:["当x=-8时;f(x)最小值=-6","当x=3时;f(x)最小值=6","当x=0时;f(x)最小值=-5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x+3;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-1",incorrectOptions:["当x=-5时;f(x)最小值=6","当x=-8时;f(x)最小值=-9","当x=-4时;f(x)最小值=-7"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x-4;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-20",incorrectOptions:["当x=-10时;f(x)最小值=5","当x=6时;f(x)最小值=4","当x=-8时;f(x)最小值=-2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-2x+1;\\\\ \\begin{array}{|c|c|c|} \\hline -1&-1x& \\\\ \\hline x&x^2&-1x\\\\ \\hline &x&-1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=1时;f(x)最小值=0",incorrectOptions:["当x=-7时;f(x)最小值=-1","当x=-8时;f(x)最小值=-7","当x=3时;f(x)最小值=-1"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+2x+2;\\\\ \\begin{array}{|c|c|c|} \\hline 1&1x& \\\\ \\hline x&x^2&1x\\\\ \\hline &x&1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-1时;f(x)最小值=1",incorrectOptions:["当x=8时;f(x)最小值=5","当x=-8时;f(x)最小值=-7","当x=2时;f(x)最小值=2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x-2;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-11",incorrectOptions:["当x=5时;f(x)最小值=4","当x=6时;f(x)最小值=2","当x=-6时;f(x)最小值=5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-8x-1;\\\\ \\begin{array}{|c|c|c|} \\hline -4&-4x& \\\\ \\hline x&x^2&-4x\\\\ \\hline &x&-4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=4时;f(x)最小值=-17",incorrectOptions:["当x=-9时;f(x)最小值=0","当x=2时;f(x)最小值=2","当x=-7时;f(x)最小值=-5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x-2;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-18",incorrectOptions:["当x=2时;f(x)最小值=3","当x=-1时;f(x)最小值=3","当x=-3时;f(x)最小值=6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x-1;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-5",incorrectOptions:["当x=-7时;f(x)最小值=7","当x=-9时;f(x)最小值=4","当x=8时;f(x)最小值=5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-2x-5;\\\\ \\begin{array}{|c|c|c|} \\hline -1&-1x& \\\\ \\hline x&x^2&-1x\\\\ \\hline &x&-1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=1时;f(x)最小值=-6",incorrectOptions:["当x=-6时;f(x)最小值=2","当x=4时;f(x)最小值=-6","当x=3时;f(x)最小值=7"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x-3;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-7",incorrectOptions:["当x=-5时;f(x)最小值=-4","当x=5时;f(x)最小值=-10","当x=8时;f(x)最小值=-5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x-1;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-10",incorrectOptions:["当x=7时;f(x)最小值=1","当x=-8时;f(x)最小值=-9","当x=-5时;f(x)最小值=1"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+6x-2;\\\\ \\begin{array}{|c|c|c|} \\hline 3&3x& \\\\ \\hline x&x^2&3x\\\\ \\hline &x&3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-3时;f(x)最小值=-11",incorrectOptions:["当x=-3时;f(x)最小值=-3","当x=-9时;f(x)最小值=-10","当x=-10时;f(x)最小值=-10"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-6x-5;\\\\ \\begin{array}{|c|c|c|} \\hline -3&-3x& \\\\ \\hline x&x^2&-3x\\\\ \\hline &x&-3\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=3时;f(x)最小值=-14",incorrectOptions:["当x=-4时;f(x)最小值=5","当x=1时;f(x)最小值=-3","当x=-7时;f(x)最小值=8"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-4",incorrectOptions:["当x=-8时;f(x)最小值=0","当x=8时;f(x)最小值=5","当x=-4时;f(x)最小值=-3"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x-5;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-9",incorrectOptions:["当x=6时;f(x)最小值=6","当x=-1时;f(x)最小值=-5","当x=4时;f(x)最小值=-5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-16",incorrectOptions:["当x=-7时;f(x)最小值=-7","当x=-4时;f(x)最小值=-2","当x=7时;f(x)最小值=5"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+2x;\\\\ \\begin{array}{|c|c|c|} \\hline 1&1x& \\\\ \\hline x&x^2&1x\\\\ \\hline &x&1\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-1时;f(x)最小值=-1",incorrectOptions:["当x=3时;f(x)最小值=7","当x=-2时;f(x)最小值=6","当x=-5时;f(x)最小值=-6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x-3;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-7",incorrectOptions:["当x=-2时;f(x)最小值=2","当x=3时;f(x)最小值=-5","当x=4时;f(x)最小值=-10"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-16",incorrectOptions:["当x=3时;f(x)最小值=-1","当x=1时;f(x)最小值=-8","当x=-4时;f(x)最小值=2"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+8x+1;\\\\ \\begin{array}{|c|c|c|} \\hline 4&4x& \\\\ \\hline x&x^2&4x\\\\ \\hline &x&4\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-4时;f(x)最小值=-15",incorrectOptions:["当x=0时;f(x)最小值=-3","当x=-8时;f(x)最小值=5","当x=-1时;f(x)最小值=-6"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2+4x;\\\\ \\begin{array}{|c|c|c|} \\hline 2&2x& \\\\ \\hline x&x^2&2x\\\\ \\hline &x&2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=-2时;f(x)最小值=-4",incorrectOptions:["当x=-2时;f(x)最小值=-7","当x=1时;f(x)最小值=1","当x=-10时;f(x)最小值=0"]},

{equation: "\\begin{gather}拿出纸笔;\\\\用配方法或画函数图象探究;\\\\ f(x)=x^2-4x+1;\\\\ \\begin{array}{|c|c|c|} \\hline -2&-2x& \\\\ \\hline x&x^2&-2x\\\\ \\hline &x&-2\\\\ \\hline \\end{array} \\\\当x=？f(x)有最小值=？\\end{gather}",correctOption: "当x=2时;f(x)最小值=-3",incorrectOptions:["当x=-10时;f(x)最小值=7","当x=6时;f(x)最小值=-3","当x=-8时;f(x)最小值=-4"]},



]





const     乘法公式02整式乘法2乘3项02 = [

{equation: "\\[ {(-2x-3)(-3x^2-3x+1)=?}\\]",correctOption: "6x^3+15x^2+7x-3",incorrectOptions:["6x^3+9x^2-2x-3","6x^3+3x^2-11x-3","6x^3+29x^2+28x-3"]},

{equation: "\\[ {(2x+1)(3x^2-3x-1)=?}\\]",correctOption: "6x^3-3x^2-5x-1",incorrectOptions:["6x^3-9x^2-8x-1","6x^3+11x^2+2x-1","6x^3-5x^2-6x-1"]},

{equation: "\\[ {(-5x-3)(2x^2-x+1)=?}\\]",correctOption: "-10x^3-x^2-2x-3",incorrectOptions:["-10x^3+44x^2+25x-3","-10x^3-6x^2-5x-3","-10x^3+9x^2+4x-3"]},

{equation: "\\[ {(2x-3)(-4x^2-2x-2)=?}\\]",correctOption: "-8x^3+8x^2+2x+6",incorrectOptions:["-8x^3+16x^2-10x+6","-8x^3+2x^2+11x+6","-8x^3+22x^2-19x+6"]},

{equation: "\\[ {(-3x-3)(-x^2-x-1)=?}\\]",correctOption: "3x^3+6x^2+6x+3",incorrectOptions:["3x^3-18x^2-18x+3","3x^3+33x^2+33x+3","3x^3+3"]},

{equation: "\\[ {(2x-1)(-3x^2-3x-1)=?}\\]",correctOption: "-6x^3-3x^2+x+1",incorrectOptions:["-6x^3-9x^2+4x+1","-6x^3-11x^2+5x+1","-6x^3+9x^2-5x+1"]},

{equation: "\\[ {(2x-2)(-2x^2-3x-1)=?}\\]",correctOption: "-4x^3-2x^2+4x+2",incorrectOptions:["-4x^3+10x^2-8x+2","-4x^3+16x^2-14x+2","-4x^3-4x^2+6x+2"]},

{equation: "\\[ {(-5x-2)(-4x^2-2x-1)=?}\\]",correctOption: "20x^3+18x^2+9x+2",incorrectOptions:["20x^3-7x^2-x+2","20x^3+53x^2+23x+2","20x^3+28x^2+13x+2"]},

{equation: "\\[ {(-2x-2)(-5x^2-3x-2)=?}\\]",correctOption: "10x^3+16x^2+10x+4",incorrectOptions:["10x^3+28x^2+22x+4","10x^3+24x^2+18x+4","10x^3+4x^2-2x+4"]},

{equation: "\\[ {(-x-3)(-4x^2-2x-1)=?}\\]",correctOption: "4x^3+14x^2+7x+3",incorrectOptions:["4x^3+18x^2+19x+3","4x^3+10x^2-5x+3","4x^3+22x^2+31x+3"]},

{equation: "\\[ {(-5x-1)(x^2+x-2)=?}\\]",correctOption: "-5x^3-6x^2+9x+2",incorrectOptions:["-5x^3+44x^2+19x+2","-5x^3-21x^2+6x+2","-5x^3+49x^2+20x+2"]},

{equation: "\\[ {(3x-1)(x^2-2x+1)=?}\\]",correctOption: "3x^3-7x^2+5x-1",incorrectOptions:["3x^3-4x^2+4x-1","3x^3-28x^2+12x-1","3x^3+2x^2+2x-1"]},

{equation: "\\[ {(-x+1)(-4x^2-2x+1)=?}\\]",correctOption: "4x^3-2x^2-3x+1",incorrectOptions:["4x^3-4x^2-x+1","4x^3-9x^2+4x+1","4x^3-6x^2+x+1"]},

{equation: "\\[ {(-2x-2)(-x^2+x-2)=?}\\]",correctOption: "2x^3+2x+4",incorrectOptions:["2x^3+22x^2+24x+4","2x^3+16x^2+18x+4","2x^3+2x^2+4x+4"]},

{equation: "\\[ {(-2x+1)(-4x^2-x-1)=?}\\]",correctOption: "8x^3-2x^2+x-1",incorrectOptions:["8x^3-10x^2+5x-1","8x^3-18x^2+9x-1","8x^3-12x^2+6x-1"]},

{equation: "\\[ {(-3x-2)(-2x^2-2x-2)=?}\\]",correctOption: "6x^3+10x^2+10x+4",incorrectOptions:["6x^3-2x^2+2x+4","6x^3+25x^2+20x+4","6x^3+22x^2+18x+4"]},

{equation: "\\[ {(-2x-3)(-5x^2-x-2)=?}\\]",correctOption: "10x^3+17x^2+7x+6",incorrectOptions:["10x^3+5x^2-11x+6","10x^3+29x^2+25x+6","10x^3+33x^2+31x+6"]},

{equation: "\\[ {(-3x-3)(-2x^2-x-1)=?}\\]",correctOption: "6x^3+9x^2+6x+3",incorrectOptions:["6x^3+12x^2+9x+3","6x^3+33x^2+30x+3","6x^3+30x^2+27x+3"]},

{equation: "\\[ {(-x-1)(-x^2-3x-3)=?}\\]",correctOption: "x^3+4x^2+6x+3",incorrectOptions:["x^3+10x^2+12x+3","x^3-5x^2-3x+3","x^3+5x^2+7x+3"]},

{equation: "\\[ {(x-3)(3x^2-x-3)=?}\\]",correctOption: "3x^3-10x^2+9",incorrectOptions:["3x^3-2x^2-24x+9","3x^3-x^2-27x+9","3x^3-11x^2+3x+9"]},

{equation: "\\[ {(-5x+1)(3x^2-3x-3)=?}\\]",correctOption: "-15x^3+18x^2+12x-3",incorrectOptions:["-15x^3+28x^2+10x-3","-15x^3+38x^2+8x-3","-15x^3-12x^2+18x-3"]},

{equation: "\\[ {(3x+1)(-x^2+x-1)=?}\\]",correctOption: "-3x^3+2x^2-2x-1",incorrectOptions:["-3x^3+5x^2-x-1","-3x^3-7x^2-5x-1","-3x^3-31x^2-13x-1"]},

{equation: "\\[ {(x-1)(2x^2-2x+1)=?}\\]",correctOption: "2x^3-4x^2+3x-1",incorrectOptions:["2x^3-11x^2+10x-1","2x^3-7x^2+6x-1","2x^3+5x^2-6x-1"]},

{equation: "\\[ {(-x-2)(3x^2+x-1)=?}\\]",correctOption: "-3x^3-7x^2-x+2",incorrectOptions:["-3x^3-14x^2-15x+2","-3x^3-9x^2-5x+2","-3x^3-4x^2+5x+2"]},

{equation: "\\[ {(-5x+1)(-2x^2+x-1)=?}\\]",correctOption: "10x^3-7x^2+6x-1",incorrectOptions:["10x^3+43x^2-4x-1","10x^3-12x^2+7x-1","10x^3-27x^2+10x-1"]},

{equation: "\\[ {(3x-2)(-5x^2-2x-3)=?}\\]",correctOption: "-15x^3+4x^2-5x+6",incorrectOptions:["-15x^3+19x^2-15x+6","-15x^3+34x^2-25x+6","-15x^3+22x^2-17x+6"]},

{equation: "\\[ {(-4x-2)(2x^2+x-1)=?}\\]",correctOption: "-8x^3-8x^2+2x+2",incorrectOptions:["-8x^3-16x^2-2x+2","-8x^3-24x^2-6x+2","-8x^3-36x^2-12x+2"]},

{equation: "\\[ {(3x-1)(-x^2-3x-1)=?}\\]",correctOption: "-3x^3-8x^2+1",incorrectOptions:["-3x^3-23x^2+5x+1","-3x^3-20x^2+4x+1","-3x^3-17x^2+3x+1"]},

{equation: "\\[ {(3x-1)(-2x^2-3x+1)=?}\\]",correctOption: "-6x^3-7x^2+6x-1",incorrectOptions:["-6x^3+17x^2-2x-1","-6x^3-16x^2+9x-1","-6x^3-22x^2+11x-1"]},

{equation: "\\[ {(-3x-2)(2x^2-3x-3)=?}\\]",correctOption: "-6x^3+5x^2+15x+6",incorrectOptions:["-6x^3+26x^2+29x+6","-6x^3+8x^2+17x+6","-6x^3+17x^2+23x+6"]},

{equation: "\\[ {(-5x+1)(x^2-2x-3)=?}\\]",correctOption: "-5x^3+11x^2+13x-3",incorrectOptions:["-5x^3+46x^2+6x-3","-5x^3+21x^2+11x-3","-5x^3-14x^2+18x-3"]},

{equation: "\\[ {(-3x-2)(-4x^2-x+1)=?}\\]",correctOption: "12x^3+11x^2-x-2",incorrectOptions:["12x^3+32x^2+13x-2","12x^3+35x^2+15x-2","12x^3+2x^2-7x-2"]},

{equation: "\\[ {(2x+1)(-5x^2-2x-1)=?}\\]",correctOption: "-10x^3-9x^2-4x-1",incorrectOptions:["-10x^3+5x^2+3x-1","-10x^3-19x^2-9x-1","-10x^3+x^2+x-1"]},

{equation: "\\[ {(-3x+1)(3x^2-3x-1)=?}\\]",correctOption: "-9x^3+12x^2-1",incorrectOptions:["-9x^3+27x^2-5x-1","-9x^3-6x^2+6x-1","-9x^3-15x^2+9x-1"]},

{equation: "\\[ {(x+1)(-2x^2+x-1)=?}\\]",correctOption: "-2x^3-x^2-1",incorrectOptions:["-2x^3-2x^2-x-1","-2x^3+2x^2+3x-1","-2x^3-12x^2-11x-1"]},

{equation: "\\[ {(x+1)(-2x^2-2x-1)=?}\\]",correctOption: "-2x^3-4x^2-3x-1",incorrectOptions:["-2x^3-3x^2-2x-1","-2x^3-12x^2-11x-1","-2x^3+5x^2+6x-1"]},

{equation: "\\[ {(x+1)(-3x^2-x-1)=?}\\]",correctOption: "-3x^3-4x^2-2x-1",incorrectOptions:["-3x^3+x^2+3x-1","-3x^3-13x^2-11x-1","-3x^3+2x-1"]},

{equation: "\\[ {(-5x-1)(-3x^2-3x+1)=?}\\]",correctOption: "15x^3+18x^2-2x-1",incorrectOptions:["15x^3+33x^2+x-1","15x^3-27x^2-11x-1","15x^3-17x^2-9x-1"]},

{equation: "\\[ {(-x+1)(-5x^2-3x-1)=?}\\]",correctOption: "5x^3-2x^2-2x-1",incorrectOptions:["5x^3-9x^2+5x-1","5x^3-13x^2+9x-1","5x^3-6x^2+2x-1"]},

{equation: "\\[ {(2x-2)(2x^2+x-3)=?}\\]",correctOption: "4x^3-2x^2-8x+6",incorrectOptions:["4x^3-16x^2+6x+6","4x^3+6x^2-16x+6","4x^3-14x^2+4x+6"]},

{equation: "\\[ {(x-3)(-3x^2-x+1)=?}\\]",correctOption: "-3x^3+8x^2+4x-3",incorrectOptions:["-3x^3+x^2+25x-3","-3x^3+5x^2+13x-3","-3x^3+11x^2-5x-3"]},

{equation: "\\[ {(2x-2)(2x^2+x+1)=?}\\]",correctOption: "4x^3-2x^2-2",incorrectOptions:["4x^3-14x^2+12x-2","4x^3-10x^2+8x-2","4x^3-12x^2+10x-2"]},

{equation: "\\[ {(x-3)(x^2-3x-1)=?}\\]",correctOption: "x^3-6x^2+8x+3",incorrectOptions:["x^3-x^2-7x+3","x^3-7x^2+11x+3","x^3-10x^2+20x+3"]},

{equation: "\\[ {(-5x+1)(-4x^2-x-3)=?}\\]",correctOption: "20x^3+x^2+14x-3",incorrectOptions:["20x^3+46x^2+5x-3","20x^3-19x^2+18x-3","20x^3-14x^2+17x-3"]},

{equation: "\\[ {(3x+1)(-2x^2-2x-1)=?}\\]",correctOption: "-6x^3-8x^2-5x-1",incorrectOptions:["-6x^3-2x^2-3x-1","-6x^3+7x^2-1","-6x^3+19x^2+4x-1"]},

{equation: "\\[ {(-3x-1)(-5x^2+x-3)=?}\\]",correctOption: "15x^3+2x^2+8x+3",incorrectOptions:["15x^3+8x^2+10x+3","15x^3+14x^2+12x+3","15x^3-10x^2+4x+3"]},

{equation: "\\[ {(2x-3)(3x^2+x-1)=?}\\]",correctOption: "6x^3-7x^2-5x+3",incorrectOptions:["6x^3-3x^2-11x+3","6x^3+x^2-17x+3","6x^3-25x^2+22x+3"]},

{equation: "\\[ {(3x-2)(3x^2-2x+1)=?}\\]",correctOption: "9x^3-12x^2+7x-2",incorrectOptions:["9x^3-6x^2+3x-2","9x^3-x-2","9x^3-21x^2+13x-2"]},

{equation: "\\[ {(-2x-1)(x^2+x-2)=?}\\]",correctOption: "-2x^3-3x^2+3x+2",incorrectOptions:["-2x^3-11x^2-x+2","-2x^3+9x^2+9x+2","-2x^3+15x^2+12x+2"]},

{equation: "\\[ {(-2x-2)(2x^2+x-1)=?}\\]",correctOption: "-4x^3-6x^2+2",incorrectOptions:["-4x^3-18x^2-12x+2","-4x^3-12x^2-6x+2","-4x^3-14x^2-8x+2"]},

{equation: "\\[ {(-x-1)(-x^2+x-3)=?}\\]",correctOption: "x^3+2x+3",incorrectOptions:["x^3-5x^2-3x+3","x^3-x^2+x+3","x^3-4x^2-2x+3"]},

{equation: "\\[ {(-4x-1)(x^2-x-2)=?}\\]",correctOption: "-4x^3+3x^2+9x+2",incorrectOptions:["-4x^3+39x^2+18x+2","-4x^3+35x^2+17x+2","-4x^3+15x^2+12x+2"]},

{equation: "\\[ {(-3x-2)(-x^2-x-2)=?}\\]",correctOption: "3x^3+5x^2+8x+4",incorrectOptions:["3x^3+29x^2+24x+4","3x^3+32x^2+26x+4","3x^3-19x^2-8x+4"]},

{equation: "\\[ {(-3x+1)(-x^2+x-2)=?}\\]",correctOption: "3x^3-4x^2+7x-2",incorrectOptions:["3x^3-19x^2+12x-2","3x^3+5x^2+4x-2","3x^3+29x^2-4x-2"]},

{equation: "\\[ {(3x-3)(-2x^2+x+1)=?}\\]",correctOption: "-6x^3+9x^2-3",incorrectOptions:["-6x^3+12x^2-3x-3","-6x^3+15x^2-6x-3","-6x^3+21x^2-12x-3"]},

{equation: "\\[ {(3x+1)(-2x^2+x-2)=?}\\]",correctOption: "-6x^3+x^2-5x-2",incorrectOptions:["-6x^3-23x^2-13x-2","-6x^3-29x^2-15x-2","-6x^3+13x^2-x-2"]},

{equation: "\\[ {(x+1)(-4x^2-2x-2)=?}\\]",correctOption: "-4x^3-6x^2-4x-2",incorrectOptions:["-4x^3-3x^2-x-2","-4x^3-2x^2-2","-4x^3-8x^2-6x-2"]},

{equation: "\\[ {(-5x-2)(-x^2-3x-3)=?}\\]",correctOption: "5x^3+17x^2+21x+6",incorrectOptions:["5x^3-38x^2-x+6","5x^3-18x^2+7x+6","5x^3+52x^2+35x+6"]},

{equation: "\\[ {(-x-1)(3x^2-3x+1)=?}\\]",correctOption: "-3x^3+2x-1",incorrectOptions:["-3x^3+3x^2+5x-1","-3x^3-11x^2-9x-1","-3x^3+5x^2+7x-1"]},

{equation: "\\[ {(-2x-2)(-5x^2-3x-1)=?}\\]",correctOption: "10x^3+16x^2+8x+2",incorrectOptions:["10x^3-2x^2-10x+2","10x^3-6x^2-14x+2","10x^3+30x^2+22x+2"]},


]


const     乘法公式02整式乘法2乘3项01 = [
{equation: "\\[ {(x-3)(x^2-3x+1)=?}\\]",correctOption: "x^3-6x^2+10x-3",incorrectOptions:["x^3-13x^2+31x-3","x^3+2x^2-14x-3","x^3+5x^2-23x-3"]},

{equation: "\\[ {(x+1)(x^2+x-2)=?}\\]",correctOption: "x^3+2x^2-x-2",incorrectOptions:["x^3-4x^2-7x-2","x^3+3x^2-2","x^3-8x^2-11x-2"]},

{equation: "\\[ {(x+1)(x^2-3x-2)=?}\\]",correctOption: "x^3-2x^2-5x-2",incorrectOptions:["x^3+2x^2-x-2","x^3-3x^2-6x-2","x^3-7x^2-10x-2"]},

{equation: "\\[ {(x+1)(x^2+x-2)=?}\\]",correctOption: "x^3+2x^2-x-2",incorrectOptions:["x^3-3x^2-6x-2","x^3+4x^2+x-2","x^3+5x^2+2x-2"]},

{equation: "\\[ {(x-3)(x^2-2x+1)=?}\\]",correctOption: "x^3-5x^2+7x-3",incorrectOptions:["x^3-2x^2-2x-3","x^3-12x^2+28x-3","x^3-4x^2+4x-3"]},

{equation: "\\[ {(x+1)(x^2+x-3)=?}\\]",correctOption: "x^3+2x^2-2x-3",incorrectOptions:["x^3-4x-3","x^3-9x^2-13x-3","x^3+4x^2-3"]},

{equation: "\\[ {(x-3)(x^2-x-1)=?}\\]",correctOption: "x^3-4x^2+2x+3",incorrectOptions:["x^3-10x+3","x^3-12x^2+26x+3","x^3-8x^2+14x+3"]},

{equation: "\\[ {(x-2)(x^2+x+1)=?}\\]",correctOption: "x^3-x^2-x-2",incorrectOptions:["x^3-2x^2+x-2","x^3-6x^2+9x-2","x^3-9x^2+15x-2"]},

{equation: "\\[ {(x+1)(x^2+x-1)=?}\\]",correctOption: "x^3+2x^2-1",incorrectOptions:["x^3+3x^2+x-1","x^3-9x^2-11x-1","x^3+6x^2+4x-1"]},

{equation: "\\[ {(x-3)(x^2+x-1)=?}\\]",correctOption: "x^3-2x^2-4x+3",incorrectOptions:["x^3+5x^2-25x+3","x^3-3x^2-x+3","x^3-12x^2+26x+3"]},

{equation: "\\[ {(x-3)(x^2-3x-2)=?}\\]",correctOption: "x^3-6x^2+7x+6",incorrectOptions:["x^3-4x^2+x+6","x^3-2x^2-5x+6","x^3-11x^2+22x+6"]},

{equation: "\\[ {(x-1)(x^2-3x-2)=?}\\]",correctOption: "x^3-4x^2+x+2",incorrectOptions:["x^3-6x^2+3x+2","x^3+3x^2-6x+2","x^3-8x^2+5x+2"]},

{equation: "\\[ {(x-3)(x^2-x+1)=?}\\]",correctOption: "x^3-4x^2+4x-3",incorrectOptions:["x^3-9x^2+19x-3","x^3-12x^2+28x-3","x^3-x^2-5x-3"]},

{equation: "\\[ {(x-2)(x^2-3x-3)=?}\\]",correctOption: "x^3-5x^2+3x+6",incorrectOptions:["x^3-8x^2+9x+6","x^3+4x^2-15x+6","x^3+5x^2-17x+6"]},

{equation: "\\[ {(x-1)(x^2+x-2)=?}\\]",correctOption: "x^3-3x+2",incorrectOptions:["x^3+4x^2-7x+2","x^3-7x^2+4x+2","x^3-x^2-2x+2"]},

{equation: "\\[ {(x-1)(x^2+x+1)=?}\\]",correctOption: "x^3-1",incorrectOptions:["x^3-9x^2+9x-1","x^3+2x^2-2x-1","x^3-5x^2+5x-1"]},

{equation: "\\[ {(x-1)(x^2-x-1)=?}\\]",correctOption: "x^3-2x^2+1",incorrectOptions:["x^3-x^2-x+1","x^3-6x^2+4x+1","x^3-11x^2+9x+1"]},

{equation: "\\[ {(x-1)(x^2+x-2)=?}\\]",correctOption: "x^3-3x+2",incorrectOptions:["x^3-7x^2+4x+2","x^3-x^2-2x+2","x^3-11x^2+8x+2"]},

{equation: "\\[ {(x+1)(x^2-2x-2)=?}\\]",correctOption: "x^3-x^2-4x-2",incorrectOptions:["x^3-8x^2-11x-2","x^3-9x^2-12x-2","x^3+x^2-2x-2"]},

{equation: "\\[ {(x-2)(x^2-2x-1)=?}\\]",correctOption: "x^3-4x^2+3x+2",incorrectOptions:["x^3-11x^2+17x+2","x^3-7x^2+9x+2","x^3+5x^2-15x+2"]},

{equation: "\\[ {(x-1)(x^2-x-3)=?}\\]",correctOption: "x^3-2x^2-2x+3",incorrectOptions:["x^3-x^2-3x+3","x^3-7x^2+3x+3","x^3-4x+3"]},

{equation: "\\[ {(x+1)(x^2-3x+1)=?}\\]",correctOption: "x^3-2x^2-2x+1",incorrectOptions:["x^3+7x^2+7x+1","x^3-6x^2-6x+1","x^3+8x^2+8x+1"]},

{equation: "\\[ {(x+1)(x^2-3x-2)=?}\\]",correctOption: "x^3-2x^2-5x-2",incorrectOptions:["x^3-9x^2-12x-2","x^3+8x^2+5x-2","x^3+6x^2+3x-2"]},

{equation: "\\[ {(x-3)(x^2-3x-1)=?}\\]",correctOption: "x^3-6x^2+8x+3",incorrectOptions:["x^3-10x+3","x^3-13x^2+29x+3","x^3+4x^2-22x+3"]},

{equation: "\\[ {(x-2)(x^2-3x+1)=?}\\]",correctOption: "x^3-5x^2+7x-2",incorrectOptions:["x^3-4x^2+5x-2","x^3+3x^2-9x-2","x^3-x^2-x-2"]},

{equation: "\\[ {(x-1)(x^2-3x-3)=?}\\]",correctOption: "x^3-4x^2+3",incorrectOptions:["x^3-10x^2+6x+3","x^3-2x^2-2x+3","x^3+6x^2-10x+3"]},

{equation: "\\[ {(x-1)(x^2-2x-2)=?}\\]",correctOption: "x^3-3x^2+2",incorrectOptions:["x^3-4x^2+x+2","x^3+5x^2-8x+2","x^3-11x^2+8x+2"]},

{equation: "\\[ {(x-2)(x^2+x-1)=?}\\]",correctOption: "x^3-x^2-3x+2",incorrectOptions:["x^3-5x^2+5x+2","x^3-11x^2+17x+2","x^3+4x^2-13x+2"]},

{equation: "\\[ {(x-3)(x^2-x-1)=?}\\]",correctOption: "x^3-4x^2+2x+3",incorrectOptions:["x^3-11x^2+23x+3","x^3-10x+3","x^3-5x^2+5x+3"]},

{equation: "\\[ {(x+1)(x^2-x-3)=?}\\]",correctOption: "x^3-4x-3",incorrectOptions:["x^3-x^2-5x-3","x^3+6x^2+2x-3","x^3+4x^2-3"]},
]



const 乘法公式03因式分解03 = [
{equation: "\\[ {-4x^2+7xy+2y^2=?}\\]",correctOption: "(x-2y)(-4x-y)",incorrectOptions:["(3x-5y)(-3x-4y)","(-5x-3y)(x-y)","(x-5y)(-x+y)"]},

{equation: "\\[ {3x^2+6xy+3y^2=?}\\]",correctOption: "(3x+3y)(x+y)",incorrectOptions:["(x+3y)(-x-2y)","(2x+3y)(x+2y)","(-5x-5y)(x+3y)"]},

{equation: "\\[ {6x^2-10xy+4y^2=?}\\]",correctOption: "(-3x+2y)(-2x+2y)",incorrectOptions:["(-x-5y)(-4x-2y)","(-x-3y)(x-2y)","(x+2y)(-2x-4y)"]},

{equation: "\\[ {-10x^2+18xy+4y^2=?}\\]",correctOption: "(2x-4y)(-5x-y)",incorrectOptions:["(-3x-5y)(-3x+3y)","(-2x-4y)(-4x-y)","(-3x-y)(-2x+3y)"]},

{equation: "\\[ {-4x^2+4xy-y^2=?}\\]",correctOption: "(-2x+y)(2x-y)",incorrectOptions:["(3x-y)(-x-y)","(-x+y)(-5x+2y)","(-5x-y)(-2x-3y)"]},

{equation: "\\[ {-12x^2-xy+y^2=?}\\]",correctOption: "(3x+y)(-4x+y)",incorrectOptions:["(-3x-y)(-2x-5y)","(-3x+3y)(-3x-3y)","(-x+y)(-x-2y)"]},

{equation: "\\[ {15x^2-3xy-12y^2=?}\\]",correctOption: "(-5x-4y)(-3x+3y)",incorrectOptions:["(3x-3y)(-5x-y)","(-3x+2y)(x-2y)","(-2x-y)(-4x-3y)"]},

{equation: "\\[ {4x^2+8xy+3y^2=?}\\]",correctOption: "(-2x-3y)(-2x-y)",incorrectOptions:["(-x-y)(-3x-4y)","(-x-4y)(-5x+2y)","(-4x+y)(-x-y)"]},

{equation: "\\[ {5x^2+30xy+25y^2=?}\\]",correctOption: "(-5x-5y)(-x-5y)",incorrectOptions:["(-3x+2y)(3x+3y)","(x+3y)(2x-4y)","(-x-2y)(2x-3y)"]},

{equation: "\\[ {-6x^2+10xy+4y^2=?}\\]",correctOption: "(2x-4y)(-3x-y)",incorrectOptions:["(x+3y)(3x-4y)","(x-5y)(x-2y)","(2x-y)(-2x+2y)"]},

{equation: "\\[ {-10x^2+14xy+12y^2=?}\\]",correctOption: "(2x-4y)(-5x-3y)",incorrectOptions:["(x-4y)(-2x-3y)","(x+y)(2x+y)","(-2x+2y)(3x-y)"]},

{equation: "\\[ {-10x^2+29xy-10y^2=?}\\]",correctOption: "(2x-5y)(-5x+2y)",incorrectOptions:["(x-3y)(-4x+3y)","(3x-2y)(-4x-4y)","(-3x+y)(-2x-3y)"]},

{equation: "\\[ {-6x^2+19xy-15y^2=?}\\]",correctOption: "(-2x+3y)(3x-5y)",incorrectOptions:["(x-5y)(-x-y)","(2x+2y)(-2x-5y)","(-2x-y)(-4x-3y)"]},

{equation: "\\[ {x^2-4y^2=?}\\]",correctOption: "(-x-2y)(-x+2y)",incorrectOptions:["(-5x+y)(-5x+3y)","(-4x+2y)(x+3y)","(-4x-5y)(-2x-3y)"]},

{equation: "\\[ {15x^2+13xy+2y^2=?}\\]",correctOption: "(-5x-y)(-3x-2y)",incorrectOptions:["(-x-3y)(-5x-4y)","(x+3y)(x-4y)","(-5x+y)(-3x-y)"]},

{equation: "\\[ {2x^2-3xy-2y^2=?}\\]",correctOption: "(-2x-y)(-x+2y)",incorrectOptions:["(2x-y)(x-2y)","(2x-y)(x+2y)","(x-4y)(-5x+2y)"]},

{equation: "\\[ {3x^2+10xy+3y^2=?}\\]",correctOption: "(-3x-y)(-x-3y)",incorrectOptions:["(-3x-5y)(-4x+y)","(3x-5y)(-2x+2y)","(2x-2y)(-2x+y)"]},

{equation: "\\[ {-2x^2-2xy+4y^2=?}\\]",correctOption: "(2x-2y)(-x-2y)",incorrectOptions:["(-5x-5y)(x+y)","(-x-5y)(x-5y)","(-3x+3y)(2x+2y)"]},

{equation: "\\[ {-6x^2-19xy-15y^2=?}\\]",correctOption: "(2x+3y)(-3x-5y)",incorrectOptions:["(-4x+2y)(-4x+y)","(3x+2y)(x+2y)","(-4x+y)(3x+2y)"]},

{equation: "\\[ {-2x^2+5xy-3y^2=?}\\]",correctOption: "(2x-3y)(-x+y)",incorrectOptions:["(-3x+3y)(x-y)","(2x-3y)(-3x+y)","(-5x-3y)(-3x+2y)"]},

{equation: "\\[ {25x^2+10xy-15y^2=?}\\]",correctOption: "(-5x-5y)(-5x+3y)",incorrectOptions:["(-5x+y)(2x-3y)","(-5x-2y)(-4x-y)","(3x+3y)(-2x+2y)"]},

{equation: "\\[ {9x^2-y^2=?}\\]",correctOption: "(-3x+y)(-3x-y)",incorrectOptions:["(-4x-5y)(-5x-2y)","(x+y)(x-3y)","(-5x+3y)(-x-3y)"]},

{equation: "\\[ {-2x^2-9xy-9y^2=?}\\]",correctOption: "(-2x-3y)(x+3y)",incorrectOptions:["(-3x-5y)(-4x-y)","(-2x-4y)(-5x+y)","(2x-5y)(2x-4y)"]},

{equation: "\\[ {25x^2+10xy-3y^2=?}\\]",correctOption: "(-5x-3y)(-5x+y)",incorrectOptions:["(-5x+2y)(3x-2y)","(-2x-5y)(-5x+3y)","(-x+3y)(-2x+2y)"]},

{equation: "\\[ {3x^2+5xy-2y^2=?}\\]",correctOption: "(x+2y)(3x-y)",incorrectOptions:["(-x+y)(-5x+y)","(x+2y)(3x+y)","(-2x+2y)(-x-3y)"]},

{equation: "\\[ {-2x^2-4xy-2y^2=?}\\]",correctOption: "(-x-y)(2x+2y)",incorrectOptions:["(-4x+3y)(x-4y)","(2x-4y)(-x-y)","(-4x+y)(2x+3y)"]},

{equation: "\\[ {-4x^2+8xy-4y^2=?}\\]",correctOption: "(2x-2y)(-2x+2y)",incorrectOptions:["(-5x+2y)(2x+3y)","(x-4y)(3x-2y)","(-x-4y)(-2x+2y)"]},

{equation: "\\[ {-x^2+8xy-15y^2=?}\\]",correctOption: "(-x+3y)(x-5y)",incorrectOptions:["(-3x-y)(-2x+3y)","(2x-2y)(-2x-5y)","(3x-5y)(-x-3y)"]},

{equation: "\\[ {9x^2-24xy+15y^2=?}\\]",correctOption: "(3x-5y)(3x-3y)",incorrectOptions:["(-4x-y)(-2x+y)","(-4x+3y)(-5x+y)","(-4x-y)(-x-y)"]},

{equation: "\\[ {-3x^2-8xy+3y^2=?}\\]",correctOption: "(x+3y)(-3x+y)",incorrectOptions:["(-3x-3y)(x-3y)","(-2x-y)(-3x+2y)","(3x-5y)(-x+3y)"]},

{equation: "\\[ {-4x^2+12xy-8y^2=?}\\]",correctOption: "(-2x+2y)(2x-4y)",incorrectOptions:["(-2x+y)(3x-3y)","(x-y)(3x+2y)","(3x+2y)(-5x+3y)"]},

{equation: "\\[ {-9x^2+12xy+5y^2=?}\\]",correctOption: "(-3x-y)(3x-5y)",incorrectOptions:["(-5x+2y)(-2x-4y)","(3x+3y)(-5x-4y)","(-2x-5y)(x-y)"]},

{equation: "\\[ {-4x^2+18xy+10y^2=?}\\]",correctOption: "(-4x-2y)(x-5y)",incorrectOptions:["(3x-5y)(2x+y)","(3x-5y)(3x+y)","(-3x+3y)(-5x-3y)"]},

{equation: "\\[ {12x^2+14xy+4y^2=?}\\]",correctOption: "(-3x-2y)(-4x-2y)",incorrectOptions:["(-2x+y)(-4x-y)","(-2x-3y)(2x-5y)","(-2x-4y)(2x-y)"]},

{equation: "\\[ {-8x^2-16xy-8y^2=?}\\]",correctOption: "(-4x-4y)(2x+2y)",incorrectOptions:["(x+2y)(-5x-5y)","(2x-y)(x+y)","(-5x-2y)(-4x-2y)"]},

{equation: "\\[ {3x^2+7xy-6y^2=?}\\]",correctOption: "(x+3y)(3x-2y)",incorrectOptions:["(-4x-4y)(-x-2y)","(x-2y)(2x+3y)","(-4x-5y)(x-5y)"]},

{equation: "\\[ {-8x^2+14xy-6y^2=?}\\]",correctOption: "(2x-2y)(-4x+3y)",incorrectOptions:["(-2x-y)(-3x-4y)","(-x+y)(-2x-2y)","(-x-4y)(-x-4y)"]},

{equation: "\\[ {5x^2+14xy+8y^2=?}\\]",correctOption: "(-x-2y)(-5x-4y)",incorrectOptions:["(2x-2y)(-x+3y)","(-2x-3y)(x-y)","(3x+2y)(2x-y)"]},

{equation: "\\[ {-4x^2-12xy-8y^2=?}\\]",correctOption: "(-4x-4y)(x+2y)",incorrectOptions:["(-4x+2y)(3x-5y)","(-x-5y)(-3x+2y)","(-3x+3y)(3x+3y)"]},

{equation: "\\[ {-8x^2+2xy+15y^2=?}\\]",correctOption: "(2x-3y)(-4x-5y)",incorrectOptions:["(-x-2y)(x-y)","(-2x+2y)(-2x+3y)","(3x+2y)(-5x+3y)"]},

{equation: "\\[ {-12x^2-2xy+2y^2=?}\\]",correctOption: "(-4x-2y)(3x-y)",incorrectOptions:["(2x-4y)(-2x+2y)","(-2x+y)(-2x-5y)","(-2x-y)(-4x-3y)"]},

{equation: "\\[ {12x^2+23xy+5y^2=?}\\]",correctOption: "(-4x-y)(-3x-5y)",incorrectOptions:["(x-y)(-5x-2y)","(x+y)(x-5y)","(3x-2y)(-3x+3y)"]},

{equation: "\\[ {15x^2+22xy+8y^2=?}\\]",correctOption: "(-3x-2y)(-5x-4y)",incorrectOptions:["(-3x-3y)(-2x+2y)","(x-2y)(-3x-y)","(-3x-y)(-x+y)"]},

{equation: "\\[ {-15x^2-20xy-5y^2=?}\\]",correctOption: "(3x+y)(-5x-5y)",incorrectOptions:["(-2x+y)(-5x+2y)","(-5x-y)(-4x-4y)","(2x-4y)(-2x+2y)"]},

{equation: "\\[ {-3x^2-6xy-3y^2=?}\\]",correctOption: "(3x+3y)(-x-y)",incorrectOptions:["(x-3y)(-5x-y)","(3x-y)(-x+3y)","(3x+2y)(-4x+2y)"]},

{equation: "\\[ {5x^2+13xy-6y^2=?}\\]",correctOption: "(-x-3y)(-5x+2y)",incorrectOptions:["(-3x-2y)(x-3y)","(x-4y)(2x-4y)","(3x-3y)(-5x-4y)"]},

{equation: "\\[ {2x^2+9xy+9y^2=?}\\]",correctOption: "(-2x-3y)(-x-3y)",incorrectOptions:["(3x+2y)(-3x-3y)","(-4x-5y)(-4x-2y)","(-3x+2y)(-4x-5y)"]},

{equation: "\\[ {3x^2-9xy+6y^2=?}\\]",correctOption: "(x-2y)(3x-3y)",incorrectOptions:["(-4x-5y)(-x+3y)","(-2x+3y)(2x-4y)","(x-5y)(-2x-5y)"]},

{equation: "\\[ {-4x^2+22xy-10y^2=?}\\]",correctOption: "(-4x+2y)(x-5y)",incorrectOptions:["(3x-y)(-2x-3y)","(2x+3y)(2x-5y)","(2x-y)(x-3y)"]},

{equation: "\\[ {-3x^2+5xy-2y^2=?}\\]",correctOption: "(-x+y)(3x-2y)",incorrectOptions:["(-5x-4y)(-2x-3y)","(3x-y)(-3x-y)","(-3x+2y)(x-3y)"]},

{equation: "\\[ {-12x^2-16xy-4y^2=?}\\]",correctOption: "(-4x-4y)(3x+y)",incorrectOptions:["(-5x+3y)(2x+2y)","(-3x-y)(-2x-4y)","(-3x-3y)(2x-2y)"]},

{equation: "\\[ {12x^2+13xy-4y^2=?}\\]",correctOption: "(-3x-4y)(-4x+y)",incorrectOptions:["(-5x-2y)(-2x+2y)","(3x+y)(-x-y)","(-5x+3y)(-5x-y)"]},

{equation: "\\[ {-6x^2-16xy-10y^2=?}\\]",correctOption: "(-3x-5y)(2x+2y)",incorrectOptions:["(-4x+y)(-4x+y)","(-3x-4y)(x-5y)","(2x-y)(-3x-5y)"]},

{equation: "\\[ {-9x^2-3xy+2y^2=?}\\]",correctOption: "(-3x-2y)(3x-y)",incorrectOptions:["(3x-5y)(-4x-2y)","(-5x-4y)(-5x+3y)","(-5x-4y)(2x-4y)"]},

{equation: "\\[ {3x^2-10xy+3y^2=?}\\]",correctOption: "(3x-y)(x-3y)",incorrectOptions:["(x+2y)(-5x+2y)","(x+2y)(-2x-5y)","(2x-5y)(2x-4y)"]},

{equation: "\\[ {-5x^2+11xy-2y^2=?}\\]",correctOption: "(x-2y)(-5x+y)",incorrectOptions:["(2x-y)(2x-2y)","(-4x+3y)(2x+2y)","(2x-5y)(-4x-4y)"]},

{equation: "\\[ {-9x^2+15xy-6y^2=?}\\]",correctOption: "(-3x+2y)(3x-3y)",incorrectOptions:["(-4x-y)(-2x-3y)","(-x-y)(-5x-5y)","(3x-2y)(3x-y)"]},

{equation: "\\[ {2x^2-8xy+8y^2=?}\\]",correctOption: "(x-2y)(2x-4y)",incorrectOptions:["(-3x-y)(-3x-5y)","(3x-4y)(-x+3y)","(3x-4y)(-3x-4y)"]},

{equation: "\\[ {-3x^2+xy+2y^2=?}\\]",correctOption: "(x-y)(-3x-2y)",incorrectOptions:["(-5x-y)(-3x-5y)","(x-4y)(-x+3y)","(-x+3y)(x-2y)"]},

{equation: "\\[ {-12x^2+14xy+10y^2=?}\\]",correctOption: "(-4x-2y)(3x-5y)",incorrectOptions:["(x-5y)(3x+3y)","(3x-5y)(-x-3y)","(2x-4y)(x-3y)"]},

]




const 乘法公式03因式分解02= [

{equation: "\\[ {x^2-4xy+3y^2=?}\\]",correctOption: "(x-3y)(x-y)",incorrectOptions:["(x-2y)(x-5y)","(x-y)(x-y)","(x-y)(x-y)"]},

{equation: "\\[ {x^2-2xy-15y^2=?}\\]",correctOption: "(x-5y)(x+3y)",incorrectOptions:["(x-4y)(x-4y)","(x+y)(x-4y)","(x-5y)(x-2y)"]},

{equation: "\\[ {x^2+xy-2y^2=?}\\]",correctOption: "(x-y)(x+2y)",incorrectOptions:["(x-5y)(x-5y)","(x-4y)(x+3y)","(x-2y)(x+2y)"]},

{equation: "\\[ {x^2-2xy-8y^2=?}\\]",correctOption: "(x+2y)(x-4y)",incorrectOptions:["(x-3y)(x-y)","(x-y)(x+y)","(x+y)(x-5y)"]},

{equation: "\\[ {x^2-9y^2=?}\\]",correctOption: "(x-3y)(x+3y)",incorrectOptions:["(x-3y)(x-2y)","(x+y)(x+y)","(x-4y)(x+2y)"]},

{equation: "\\[ {x^2-9xy+20y^2=?}\\]",correctOption: "(x-4y)(x-5y)",incorrectOptions:["(x-3y)(x-2y)","(x-4y)(x-3y)","(x-4y)(x-y)"]},

{equation: "\\[ {x^2-7xy+10y^2=?}\\]",correctOption: "(x-5y)(x-2y)",incorrectOptions:["(x+2y)(x+2y)","(x-3y)(x-2y)","(x-3y)(x-2y)"]},

{equation: "\\[ {x^2-4y^2=?}\\]",correctOption: "(x+2y)(x-2y)",incorrectOptions:["(x-y)(x+2y)","(x-5y)(x+3y)","(x-3y)(x-y)"]},

{equation: "\\[ {x^2-4xy+3y^2=?}\\]",correctOption: "(x-3y)(x-y)",incorrectOptions:["(x-y)(x-y)","(x-y)(x+2y)","(x-y)(x+3y)"]},

{equation: "\\[ {x^2-8xy+15y^2=?}\\]",correctOption: "(x-3y)(x-5y)",incorrectOptions:["(x+3y)(x+y)","(x-4y)(x+y)","(x-3y)(x-4y)"]},

{equation: "\\[ {x^2-2xy-8y^2=?}\\]",correctOption: "(x-4y)(x+2y)",incorrectOptions:["(x-y)(x-4y)","(x-y)(x-5y)","(x-3y)(x+3y)"]},

{equation: "\\[ {x^2-4xy-5y^2=?}\\]",correctOption: "(x+y)(x-5y)",incorrectOptions:["(x-3y)(x-y)","(x-2y)(x-2y)","(x-2y)(x-4y)"]},

{equation: "\\[ {x^2+5xy+6y^2=?}\\]",correctOption: "(x+3y)(x+2y)",incorrectOptions:["(x+3y)(x-4y)","(x-5y)(x+3y)","(x-2y)(x-3y)"]},

{equation: "\\[ {x^2-y^2=?}\\]",correctOption: "(x+y)(x-y)",incorrectOptions:["(x-5y)(x+y)","(x+y)(x+3y)","(x-y)(x+3y)"]},

{equation: "\\[ {x^2-8xy+15y^2=?}\\]",correctOption: "(x-3y)(x-5y)",incorrectOptions:["(x-4y)(x-5y)","(x-y)(x-2y)","(x-3y)(x-y)"]},

{equation: "\\[ {x^2+xy-6y^2=?}\\]",correctOption: "(x+3y)(x-2y)",incorrectOptions:["(x-2y)(x+y)","(x-y)(x+y)","(x-5y)(x-4y)"]},

{equation: "\\[ {x^2-4xy-5y^2=?}\\]",correctOption: "(x-5y)(x+y)",incorrectOptions:["(x+3y)(x-4y)","(x-3y)(x+2y)","(x-4y)(x-3y)"]},

{equation: "\\[ {x^2-xy-12y^2=?}\\]",correctOption: "(x-4y)(x+3y)",incorrectOptions:["(x-5y)(x+y)","(x-y)(x-4y)","(x+2y)(x+y)"]},

{equation: "\\[ {x^2-3xy+2y^2=?}\\]",correctOption: "(x-y)(x-2y)",incorrectOptions:["(x-3y)(x+3y)","(x-3y)(x-4y)","(x-5y)(x+3y)"]},

{equation: "\\[ {x^2-4xy-5y^2=?}\\]",correctOption: "(x-5y)(x+y)",incorrectOptions:["(x+3y)(x-y)","(x-5y)(x+y)","(x-3y)(x+3y)"]},

{equation: "\\[ {x^2-xy-2y^2=?}\\]",correctOption: "(x-2y)(x+y)",incorrectOptions:["(x+2y)(x-y)","(x+2y)(x-3y)","(x-5y)(x-y)"]},

{equation: "\\[ {x^2-6xy+8y^2=?}\\]",correctOption: "(x-2y)(x-4y)",incorrectOptions:["(x-4y)(x+2y)","(x-3y)(x-5y)","(x-3y)(x+3y)"]},

{equation: "\\[ {x^2-xy-2y^2=?}\\]",correctOption: "(x+y)(x-2y)",incorrectOptions:["(x+2y)(x-3y)","(x+y)(x-3y)","(x-3y)(x+y)"]},

{equation: "\\[ {x^2-6xy+9y^2=?}\\]",correctOption: "(x-3y)(x-3y)",incorrectOptions:["(x-2y)(x+y)","(x+2y)(x-3y)","(x+3y)(x-5y)"]},

{equation: "\\[ {x^2-4xy+3y^2=?}\\]",correctOption: "(x-3y)(x-y)",incorrectOptions:["(x+2y)(x-y)","(x+3y)(x-2y)","(x-2y)(x+y)"]},

{equation: "\\[ {x^2-6xy+8y^2=?}\\]",correctOption: "(x-4y)(x-2y)",incorrectOptions:["(x-3y)(x+y)","(x+2y)(x-2y)","(x-3y)(x-4y)"]},

{equation: "\\[ {x^2+5xy+6y^2=?}\\]",correctOption: "(x+3y)(x+2y)",incorrectOptions:["(x-3y)(x-2y)","(x+2y)(x-5y)","(x-2y)(x+3y)"]},

{equation: "\\[ {x^2+xy-2y^2=?}\\]",correctOption: "(x+2y)(x-y)",incorrectOptions:["(x+y)(x+y)","(x-y)(x+y)","(x+2y)(x-2y)"]},

{equation: "\\[ {x^2-3xy+2y^2=?}\\]",correctOption: "(x-2y)(x-y)",incorrectOptions:["(x-2y)(x-y)","(x-3y)(x-5y)","(x-y)(x-5y)"]},

{equation: "\\[ {x^2-2xy-3y^2=?}\\]",correctOption: "(x+y)(x-3y)",incorrectOptions:["(x-y)(x+y)","(x-y)(x-y)","(x-4y)(x+3y)"]},
{equation: "\\[ {x^2-7xy+10y^2=?}\\]",correctOption: "(x-5y)(x-2y)",incorrectOptions:["(x-y)(x-y)","(x+3y)(x+y)","(x-3y)(x-2y)"]},

{equation: "\\[ {x^2-2xy-8y^2=?}\\]",correctOption: "(x+2y)(x-4y)",incorrectOptions:["(x-3y)(x+y)","(x-4y)(x-3y)","(x-y)(x-3y)"]},

{equation: "\\[ {x^2-2xy-8y^2=?}\\]",correctOption: "(x-4y)(x+2y)",incorrectOptions:["(x-2y)(x+2y)","(x+3y)(x-3y)","(x-4y)(x+2y)"]},

{equation: "\\[ {x^2-7xy+12y^2=?}\\]",correctOption: "(x-3y)(x-4y)",incorrectOptions:["(x+3y)(x-4y)","(x-5y)(x-4y)","(x+2y)(x+2y)"]},

{equation: "\\[ {x^2-8xy+15y^2=?}\\]",correctOption: "(x-5y)(x-3y)",incorrectOptions:["(x-2y)(x+y)","(x+2y)(x+y)","(x-2y)(x-3y)"]},

{equation: "\\[ {x^2-8xy+15y^2=?}\\]",correctOption: "(x-5y)(x-3y)",incorrectOptions:["(x-y)(x-y)","(x-5y)(x+3y)","(x+2y)(x+y)"]},

{equation: "\\[ {x^2-7xy+12y^2=?}\\]",correctOption: "(x-3y)(x-4y)",incorrectOptions:["(x+y)(x-3y)","(x-y)(x-y)","(x-y)(x+2y)"]},

{equation: "\\[ {x^2-2xy-3y^2=?}\\]",correctOption: "(x+y)(x-3y)",incorrectOptions:["(x-y)(x-2y)","(x-4y)(x-3y)","(x+2y)(x-5y)"]},

{equation: "\\[ {x^2-2xy-8y^2=?}\\]",correctOption: "(x+2y)(x-4y)",incorrectOptions:["(x-2y)(x-y)","(x+y)(x-5y)","(x-2y)(x+y)"]},

{equation: "\\[ {x^2+3xy+2y^2=?}\\]",correctOption: "(x+y)(x+2y)",incorrectOptions:["(x-4y)(x-y)","(x-3y)(x+y)","(x+2y)(x+3y)"]},

{equation: "\\[ {x^2+3xy+2y^2=?}\\]",correctOption: "(x+2y)(x+y)",incorrectOptions:["(x-5y)(x+y)","(x-y)(x+y)","(x-3y)(x-5y)"]},

{equation: "\\[ {x^2-7xy+12y^2=?}\\]",correctOption: "(x-4y)(x-3y)",incorrectOptions:["(x+3y)(x-y)","(x-y)(x-3y)","(x-3y)(x-5y)"]},

{equation: "\\[ {x^2-5xy+4y^2=?}\\]",correctOption: "(x-y)(x-4y)",incorrectOptions:["(x+3y)(x-y)","(x+3y)(x-5y)","(x+3y)(x-5y)"]},

{equation: "\\[ {x^2-y^2=?}\\]",correctOption: "(x-y)(x+y)",incorrectOptions:["(x+y)(x-y)","(x-y)(x-3y)","(x-y)(x-y)"]},

{equation: "\\[ {x^2+4xy+3y^2=?}\\]",correctOption: "(x+y)(x+3y)",incorrectOptions:["(x+3y)(x-3y)","(x-3y)(x+3y)","(x+2y)(x-5y)"]},

{equation: "\\[ {x^2-4xy+4y^2=?}\\]",correctOption: "(x-2y)(x-2y)",incorrectOptions:["(x-4y)(x-5y)","(x-y)(x-5y)","(x-4y)(x-4y)"]},

{equation: "\\[ {x^2+6xy+9y^2=?}\\]",correctOption: "(x+3y)(x+3y)",incorrectOptions:["(x-5y)(x-5y)","(x-3y)(x-5y)","(x+3y)(x+2y)"]},

{equation: "\\[ {x^2-6xy+8y^2=?}\\]",correctOption: "(x-2y)(x-4y)",incorrectOptions:["(x+y)(x-5y)","(x-2y)(x-3y)","(x+3y)(x+2y)"]},

{equation: "\\[ {x^2+2xy-3y^2=?}\\]",correctOption: "(x+3y)(x-y)",incorrectOptions:["(x-2y)(x+2y)","(x-5y)(x-3y)","(x+3y)(x-4y)"]},

{equation: "\\[ {x^2+xy-2y^2=?}\\]",correctOption: "(x-y)(x+2y)",incorrectOptions:["(x-2y)(x-y)","(x-5y)(x+2y)","(x+2y)(x-4y)"]},

{equation: "\\[ {x^2-3xy-4y^2=?}\\]",correctOption: "(x+y)(x-4y)",incorrectOptions:["(x-5y)(x+3y)","(x+2y)(x-y)","(x-4y)(x-3y)"]},

{equation: "\\[ {x^2-3xy-10y^2=?}\\]",correctOption: "(x+2y)(x-5y)",incorrectOptions:["(x+y)(x+y)","(x-3y)(x+2y)","(x-y)(x-y)"]},

{equation: "\\[ {x^2-9y^2=?}\\]",correctOption: "(x+3y)(x-3y)",incorrectOptions:["(x-4y)(x+y)","(x-5y)(x+3y)","(x-y)(x+y)"]},

{equation: "\\[ {x^2-xy-12y^2=?}\\]",correctOption: "(x-4y)(x+3y)",incorrectOptions:["(x-5y)(x+y)","(x-2y)(x+y)","(x-4y)(x+y)"]},

{equation: "\\[ {x^2-3xy-10y^2=?}\\]",correctOption: "(x-5y)(x+2y)",incorrectOptions:["(x-2y)(x-4y)","(x-5y)(x+2y)","(x-4y)(x-4y)"]},

{equation: "\\[ {x^2-4y^2=?}\\]",correctOption: "(x+2y)(x-2y)",incorrectOptions:["(x-3y)(x+y)","(x-3y)(x-2y)","(x+y)(x-2y)"]},

{equation: "\\[ {x^2-6xy+5y^2=?}\\]",correctOption: "(x-y)(x-5y)",incorrectOptions:["(x-4y)(x-y)","(x-3y)(x-y)","(x-3y)(x-y)"]},

{equation: "\\[ {x^2-9y^2=?}\\]",correctOption: "(x-3y)(x+3y)",incorrectOptions:["(x+3y)(x-3y)","(x+2y)(x-4y)","(x+3y)(x-3y)"]},

{equation: "\\[ {x^2+3xy+2y^2=?}\\]",correctOption: "(x+2y)(x+y)",incorrectOptions:["(x-y)(x+2y)","(x+2y)(x-5y)","(x-5y)(x-2y)"]},

{equation: "\\[ {x^2-xy-2y^2=?}\\]",correctOption: "(x-2y)(x+y)",incorrectOptions:["(x-3y)(x-y)","(x+y)(x+y)","(x-2y)(x+y)"]},

]



const 乘法公式03因式分解01 = [

{equation: "\\[ {x^2+7x-8=?}\\]",correctOption: "(x-1)(x+8)",incorrectOptions:["(x-3)(x-2)","(x-2)(x-10)","(x+8)(x+1)"]},

{equation: "\\[ {x^2-2x+1=?}\\]",correctOption: "(x-1)^2",incorrectOptions:["(x+7)(x-3)","(x-5)(x+6)","(x-1)(x-6)"]},

{equation: "\\[ {x^2-6x+8=?}\\]",correctOption: "(x-4)(x-2)",incorrectOptions:["(x-9)(x+7)","(x-5)(x-10)","(x-8)(x-1)"]},

{equation: "\\[ {x^2-2x-63=?}\\]",correctOption: "(x-9)(x+7)",incorrectOptions:["(x-9)(x-8)","(x+6)(x+3)","(x-3)(x+5)"]},

{equation: "\\[ {x^2-7x-18=?}\\]",correctOption: "(x-9)(x+2)",incorrectOptions:["(x+2)(x+1)","(x-2)(x+1)","(x+4)(x-2)"]},

{equation: "\\[ {x^2+5x-6=?}\\]",correctOption: "(x-1)(x+6)",incorrectOptions:["(x-8)(x-8)","(x+8)(x-4)","(x+3)(x-3)"]},

{equation: "\\[ {x^2+8x+15=?}\\]",correctOption: "(x+5)(x+3)",incorrectOptions:["(x-4)(x-1)","(x+3)(x+7)","(x+8)(x+4)"]},

{equation: "\\[ {x^2+5x-24=?}\\]",correctOption: "(x-3)(x+8)",incorrectOptions:["(x+7)(x+4)","(x-7)(x-4)","(x+5)(x-8)"]},

{equation: "\\[ {x^2+2x-15=?}\\]",correctOption: "(x+5)(x-3)",incorrectOptions:["(x-4)(x+3)","(x+7)(x-2)","(x-1)(x+4)"]},

{equation: "\\[ {x^2+7x+10=?}\\]",correctOption: "(x+5)(x+2)",incorrectOptions:["(x+4)(x-7)","(x-6)(x+7)","(x-9)(x+8)"]},

{equation: "\\[ {x^2+3x+2=?}\\]",correctOption: "(x+1)(x+2)",incorrectOptions:["(x-8)(x+2)","(x+2)(x+4)","(x-4)(x-4)"]},

{equation: "\\[ {x^2+6x+8=?}\\]",correctOption: "(x+4)(x+2)",incorrectOptions:["(x+4)(x+1)","(x+5)(x+8)","(x+1)(x+2)"]},

{equation: "\\[ {x^2+13x+42=?}\\]",correctOption: "(x+6)(x+7)",incorrectOptions:["(x+8)(x-2)","(x+3)(x+1)","(x-5)(x-3)"]},

{equation: "\\[ {x^2-49=?}\\]",correctOption: "(x-7)(x+7)",incorrectOptions:["(x-9)(x-2)","(x-5)(x-8)","(x+6)(x-6)"]},

{equation: "\\[ {x^2-2x-24=?}\\]",correctOption: "(x+4)(x-6)",incorrectOptions:["(x+4)(x+6)","(x-4)(x-3)","(x-4)(x+6)"]},

{equation: "\\[ {x^2+3x-28=?}\\]",correctOption: "(x+7)(x-4)",incorrectOptions:["(x-7)(x+5)","(x+6)(x+6)","(x+4)(x-7)"]},

{equation: "\\[ {x^2-2x-15=?}\\]",correctOption: "(x-5)(x+3)",incorrectOptions:["(x+6)(x+1)","(x+5)(x-6)","(x+8)(x-4)"]},

{equation: "\\[ {x^2-4x-45=?}\\]",correctOption: "(x+5)(x-9)",incorrectOptions:["(x+1)(x-6)","(x+7)(x-1)","(x-6)(x-6)"]},

{equation: "\\[ {x^2+2x-8=?}\\]",correctOption: "(x+4)(x-2)",incorrectOptions:["(x+6)(x-7)","(x+8)(x-8)","(x-10)(x-5)"]},

{equation: "\\[ {x^2-7x-18=?}\\]",correctOption: "(x-9)(x+2)",incorrectOptions:["(x-10)(x-6)","(x-4)(x-8)","(x+5)(x-5)"]},

{equation: "\\[ {x^2-14x+48=?}\\]",correctOption: "(x-8)(x-6)",incorrectOptions:["(x+5)(x-4)","(x+2)(x+8)","(x-2)(x-8)"]},

{equation: "\\[ {x^2-5x-50=?}\\]",correctOption: "(x-10)(x+5)",incorrectOptions:["(x-6)(x-5)","(x-10)(x+3)","(x-10)(x-6)"]},

{equation: "\\[ {x^2+9x+20=?}\\]",correctOption: "(x+5)(x+4)",incorrectOptions:["(x+3)(x-7)","(x+6)(x-5)","(x+5)(x+2)"]},

{equation: "\\[ {x^2+6x+8=?}\\]",correctOption: "(x+2)(x+4)",incorrectOptions:["(x-10)(x+6)","(x-1)(x+6)","(x-4)(x-2)"]},

{equation: "\\[ {x^2+15x+56=?}\\]",correctOption: "(x+8)(x+7)",incorrectOptions:["(x+6)(x-5)","(x-7)(x-5)","(x+7)(x+5)"]},

{equation: "\\[ {x^2+3x+2=?}\\]",correctOption: "(x+2)(x+1)",incorrectOptions:["(x+4)(x-3)","(x-4)(x-9)","(x+7)(x-9)"]},

{equation: "\\[ {x^2-25=?}\\]",correctOption: "(x+5)(x-5)",incorrectOptions:["(x+8)(x-6)","(x-7)(x-5)","(x-6)(x+8)"]},

{equation: "\\[ {x^2-5x+4=?}\\]",correctOption: "(x-1)(x-4)",incorrectOptions:["(x-8)(x-8)","(x-4)(x-10)","(x+8)(x+7)"]},

{equation: "\\[ {x^2-19x+90=?}\\]",correctOption: "(x-9)(x-10)",incorrectOptions:["(x-1)(x+2)","(x-7)(x-9)","(x+1)(x+8)"]},

{equation: "\\[ {x^2+7x+12=?}\\]",correctOption: "(x+4)(x+3)",incorrectOptions:["(x-3)(x-8)","(x-2)(x-4)","(x-8)(x+1)"]},
{equation: "\\[ {x^2-9x+18=?}\\]",correctOption: "(x-6)(x-3)",incorrectOptions:["(x-5)(x-10)","(x-8)(x-7)","(x+8)(x-7)"]},

{equation: "\\[ {x^2-x-42=?}\\]",correctOption: "(x+6)(x-7)",incorrectOptions:["(x-7)(x+7)","(x+4)(x+2)","(x+5)(x+1)"]},

{equation: "\\[ {x^2+x-42=?}\\]",correctOption: "(x+7)(x-6)",incorrectOptions:["(x-9)(x-2)","(x-6)(x+6)","(x-7)(x-10)"]},

{equation: "\\[ {x^2-x-30=?}\\]",correctOption: "(x+5)(x-6)",incorrectOptions:["(x-3)(x-2)","(x-2)(x-2)","(x-1)(x-4)"]},

{equation: "\\[ {x^2-x-20=?}\\]",correctOption: "(x+4)(x-5)",incorrectOptions:["(x-2)(x-7)","(x+6)(x-6)","(x+6)(x-4)"]},

{equation: "\\[ {x^2+4x-12=?}\\]",correctOption: "(x-2)(x+6)",incorrectOptions:["(x-1)(x-4)","(x-10)(x-5)","(x+2)(x+8)"]},

{equation: "\\[ {x^2-x-30=?}\\]",correctOption: "(x-6)(x+5)",incorrectOptions:["(x+8)(x-7)","(x+2)(x+7)","(x+3)(x+1)"]},

{equation: "\\[ {x^2-17x+72=?}\\]",correctOption: "(x-9)(x-8)",incorrectOptions:["(x+8)(x+3)","(x+8)(x+3)","(x-6)(x-1)"]},

{equation: "\\[ {x^2-4x+3=?}\\]",correctOption: "(x-1)(x-3)",incorrectOptions:["(x+3)(x+5)","(x-3)(x-8)","(x-2)(x-1)"]},

{equation: "\\[ {x^2-36=?}\\]",correctOption: "(x+6)(x-6)",incorrectOptions:["(x-7)(x-7)","(x+4)(x+6)","(x-2)(x+3)"]},

{equation: "\\[ {x^2-9x+18=?}\\]",correctOption: "(x-3)(x-6)",incorrectOptions:["(x-6)(x-9)","(x+4)(x+6)","(x+4)(x+4)"]},

{equation: "\\[ {x^2+11x+30=?}\\]",correctOption: "(x+5)(x+6)",incorrectOptions:["(x-5)(x-2)","(x-10)(x-9)","(x-5)(x+1)"]},

{equation: "\\[ {x^2-5x-6=?}\\]",correctOption: "(x+1)(x-6)",incorrectOptions:["(x-10)(x+4)","(x+5)(x-6)","(x-8)(x-8)"]},

{equation: "\\[ {x^2+x-2=?}\\]",correctOption: "(x-1)(x+2)",incorrectOptions:["(x+6)(x+4)","(x+4)(x+8)","(x-4)(x-3)"]},

{equation: "\\[ {x^2-18x+80=?}\\]",correctOption: "(x-10)(x-8)",incorrectOptions:["(x+3)(x-4)","(x-9)(x-2)","(x-10)(x-5)"]},

{equation: "\\[ {x^2-4x-32=?}\\]",correctOption: "(x+4)(x-8)",incorrectOptions:["(x+4)(x+7)","(x-6)(x+6)","(x-2)(x+7)"]},

{equation: "\\[ {x^2-18x+80=?}\\]",correctOption: "(x-8)(x-10)",incorrectOptions:["(x-10)(x-3)","(x+7)(x+4)","(x-4)(x-4)"]},

{equation: "\\[ {x^2-3x+2=?}\\]",correctOption: "(x-1)(x-2)",incorrectOptions:["(x+4)(x-4)","(x-2)(x-8)","(x+4)(x-4)"]},

{equation: "\\[ {x^2-12x+32=?}\\]",correctOption: "(x-8)(x-4)",incorrectOptions:["(x+7)(x+4)","(x+8)(x+7)","(x+1)(x+7)"]},

{equation: "\\[ {x^2-2x-80=?}\\]",correctOption: "(x-10)(x+8)",incorrectOptions:["(x+5)(x+6)","(x-10)(x+7)","(x-1)(x-5)"]},

{equation: "\\[ {x^2-15x+54=?}\\]",correctOption: "(x-9)(x-6)",incorrectOptions:["(x+8)(x+1)","(x+8)(x+4)","(x+7)(x+8)"]},

{equation: "\\[ {x^2+2x-15=?}\\]",correctOption: "(x-3)(x+5)",incorrectOptions:["(x+1)(x-6)","(x-10)(x+3)","(x-2)(x-2)"]},

{equation: "\\[ {x^2-6x-27=?}\\]",correctOption: "(x-9)(x+3)",incorrectOptions:["(x-9)(x+5)","(x-7)(x-3)","(x-9)(x-10)"]},

{equation: "\\[ {x^2-x-20=?}\\]",correctOption: "(x+4)(x-5)",incorrectOptions:["(x-3)(x-3)","(x-4)(x-2)","(x-2)(x-9)"]},

{equation: "\\[ {x^2-9x+14=?}\\]",correctOption: "(x-2)(x-7)",incorrectOptions:["(x+4)(x-8)","(x-1)(x+4)","(x+6)(x+7)"]},

{equation: "\\[ {x^2+4x-5=?}\\]",correctOption: "(x-1)(x+5)",incorrectOptions:["(x+8)(x+7)","(x+7)(x-8)","(x-1)(x+8)"]},

{equation: "\\[ {x^2-5x+6=?}\\]",correctOption: "(x-2)(x-3)",incorrectOptions:["(x+1)(x-5)","(x+3)(x-10)","(x+1)(x-1)"]},

{equation: "\\[ {x^2+13x+40=?}\\]",correctOption: "(x+8)(x+5)",incorrectOptions:["(x-8)(x+5)","(x-8)(x-2)","(x+4)(x+2)"]},

{equation: "\\[ {x^2-25=?}\\]",correctOption: "(x+5)(x-5)",incorrectOptions:["(x+4)(x+7)","(x+8)(x-6)","(x+1)(x+4)"]},

{equation: "\\[ {x^2-12x+32=?}\\]",correctOption: "(x-4)(x-8)",incorrectOptions:["(x-3)(x+4)","(x-3)(x-4)","(x+2)(x-1)"]},

]


const 乘法公式02整式乘法 = [

{equation: "\\[ {(x-4y)(-5x-5y)=?}\\]",correctOption: "-5x^2+15xy+20y^2",incorrectOptions:["15x^2-24xy+9y^2","-5x^2+5xy+10y^2","-15x^2+8xy+16y^2"]},

{equation: "\\[ {(x-5y)(x-2y)=?}\\]",correctOption: "x^2-7xy+10y^2",incorrectOptions:["-2x^2-xy+3y^2","-10x^2+26xy-12y^2","4x^2+4xy-3y^2"]},

{equation: "\\[ {(3x-3y)(-2x-2y)=?}\\]",correctOption: "-6x^2+6y^2",incorrectOptions:["15x^2+14xy+3y^2","5x^2+14xy-3y^2","3x^2-12xy-15y^2"]},

{equation: "\\[ {(-4x-4y)(-2x-2y)=?}\\]",correctOption: "8x^2+16xy+8y^2",incorrectOptions:["-6x^2-8xy+8y^2","3x^2-16xy+5y^2","2x^2+9xy+10y^2"]},

{equation: "\\[ {(-4x-4y)(-3x-3y)=?}\\]",correctOption: "12x^2+24xy+12y^2",incorrectOptions:["3x^2+12xy-15y^2","10x^2+xy-2y^2","-3x^2+2xy+5y^2"]},

{equation: "\\[ {(-4x-3y)(x-4y)=?}\\]",correctOption: "-4x^2+13xy+12y^2",incorrectOptions:["-9x^2+15xy-4y^2","2x^2+5xy+3y^2","10x^2+12xy+2y^2"]},

{equation: "\\[ {(-4x+3y)(3x-4y)=?}\\]",correctOption: "-12x^2+25xy-12y^2",incorrectOptions:["-3x^2-xy+2y^2","-4x^2+15xy+4y^2","12x^2+13xy+3y^2"]},

{equation: "\\[ {(-x+3y)(-x+2y)=?}\\]",correctOption: "x^2-5xy+6y^2",incorrectOptions:["-12x^2+3xy+9y^2","20x^2+26xy+8y^2","-15x^2+xy+2y^2"]},

{equation: "\\[ {(3x+y)(-3x+3y)=?}\\]",correctOption: "-9x^2+6xy+3y^2",incorrectOptions:["9x^2-12xy+3y^2","-x^2-3xy-2y^2","-2x^2+4xy-2y^2"]},

{equation: "\\[ {(-x+2y)(-2x-4y)=?}\\]",correctOption: "2x^2-8y^2",incorrectOptions:["6x^2+7xy-5y^2","-x^2-2xy-y^2","9x^2+15xy+6y^2"]},

{equation: "\\[ {(-3x-3y)(-5x+3y)=?}\\]",correctOption: "15x^2+6xy-9y^2",incorrectOptions:["-5x^2+11xy+12y^2","-3x^2+10xy+8y^2","3x^2-3y^2"]},

{equation: "\\[ {(-3x-3y)(-x+2y)=?}\\]",correctOption: "3x^2-3xy-6y^2",incorrectOptions:["4x^2+17xy+4y^2","20x^2-13xy+2y^2","-6x^2-4xy+2y^2"]},

{equation: "\\[ {(-5x+3y)(-3x-2y)=?}\\]",correctOption: "15x^2+xy-6y^2",incorrectOptions:["-9x^2-12xy+5y^2","-4x^2+12xy+16y^2","-15x^2+31xy-10y^2"]},

{equation: "\\[ {(-3x-y)(-2x+3y)=?}\\]",correctOption: "6x^2-7xy-3y^2",incorrectOptions:["3x^2+6xy-9y^2","-15x^2-10xy+5y^2","-12x^2-xy+y^2"]},

{equation: "\\[ {(-3x+2y)(-2x-y)=?}\\]",correctOption: "6x^2-xy-2y^2",incorrectOptions:["5x^2+23xy+12y^2","x^2-3xy-4y^2","-6x^2+3xy+3y^2"]},

{equation: "\\[ {(2x-y)(-4x-2y)=?}\\]",correctOption: "-8x^2+2y^2",incorrectOptions:["-2x^2-4xy+6y^2","-4x^2+8xy+12y^2","25x^2-y^2"]},

{equation: "\\[ {(-3x-y)(x+2y)=?}\\]",correctOption: "-3x^2-7xy-2y^2",incorrectOptions:["6x^2+xy-y^2","15x^2+7xy-4y^2","10x^2-11xy+3y^2"]},

{equation: "\\[ {(x-4y)(-3x-2y)=?}\\]",correctOption: "-3x^2+10xy+8y^2",incorrectOptions:["9x^2+6xy-3y^2","4x^2-4xy-15y^2","-4x^2+4xy+3y^2"]},

{equation: "\\[ {(3x-2y)(-4x+y)=?}\\]",correctOption: "-12x^2+11xy-2y^2",incorrectOptions:["10x^2+21xy-10y^2","3x^2+5xy-2y^2","8x^2+18xy+4y^2"]},

{equation: "\\[ {(-x-3y)(2x+y)=?}\\]",correctOption: "-2x^2-7xy-3y^2",incorrectOptions:["6x^2-13xy+5y^2","16x^2-4y^2","-6x^2+3xy+3y^2"]},

{equation: "\\[ {(-x-y)(x+3y)=?}\\]",correctOption: "-x^2-4xy-3y^2",incorrectOptions:["2x^2+3xy+y^2","-x^2-5xy-6y^2","-3x^2-16xy-5y^2"]},

{equation: "\\[ {(x-y)(-2x-3y)=?}\\]",correctOption: "-2x^2-xy+3y^2",incorrectOptions:["x^2+xy-6y^2","-6x^2+6y^2","-6x^2+3xy+9y^2"]},

{equation: "\\[ {(3x-4y)(-x+2y)=?}\\]",correctOption: "-3x^2+10xy-8y^2",incorrectOptions:["4x^2+5xy-6y^2","-3x^2-8xy-4y^2","2x^2+3xy-2y^2"]},

{equation: "\\[ {(-2x-4y)(-x-4y)=?}\\]",correctOption: "2x^2+12xy+16y^2",incorrectOptions:["-x^2+16y^2","-3x^2+11xy+20y^2","6x^2-11xy+3y^2"]},

{equation: "\\[ {(-2x+y)(x-2y)=?}\\]",correctOption: "-2x^2+5xy-2y^2",incorrectOptions:["-x^2-5xy-6y^2","4x^2+16xy+12y^2","4x^2+10xy+4y^2"]},

{equation: "\\[ {(-5x-3y)(-3x-2y)=?}\\]",correctOption: "15x^2+19xy+6y^2",incorrectOptions:["5x^2+24xy+16y^2","10x^2+22xy+4y^2","2x^2-7xy+6y^2"]},

{equation: "\\[ {(-4x-y)(-x-2y)=?}\\]",correctOption: "4x^2+9xy+2y^2",incorrectOptions:["-12x^2-24xy-12y^2","4x^2+21xy+20y^2","3x^2+12xy-15y^2"]},

{equation: "\\[ {(2x-3y)(-2x-y)=?}\\]",correctOption: "-4x^2+4xy+3y^2",incorrectOptions:["-15x^2-10xy+5y^2","4x^2-5xy-6y^2","6x^2-14xy+4y^2"]},

{equation: "\\[ {(-x+3y)(-x-3y)=?}\\]",correctOption: "x^2-9y^2",incorrectOptions:["5x^2-13xy+6y^2","6x^2+16xy+8y^2","-9x^2+15xy-4y^2"]},

{equation: "\\[ {(-x-5y)(-3x-4y)=?}\\]",correctOption: "3x^2+19xy+20y^2",incorrectOptions:["-12x^2+11xy-2y^2","6x^2-2xy-4y^2","4x^2+19xy+12y^2"]},

{equation: "\\[ {(-2x+y)(-5x-y)=?}\\]",correctOption: "10x^2-3xy-y^2",incorrectOptions:["-x^2+2xy-y^2","-x^2+3xy+10y^2","x^2+xy-2y^2"]},

{equation: "\\[ {(-2x-4y)(-2x+y)=?}\\]",correctOption: "4x^2+6xy-4y^2",incorrectOptions:["-12x^2+11xy-2y^2","-5x^2+4xy+y^2","-4x^2+12xy-8y^2"]},

{equation: "\\[ {(-2x+2y)(2x+y)=?}\\]",correctOption: "-4x^2+2xy+2y^2",incorrectOptions:["20x^2+18xy+4y^2","4x^2+12xy+8y^2","5x^2-7xy+2y^2"]},

{equation: "\\[ {(-3x-3y)(2x-4y)=?}\\]",correctOption: "-6x^2+6xy+12y^2",incorrectOptions:["3x^2+4xy+y^2","16x^2+32xy+15y^2","5x^2-13xy+6y^2"]},

{equation: "\\[ {(2x-y)(3x+2y)=?}\\]",correctOption: "6x^2+xy-2y^2",incorrectOptions:["-3x^2+5xy+2y^2","4x^2-2xy-6y^2","-15x^2+9xy+6y^2"]},

{equation: "\\[ {(-2x+2y)(-2x+3y)=?}\\]",correctOption: "4x^2-10xy+6y^2",incorrectOptions:["6x^2-4xy-2y^2","-x^2+3xy+4y^2","8x^2-2xy-6y^2"]},

{equation: "\\[ {(2x+3y)(-5x+2y)=?}\\]",correctOption: "-10x^2-11xy+6y^2",incorrectOptions:["-5x^2-12xy+9y^2","2x^2-7xy+3y^2","12x^2+13xy+3y^2"]},

{equation: "\\[ {(2x-3y)(3x+y)=?}\\]",correctOption: "6x^2-7xy-3y^2",incorrectOptions:["15x^2-11xy+2y^2","8x^2-14xy+3y^2","5x^2+17xy+6y^2"]},

{equation: "\\[ {(-5x+y)(-2x-4y)=?}\\]",correctOption: "10x^2+18xy-4y^2",incorrectOptions:["-3x^2-2xy+8y^2","-15x^2-16xy-4y^2","6x^2+2xy-4y^2"]},

{equation: "\\[ {(-3x-3y)(-4x-2y)=?}\\]",correctOption: "12x^2+18xy+6y^2",incorrectOptions:["x^2+6xy+5y^2","6x^2-20xy+16y^2","-4x^2-9xy+9y^2"]},

{equation: "\\[ {(-5x+3y)(-x-5y)=?}\\]",correctOption: "5x^2+22xy-15y^2",incorrectOptions:["15x^2-8xy+y^2","-4x^2+16xy+20y^2","20x^2-2xy-4y^2"]},

{equation: "\\[ {(2x+y)(x+2y)=?}\\]",correctOption: "2x^2+5xy+2y^2",incorrectOptions:["-9x^2+16y^2","6x^2-10xy-4y^2","-2x^2+5xy-2y^2"]},

{equation: "\\[ {(x-4y)(-4x-4y)=?}\\]",correctOption: "-4x^2+12xy+16y^2",incorrectOptions:["-9x^2+y^2","3x^2-8xy+4y^2","-2x^2-8xy+10y^2"]},

{equation: "\\[ {(2x+3y)(-3x-y)=?}\\]",correctOption: "-6x^2-11xy-3y^2",incorrectOptions:["-8x^2-6xy-y^2","-5x^2-8xy+4y^2","-15x^2+8xy-y^2"]},

{equation: "\\[ {(x-5y)(-3x+y)=?}\\]",correctOption: "-3x^2+16xy-5y^2",incorrectOptions:["-4x^2-14xy-12y^2","-3x^2+11xy+4y^2","3x^2+xy-4y^2"]},

{equation: "\\[ {(-4x+y)(2x-2y)=?}\\]",correctOption: "-8x^2+10xy-2y^2",incorrectOptions:["4x^2-4y^2","-8x^2-4xy+4y^2","-4x^2+8xy-3y^2"]},

{equation: "\\[ {(2x-y)(-5x-4y)=?}\\]",correctOption: "-10x^2-3xy+4y^2",incorrectOptions:["16x^2-20xy+6y^2","-15x^2-20xy-5y^2","20x^2+25xy+5y^2"]},

{equation: "\\[ {(-3x-2y)(x-2y)=?}\\]",correctOption: "-3x^2+4xy+4y^2",incorrectOptions:["3x^2-11xy+6y^2","9x^2+18xy+5y^2","-12x^2+5xy+3y^2"]},

{equation: "\\[ {(-3x-3y)(3x-3y)=?}\\]",correctOption: "-9x^2+9y^2",incorrectOptions:["-2x^2+5xy+3y^2","-9x^2+24xy-15y^2","4x^2-7xy-2y^2"]},

{equation: "\\[ {(-3x-3y)(3x-3y)=?}\\]",correctOption: "-9x^2+9y^2",incorrectOptions:["-6x^2-10xy-4y^2","-x^2-5xy-6y^2","4x^2+xy-3y^2"]},

{equation: "\\[ {(2x-4y)(-3x-2y)=?}\\]",correctOption: "-6x^2+8xy+8y^2",incorrectOptions:["-2x^2+11xy-12y^2","4x^2+4xy+y^2","15x^2+35xy+20y^2"]},

{equation: "\\[ {(-2x-2y)(x-5y)=?}\\]",correctOption: "-2x^2+8xy+10y^2",incorrectOptions:["8x^2+28xy+20y^2","-4x^2+10xy-4y^2","-3x^2-10xy+8y^2"]},

{equation: "\\[ {(3x+3y)(2x-4y)=?}\\]",correctOption: "6x^2-6xy-12y^2",incorrectOptions:["-2x^2-7xy+15y^2","2x^2-15xy+25y^2","-4x^2-6xy+10y^2"]},

{equation: "\\[ {(-x-2y)(-3x+y)=?}\\]",correctOption: "3x^2+5xy-2y^2",incorrectOptions:["-x^2+xy+2y^2","-5x^2+16xy+16y^2","-4x^2-15xy-9y^2"]},

{equation: "\\[ {(-5x-4y)(-5x+3y)=?}\\]",correctOption: "25x^2+5xy-12y^2",incorrectOptions:["3x^2-10xy-8y^2","9x^2+15xy+6y^2","25x^2+5xy-2y^2"]},

{equation: "\\[ {(x-2y)(-x-y)=?}\\]",correctOption: "-x^2+xy+2y^2",incorrectOptions:["-4x^2-2xy+2y^2","20x^2-2xy-4y^2","-4x^2+11xy+3y^2"]},

{equation: "\\[ {(3x-3y)(x-4y)=?}\\]",correctOption: "3x^2-15xy+12y^2",incorrectOptions:["-x^2+3xy+4y^2","6x^2+8xy-8y^2","16x^2+24xy+8y^2"]},

{equation: "\\[ {(-5x-y)(-4x-4y)=?}\\]",correctOption: "20x^2+24xy+4y^2",incorrectOptions:["6x^2+20xy+16y^2","8x^2+6xy-9y^2","9x^2+15xy+6y^2"]},

{equation: "\\[ {(x-2y)(-2x-4y)=?}\\]",correctOption: "-2x^2+8y^2",incorrectOptions:["-4x^2-4xy+8y^2","3x^2+12xy+9y^2","-4x^2-6xy+10y^2"]},

{equation: "\\[ {(-2x+3y)(x+3y)=?}\\]",correctOption: "-2x^2-3xy+9y^2",incorrectOptions:["2x^2+3xy-5y^2","-5x^2+16xy-3y^2","-2x^2-8xy+10y^2"]},


]







const 乘法公式01整式乘法 = [
{equation: "\\[ {(x+6)(x-5)=?}\\]",correctOption: "x^2+x-30",incorrectOptions:["x^2-7x+6","x^2-10x+21","x^2-9x+20"]},

{equation: "\\[ {x(x-6)=?}\\]",correctOption: "x^2-6x",incorrectOptions:["x^2-5x+4","x^2-16","x^2-4x-45"]},

{equation: "\\[ {(x-8)(x-1)=?}\\]",correctOption: "x^2-9x+8",incorrectOptions:["x^2-15x+54","x^2+11x+28","x^2-16x+60"]},

{equation: "\\[ {(x+7)(x-8)=?}\\]",correctOption: "x^2-x-56",incorrectOptions:["x^2+10x+21","x^2-5x","x^2+5x+4"]},

{equation: "\\[ {(x-6)(x-5)=?}\\]",correctOption: "x^2-11x+30",incorrectOptions:["x^2-2x-8","x^2+14x+49","x^2+3x-28"]},

{equation: "\\[ {(x-10)(x+8)=?}\\]",correctOption: "x^2-2x-80",incorrectOptions:["x^2+3x-18","x^2-14x+48","x^2+2x-48"]},

{equation: "\\[ {(x-2)(x-6)=?}\\]",correctOption: "x^2-8x+12",incorrectOptions:["x^2-18x+81","x^2+2x-24","x^2-x-30"]},

{equation: "\\[ {(x+4)(x-7)=?}\\]",correctOption: "x^2-3x-28",incorrectOptions:["x^2-4x-5","x^2+10x+21","x^2+3x-10"]},

{equation: "\\[ {(x-10)(x-2)=?}\\]",correctOption: "x^2-12x+20",incorrectOptions:["x^2+3x-28","x^2+2x-15","x^2+5x-24"]},

{equation: "\\[ {(x-5)(x+5)=?}\\]",correctOption: "x^2-25",incorrectOptions:["x^2-4x-5","x^2+9x+18","x^2+5x+4"]},

{equation: "\\[ {(x+8)(x-7)=?}\\]",correctOption: "x^2+x-56",incorrectOptions:["x^2+9x+14","x^2-5x","x^2+10x+16"]},

{equation: "\\[ {(x+3)(x-9)=?}\\]",correctOption: "x^2-6x-27",incorrectOptions:["x^2+4x-32","x^2-2x","x^2+x-12"]},

{equation: "\\[ {(x-1)(x-9)=?}\\]",correctOption: "x^2-10x+9",incorrectOptions:["x^2+x-12","x^2+16x+64","x^2-13x+30"]},

{equation: "\\[ {(x-3)(x-7)=?}\\]",correctOption: "x^2-10x+21",incorrectOptions:["x^2+x-2","x^2-11x+24","x^2-7x+10"]},

{equation: "\\[ {(x+1)(x-8)=?}\\]",correctOption: "x^2-7x-8",incorrectOptions:["x^2+13x+42","x^2+x-56","x^2-9x-10"]},

{equation: "\\[ {(x+5)(x+7)=?}\\]",correctOption: "x^2+12x+35",incorrectOptions:["x^2+2x-15","x^2-2x-35","x^2-10x+25"]},

{equation: "\\[ {(x+1)(x+1)=?}\\]",correctOption: "x^2+2x+1",incorrectOptions:["x^2+9x+14","x^2-2x-80","x^2+8x+15"]},

{equation: "\\[ {(x-5)(x+4)=?}\\]",correctOption: "x^2-x-20",incorrectOptions:["x^2-12x+27","x^2+8x+7","x^2-13x+36"]},

{equation: "\\[ {(x+8)(x+4)=?}\\]",correctOption: "x^2+12x+32",incorrectOptions:["x^2-x-12","x^2-4x+3","x^2-x-42"]},

{equation: "\\[ {(x+6)(x-3)=?}\\]",correctOption: "x^2+3x-18",incorrectOptions:["x^2-8x-20","x^2+9x+18","x^2+11x+30"]},

{equation: "\\[ {(x+7)(x+5)=?}\\]",correctOption: "x^2+12x+35",incorrectOptions:["x^2-12x+20","x^2-8x","x^2-x-20"]},

{equation: "\\[ {(x+6)(x+3)=?}\\]",correctOption: "x^2+9x+18",incorrectOptions:["x^2-x-42","x^2-3x-40","x^2+7x-8"]},

{equation: "\\[ {(x+8)(x-10)=?}\\]",correctOption: "x^2-2x-80",incorrectOptions:["x^2+3x-18","x^2-9x+20","x^2+3x-40"]},

{equation: "\\[ {(x-10)(x-3)=?}\\]",correctOption: "x^2-13x+30",incorrectOptions:["x^2+9x+18","x^2+x-56","x^2-9"]},

{equation: "\\[ {(x+7)(x+2)=?}\\]",correctOption: "x^2+9x+14",incorrectOptions:["x^2-9x+20","x^2-12x+32","x^2+10x+24"]},

{equation: "\\[ {(x+3)(x+5)=?}\\]",correctOption: "x^2+8x+15",incorrectOptions:["x^2-x-42","x^2-18x+81","x^2+2x-48"]},

{equation: "\\[ {(x+2)(x-2)=?}\\]",correctOption: "x^2-4",incorrectOptions:["x^2+6x+8","x^2+2x-35","x^2+5x+6"]},

{equation: "\\[ {(x+2)(x-2)=?}\\]",correctOption: "x^2-4",incorrectOptions:["x^2+5x+6","x^2-2x-80","x^2-6x+9"]},

{equation: "\\[ {(x-6)(x-10)=?}\\]",correctOption: "x^2-16x+60",incorrectOptions:["x^2+7x+6","x^2-15x+54","x^2-x-42"]},

{equation: "\\[ {(x-10)(x-9)=?}\\]",correctOption: "x^2-19x+90",incorrectOptions:["x^2-4x-21","x^2-11x+30","x^2+2x-24"]},
{equation: "\\[ {(x+3)(x+2)=?}\\]",correctOption: "x^2+5x+6",incorrectOptions:["x^2-x-42","x^2-11x+24","x^2-5x+4"]},

{equation: "\\[ {(x-7)(x+7)=?}\\]",correctOption: "x^2-49",incorrectOptions:["x^2-11x+30","x^2-4x+3","x^2-x-30"]},

{equation: "\\[ {(x+6)(x-3)=?}\\]",correctOption: "x^2+3x-18",incorrectOptions:["x^2+6x+9","x^2-14x+40","x^2-7x-30"]},

{equation: "\\[ {(x-6)(x-8)=?}\\]",correctOption: "x^2-14x+48",incorrectOptions:["x^2-2x","x^2-10x+16","x^2-x-6"]},

{equation: "\\[ {(x-9)(x+8)=?}\\]",correctOption: "x^2-x-72",incorrectOptions:["x^2+6x","x^2+7x-8","x^2+14x+49"]},

{equation: "\\[ {(x-1)(x-6)=?}\\]",correctOption: "x^2-7x+6",incorrectOptions:["x^2-5x-50","x^2-3x-28","x^2+2x-35"]},

{equation: "\\[ {(x-1)(x-6)=?}\\]",correctOption: "x^2-7x+6",incorrectOptions:["x^2+9x+14","x^2-16x+60","x^2-8x-20"]},

{equation: "\\[ {(x+1)(x-2)=?}\\]",correctOption: "x^2-x-2",incorrectOptions:["x^2-4x-45","x^2-5x-36","x^2+x-30"]},

{equation: "\\[ {(x+2)(x+5)=?}\\]",correctOption: "x^2+7x+10",incorrectOptions:["x^2-9x+20","x^2-20x+100","x^2-8x-20"]},

{equation: "\\[ {(x-5)(x-6)=?}\\]",correctOption: "x^2-11x+30",incorrectOptions:["x^2+4x-5","x^2+3x-28","x^2-10x+21"]},

{equation: "\\[ {(x-2)(x+6)=?}\\]",correctOption: "x^2+4x-12",incorrectOptions:["x^2+6x+8","x^2+x-56","x^2-7x+12"]},

{equation: "\\[ {(x+7)(x-2)=?}\\]",correctOption: "x^2+5x-14",incorrectOptions:["x^2+14x+48","x^2-19x+90","x^2+7x+10"]},

{equation: "\\[ {(x-8)(x+6)=?}\\]",correctOption: "x^2-2x-48",incorrectOptions:["x^2+x-20","x^2-12x+35","x^2-25"]},

{equation: "\\[ {(x+1)(x+7)=?}\\]",correctOption: "x^2+8x+7",incorrectOptions:["x^2-11x+28","x^2-6x+8","x^2-9x"]},

{equation: "\\[ {(x-6)(x-1)=?}\\]",correctOption: "x^2-7x+6",incorrectOptions:["x^2-9x+20","x^2-13x+30","x^2-9x-10"]},

{equation: "\\[ {(x+1)(x+4)=?}\\]",correctOption: "x^2+5x+4",incorrectOptions:["x^2-14x+45","x^2-7x+6","x^2-9"]},

{equation: "\\[ {(x+6)(x-1)=?}\\]",correctOption: "x^2+5x-6",incorrectOptions:["x^2+10x+24","x^2-16x+60","x^2-10x"]},

{equation: "\\[ {(x-9)(x+5)=?}\\]",correctOption: "x^2-4x-45",incorrectOptions:["x^2-x-56","x^2+2x-15","x^2-9x+14"]},

{equation: "\\[ {(x-5)(x-2)=?}\\]",correctOption: "x^2-7x+10",incorrectOptions:["x^2+4x-21","x^2+14x+48","x^2-64"]},

{equation: "\\[ {(x+7)(x+8)=?}\\]",correctOption: "x^2+15x+56",incorrectOptions:["x^2+5x-6","x^2+2x-24","x^2-64"]},

{equation: "\\[ {(x-5)(x-2)=?}\\]",correctOption: "x^2-7x+10",incorrectOptions:["x^2-2x-80","x^2+7x+6","x^2+2x-35"]},

{equation: "\\[ {(x-9)(x+7)=?}\\]",correctOption: "x^2-2x-63",incorrectOptions:["x^2+6x","x^2-7x+12","x^2-4x"]},

{equation: "\\[ {(x-1)(x-4)=?}\\]",correctOption: "x^2-5x+4",incorrectOptions:["x^2-36","x^2-15x+54","x^2-7x+6"]},

{equation: "\\[ {(x+1)(x-3)=?}\\]",correctOption: "x^2-2x-3",incorrectOptions:["x^2+2x-15","x^2-10x+9","x^2-8x+7"]},

{equation: "\\[ {(x-4)(x-8)=?}\\]",correctOption: "x^2-12x+32",incorrectOptions:["x^2+9x+14","x^2-4x-21","x^2-5x-24"]},

{equation: "\\[ {(x+4)(x-9)=?}\\]",correctOption: "x^2-5x-36",incorrectOptions:["x^2-14x+45","x^2+13x+40","x^2+5x+6"]},

{equation: "\\[ {(x-3)(x-6)=?}\\]",correctOption: "x^2-9x+18",incorrectOptions:["x^2-13x+30","x^2-16x+63","x^2-10x+9"]},

{equation: "\\[ {(x-2)(x-1)=?}\\]",correctOption: "x^2-3x+2",incorrectOptions:["x^2-5x-14","x^2-10x","x^2-2x-35"]},

{equation: "\\[ {(x-3)(x-7)=?}\\]",correctOption: "x^2-10x+21",incorrectOptions:["x^2+5x-6","x^2-7x","x^2+x-12"]},

{equation: "\\[ {(x+5)(x+3)=?}\\]",correctOption: "x^2+8x+15",incorrectOptions:["x^2-6x","x^2-18x+81","x^2-25"]},


]



const 线性代数01行列式求值 = [


{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}2&2\\\\-9&-3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(2,2); B(-9,-3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "12",incorrectOptions:["-19","-14","8"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-6&5\\\\-8&-4\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-6,5); B(-8,-4)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "64",incorrectOptions:["-2","-8","18"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-1&1\\\\8&-3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-1,1); B(8,-3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-5",incorrectOptions:["6","15","9"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}4&-2\\\\-10&-7\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(4,-2); B(-10,-7)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-48",incorrectOptions:["-3","-4","10"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-9&-6\\\\1&-9\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-9,-6); B(1,-9)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "87",incorrectOptions:["-7","-3","6"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-6&-10\\\\3&6\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-6,-10); B(3,6)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-6",incorrectOptions:["4","-13","-10"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}7&-7\\\\-9&-2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(7,-7); B(-9,-2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-77",incorrectOptions:["-6","-17","-9"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-5&-2\\\\5&2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-5,-2); B(5,2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "0",incorrectOptions:["1","7","-15"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}1&6\\\\-6&-3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(1,6); B(-6,-3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "33",incorrectOptions:["-14","16","11"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&-2\\\\-6&-1\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,-2); B(-6,-1)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-4",incorrectOptions:["-15","-11","-18"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-7&3\\\\-5&7\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-7,3); B(-5,7)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-34",incorrectOptions:["-13","-15","-3"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&8\\\\0&8\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,8); B(0,8)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-64",incorrectOptions:["13","17","9"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}5&3\\\\-1&-2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(5,3); B(-1,-2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-7",incorrectOptions:["-6","-3","7"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-2&-1\\\\5&3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-2,-1); B(5,3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-1",incorrectOptions:["-16","6","2"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}3&-6\\\\0&-3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(3,-6); B(0,-3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-9",incorrectOptions:["-18","1","-2"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}4&5\\\\-9&-4\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(4,5); B(-9,-4)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "29",incorrectOptions:["-10","-8","-15"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&-4\\\\7&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,-4); B(7,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "28",incorrectOptions:["-16","-14","-8"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-1&2\\\\4&-6\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-1,2); B(4,-6)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-2",incorrectOptions:["-7","-1","4"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-9&-2\\\\6&-4\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-9,-2); B(6,-4)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "48",incorrectOptions:["-2","-16","-1"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-9&-9\\\\7&8\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-9,-9); B(7,8)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-9",incorrectOptions:["7","6","10"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}8&-9\\\\4&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(8,-9); B(4,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "36",incorrectOptions:["12","-6","-2"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&-7\\\\0&6\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,-7); B(0,6)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-48",incorrectOptions:["-18","-14","13"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}8&4\\\\-3&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(8,4); B(-3,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "12",incorrectOptions:["17","-4","10"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}6&5\\\\4&-1\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(6,5); B(4,-1)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-26",incorrectOptions:["6","7","-14"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&-9\\\\-1&8\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,-9); B(-1,8)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-73",incorrectOptions:["-8","1","5"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-10&7\\\\6&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-10,7); B(6,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-42",incorrectOptions:["4","-4","-18"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}0&4\\\\-5&-2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(0,4); B(-5,-2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "20",incorrectOptions:["-7","19","-5"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-9&-5\\\\6&-2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-9,-5); B(6,-2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "48",incorrectOptions:["-4","-13","-9"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}8&6\\\\-2&4\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(8,6); B(-2,4)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "44",incorrectOptions:["-9","8","4"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-7&-2\\\\3&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-7,-2); B(3,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "6",incorrectOptions:["2","-13","-12"]},
{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}4&7\\\\-1&-4\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(4,7); B(-1,-4)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-9",incorrectOptions:["2","-15","-4"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}3&2\\\\-4&-8\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(3,2); B(-4,-8)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-16",incorrectOptions:["19","-9","-12"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-4&-7\\\\-7&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-4,-7); B(-7,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-49",incorrectOptions:["-5","10","17"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-1&8\\\\-4&3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-1,8); B(-4,3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "29",incorrectOptions:["6","-1","-10"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}1&4\\\\-3&8\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(1,4); B(-3,8)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "20",incorrectOptions:["2","-5","15"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}5&-5\\\\-1&-5\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(5,-5); B(-1,-5)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-30",incorrectOptions:["17","-13","-15"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}0&3\\\\-4&2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(0,3); B(-4,2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "12",incorrectOptions:["-4","11","17"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-3&6\\\\-4&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-3,6); B(-4,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "24",incorrectOptions:["-6","-4","3"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&-6\\\\8&-4\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,-6); B(8,-4)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "80",incorrectOptions:["6","18","-1"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&4\\\\6&7\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,4); B(6,7)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-80",incorrectOptions:["-6","-4","2"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}2&2\\\\-4&0\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(2,2); B(-4,0)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "8",incorrectOptions:["-2","12","-16"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}6&6\\\\-7&-7\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(6,6); B(-7,-7)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "0",incorrectOptions:["19","6","10"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}6&3\\\\-3&-3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(6,3); B(-3,-3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-9",incorrectOptions:["15","10","14"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}6&6\\\\-3&3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(6,6); B(-3,3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "36",incorrectOptions:["17","-19","0"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-2&-1\\\\5&5\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-2,-1); B(5,5)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-5",incorrectOptions:["-1","7","-9"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}3&-8\\\\-10&-2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(3,-8); B(-10,-2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-86",incorrectOptions:["10","1","7"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-6&-8\\\\5&1\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-6,-8); B(5,1)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "34",incorrectOptions:["9","-11","-10"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-4&-10\\\\6&3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-4,-10); B(6,3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "48",incorrectOptions:["-19","-14","1"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-6&-9\\\\0&-3\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-6,-9); B(0,-3)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "18",incorrectOptions:["-4","-6","-17"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}2&-10\\\\4&2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(2,-10); B(4,2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "44",incorrectOptions:["11","-5","-19"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}2&-2\\\\7&-5\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(2,-2); B(7,-5)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "4",incorrectOptions:["-10","6","9"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}7&-8\\\\3&-7\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(7,-8); B(3,-7)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-25",incorrectOptions:["11","-2","-11"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-8&1\\\\0&-1\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-8,1); B(0,-1)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "8",incorrectOptions:["2","9","12"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-10&-8\\\\2&-2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-10,-8); B(2,-2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "36",incorrectOptions:["2","-7","-16"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-4&6\\\\-5&-4\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-4,6); B(-5,-4)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "46",incorrectOptions:["-6","17","6"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}3&6\\\\-9&7\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(3,6); B(-9,7)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "75",incorrectOptions:["13","-19","5"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-5&-5\\\\3&2\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-5,-5); B(3,2)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "5",incorrectOptions:["14","-9","-13"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}1&2\\\\7&6\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(1,2); B(7,6)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-8",incorrectOptions:["10","7","5"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}2&6\\\\7&-8\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(2,6); B(7,-8)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "-58",incorrectOptions:["-2","13","6"]},

{equation: "\\begin{gather}行列式是代数的关键; \\\\ \\begin{vmatrix}x_1&y_1\\\\x_2&y_2\\end{vmatrix} =x_1 \\times y_2- y_1\\times x_2 \\\\ \\begin{vmatrix}-7&8\\\\-8&-1\\end{vmatrix} =? \\\\在坐标系中画出O(0,0);A(-7,8); B(-8,-1)。 \\\\三角形面积S△OAB\\times2=? \\end{gather}",correctOption: "71",incorrectOptions:["16","5","-7"]},



]




const 直角坐标系运算02两点求斜率 = [
{equation: "\\begin{gather}直角坐标系中有两点A(8,-1)、B(-7,4)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{3}",incorrectOptions:["1","-1","-3"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,2)、B(1,-9)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{11}{7}",incorrectOptions:["-\\frac{3}{2}","\\frac{1}{5}","-\\frac{2}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,-2)、B(-5,-7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{5}{4}",incorrectOptions:["\\frac{1}{4}","-2","\\frac{3}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,-4)、B(-5,3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{7}{9}",incorrectOptions:["\\frac{1}{6}","-\\frac{8}{7}","\\frac{1}{9}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,-8)、B(6,-3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{5}{11}",incorrectOptions:["\\frac{1}{8}","-\\frac{5}{2}","-1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,-2)、B(0,7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{9}{7}",incorrectOptions:["-\\frac{5}{3}","-\\frac{3}{2}","\\frac{1}{8}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,3)、B(1,-3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{6}{5}",incorrectOptions:["\\frac{3}{5}","-\\frac{1}{7}","\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,-3)、B(-7,-9)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{6}{11}",incorrectOptions:["-\\frac{3}{10}","4","\\frac{3}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,-7)、B(2,7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "14",incorrectOptions:["1","\\frac{8}{5}","\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-8,-3)、B(7,-3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "0",incorrectOptions:["\\frac{5}{3}","-\\frac{1}{6}","-1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,4)、B(2,7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{2}",incorrectOptions:["\\frac{4}{7}","\\frac{7}{4}","\\frac{4}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,7)、B(1,7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "0",incorrectOptions:["8","-\\frac{1}{8}","\\frac{8}{9}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(5,-5)、B(-10,2)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{7}{15}",incorrectOptions:["\\frac{1}{2}","\\frac{9}{5}","-1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,3)、B(4,-5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{8}{11}",incorrectOptions:["-\\frac{2}{3}","1","-\\frac{5}{9}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,-6)、B(8,-9)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{3}{11}",incorrectOptions:["\\frac{7}{2}","1","\\frac{3}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,5)、B(1,-7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{12}{5}",incorrectOptions:["2","\\frac{2}{5}","-\\frac{8}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,7)、B(-6,-3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{10}{7}",incorrectOptions:["-\\frac{1}{4}","\\frac{8}{3}","-\\frac{3}{7}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-6,-3)、B(-10,6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{9}{4}",incorrectOptions:["5","4","\\frac{1}{7}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,2)、B(8,5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{3}{10}",incorrectOptions:["-\\frac{1}{4}","\\frac{7}{4}","-\\frac{2}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,-1)、B(3,-5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-1",incorrectOptions:["-2","\\frac{3}{2}","-\\frac{5}{6}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,1)、B(-8,4)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{3}{2}",incorrectOptions:["-7","\\frac{3}{5}","-\\frac{4}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,7)、B(-6,6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{1}{2}",incorrectOptions:["0","\\frac{7}{4}","-\\frac{8}{7}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-1)、B(3,7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{8}{5}",incorrectOptions:["-\\frac{5}{2}","\\frac{2}{5}","-\\frac{4}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,-6)、B(-1,0)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "1",incorrectOptions:["-\\frac{7}{9}","0","-\\frac{7}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-7)、B(2,-6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{1}{4}",incorrectOptions:["6","\\frac{6}{5}","\\frac{1}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,-9)、B(-2,1)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-1",incorrectOptions:["7","\\frac{9}{7}","0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,1)、B(-6,3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{6}",incorrectOptions:["\\frac{1}{2}","0","\\frac{7}{4}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,7)、B(-2,6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{2}",incorrectOptions:["-\\frac{1}{3}","1","-5"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-2)、B(8,-5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{3}{8}",incorrectOptions:["-1","-1","\\frac{7}{9}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,3)、B(3,-4)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{7}{6}",incorrectOptions:["2","\\frac{7}{5}","-\\frac{6}{5}"]},
{equation: "\\begin{gather}直角坐标系中有两点A(7,-5)、B(-7,5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{5}{7}",incorrectOptions:["\\frac{5}{7}","-\\frac{1}{9}","-\\frac{7}{8}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,-1)、B(-1,7)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-2",incorrectOptions:["-\\frac{4}{5}","-\\frac{4}{9}","-\\frac{2}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,-10)、B(-5,-6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{3}",incorrectOptions:["\\frac{7}{2}","-\\frac{1}{4}","7"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,-10)、B(1,-8)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{2}{11}",incorrectOptions:["-1","-\\frac{4}{9}","6"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,3)、B(-3,2)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{2}",incorrectOptions:["\\frac{5}{4}","-1","-3"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-6,-8)、B(-5,-10)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-2",incorrectOptions:["3","5","-3"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-8,-7)、B(-6,0)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{7}{2}",incorrectOptions:["-\\frac{3}{2}","\\frac{3}{2}","\\frac{1}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(2,6)、B(5,-3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-3",incorrectOptions:["-\\frac{4}{3}","8","\\frac{8}{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(5,7)、B(-4,-10)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{17}{9}",incorrectOptions:["-\\frac{5}{6}","-\\frac{3}{4}","-\\frac{5}{4}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,-9)、B(-2,-6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{3}{8}",incorrectOptions:["\\frac{4}{3}","-\\frac{1}{2}","\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,-5)、B(-8,-2)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{3}{5}",incorrectOptions:["-\\frac{3}{4}","-\\frac{8}{5}","-8"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,-9)、B(-4,-3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{2}",incorrectOptions:["-\\frac{5}{7}","5","1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,8)、B(3,2)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-3",incorrectOptions:["-4","\\frac{1}{2}","\\frac{3}{8}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,7)、B(6,-4)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{11}{13}",incorrectOptions:["\\frac{2}{5}","-\\frac{1}{7}","-2"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,-6)、B(-9,-1)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{5}{8}",incorrectOptions:["\\frac{1}{3}","-\\frac{3}{2}","\\frac{1}{10}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,8)、B(-4,-6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{7}{3}",incorrectOptions:["\\frac{3}{5}","\\frac{2}{3}","\\frac{7}{4}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,2)、B(-8,-8)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{5}{3}",incorrectOptions:["-\\frac{2}{5}","\\frac{2}{7}","\\frac{4}{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,1)、B(-9,5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{2}{3}",incorrectOptions:["-\\frac{8}{7}","0","-\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,7)、B(-6,1)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{3}{5}",incorrectOptions:["\\frac{4}{5}","-\\frac{4}{3}","\\frac{1}{4}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-6)、B(-5,8)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{14}{5}",incorrectOptions:["1","-\\frac{7}{5}","-\\frac{1}{8}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,-5)、B(-10,-9)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{4}{17}",incorrectOptions:["0","-1","3"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,8)、B(-10,8)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "0",incorrectOptions:["-\\frac{1}{2}","\\frac{4}{7}","1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,-1)、B(-3,6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{7}{9}",incorrectOptions:["\\frac{3}{2}","\\frac{10}{3}","-1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(5,-8)、B(-8,-6)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{2}{13}",incorrectOptions:["\\frac{3}{5}","5","-1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,4)、B(-5,8)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{2}{3}",incorrectOptions:["-\\frac{3}{8}","2","\\frac{3}{4}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-6,7)、B(8,5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{1}{7}",incorrectOptions:["1","-\\frac{4}{5}","0"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,-9)、B(6,-4)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{5}{3}",incorrectOptions:["-\\frac{7}{2}","\\frac{3}{7}","\\frac{1}{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,2)、B(-2,-5)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{7}{3}",incorrectOptions:["-\\frac{3}{4}","-6","1"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,-6)、B(-3,1)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "-\\frac{7}{2}",incorrectOptions:["\\frac{3}{7}","\\frac{1}{3}","\\frac{6}{7}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-9,-2)、B(8,3)\\textup{;}\\\\则直线AB的斜率=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\frac{5}{17}",incorrectOptions:["-\\frac{3}{4}","-\\frac{4}{3}","0"]},


]

const 直角坐标系运算01两点距离 = [
{equation: "\\begin{gather}直角坐标系中有两点A(-10,-2)、B(7,-1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{290}",incorrectOptions:["\\sqrt{19}","\\sqrt{3}","2"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,-3)、B(-1,-4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "1",incorrectOptions:["3\\sqrt{2}","\\sqrt{97}","3\\sqrt{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-9,3)、B(5,3)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "14",incorrectOptions:["3\\sqrt{13}","\\sqrt{119}","\\sqrt{14}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-2)、B(2,-4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{2}",incorrectOptions:["\\sqrt{2}","\\sqrt{83}","\\sqrt{91}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-9,6)、B(-8,8)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{5}",incorrectOptions:["\\sqrt{13}","\\sqrt{115}","7\\sqrt{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,-7)、B(-7,7)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{65}",incorrectOptions:["5\\sqrt{3}","\\sqrt{10}","\\sqrt{74}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,0)、B(-9,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{65}",incorrectOptions:["2\\sqrt{2}","\\sqrt{102}","3\\sqrt{13}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,-4)、B(1,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "5\\sqrt{2}",incorrectOptions:["\\sqrt{95}","3","\\sqrt{31}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(5,2)、B(-9,-3)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{221}",incorrectOptions:["2\\sqrt{23}","\\sqrt{35}","\\sqrt{114}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,4)、B(-4,4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "1",incorrectOptions:["2\\sqrt{29}","\\sqrt{61}","2\\sqrt{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-1)、B(-4,-7)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{10}",incorrectOptions:["\\sqrt{17}","3\\sqrt{10}","3"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,-1)、B(8,-4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "3\\sqrt{26}",incorrectOptions:["\\sqrt{95}","\\sqrt{86}","4\\sqrt{5}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,2)、B(0,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{101}",incorrectOptions:["\\sqrt{5}","\\sqrt{74}","\\sqrt{46}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,2)、B(2,-8)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{29}",incorrectOptions:["\\sqrt{85}","\\sqrt{114}","\\sqrt{95}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,-8)、B(-6,7)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{394}",incorrectOptions:["3\\sqrt{13}","\\sqrt{37}","\\sqrt{106}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,0)、B(7,-7)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{149}",incorrectOptions:["\\sqrt{79}","3\\sqrt{5}","\\sqrt{66}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(0,-9)、B(-3,-1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{73}",incorrectOptions:["\\sqrt{82}","\\sqrt{65}","\\sqrt{14}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,0)、B(8,-7)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{193}",incorrectOptions:["\\sqrt{87}","\\sqrt{79}","\\sqrt{93}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(6,-3)、B(6,-4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "1",incorrectOptions:["\\sqrt{30}","\\sqrt{79}","2\\sqrt{22}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,-2)、B(-3,2)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{65}",incorrectOptions:["3\\sqrt{2}","2\\sqrt{14}","\\sqrt{101}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,-2)、B(4,-3)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "1",incorrectOptions:["\\sqrt{106}","\\sqrt{93}","5\\sqrt{3}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,3)、B(-7,-1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "5",incorrectOptions:["2\\sqrt{3}","3\\sqrt{10}","2\\sqrt{14}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,-2)、B(-10,4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "6\\sqrt{2}",incorrectOptions:["\\sqrt{93}","\\sqrt{14}","\\sqrt{47}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,-9)、B(3,6)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "5\\sqrt{13}",incorrectOptions:["\\sqrt{70}","\\sqrt{74}","\\sqrt{23}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,2)、B(-1,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{37}",incorrectOptions:["4\\sqrt{3}","3\\sqrt{11}","\\sqrt{87}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-5,-9)、B(2,-5)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{65}",incorrectOptions:["\\sqrt{29}","2\\sqrt{10}","\\sqrt{74}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,6)、B(-7,4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{5}",incorrectOptions:["5\\sqrt{2}","3\\sqrt{7}","\\sqrt{38}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,-4)、B(6,3)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "5\\sqrt{2}",incorrectOptions:["\\sqrt{83}","3\\sqrt{3}","\\sqrt{69}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-6,-9)、B(-2,0)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{97}",incorrectOptions:["\\sqrt{41}","2","6\\sqrt{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,3)、B(-5,4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{65}",incorrectOptions:["9","\\sqrt{78}","\\sqrt{58}"]},
{equation: "\\begin{gather}直角坐标系中有两点A(6,0)、B(-7,-6)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{205}",incorrectOptions:["\\sqrt{95}","\\sqrt{71}","9"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,3)、B(-2,0)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{73}",incorrectOptions:["\\sqrt{35}","3","\\sqrt{19}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,-2)、B(-7,-9)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{58}",incorrectOptions:["\\sqrt{33}","\\sqrt{106}","4"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-1,-1)、B(1,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{2}",incorrectOptions:["2\\sqrt{5}","\\sqrt{87}","\\sqrt{51}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,-1)、B(-10,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{53}",incorrectOptions:["\\sqrt{30}","7","\\sqrt{118}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(5,-9)、B(7,6)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{229}",incorrectOptions:["3\\sqrt{10}","\\sqrt{51}","10"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-9,-7)、B(-6,-5)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{13}",incorrectOptions:["\\sqrt{21}","\\sqrt{33}","\\sqrt{77}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-4,2)、B(8,-10)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "12\\sqrt{2}",incorrectOptions:["\\sqrt{94}","\\sqrt{87}","2\\sqrt{15}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,-1)、B(-10,-6)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{314}",incorrectOptions:["\\sqrt{42}","4\\sqrt{5}","\\sqrt{39}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,4)、B(1,5)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{65}",incorrectOptions:["\\sqrt{94}","\\sqrt{118}","\\sqrt{7}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-6)、B(0,-7)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{5}",incorrectOptions:["\\sqrt{74}","\\sqrt{21}","\\sqrt{94}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-3,2)、B(4,5)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{58}",incorrectOptions:["\\sqrt{86}","\\sqrt{71}","2\\sqrt{15}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(3,-1)、B(6,5)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "3\\sqrt{5}",incorrectOptions:["\\sqrt{115}","\\sqrt{41}","2"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-10,-3)、B(-6,2)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{41}",incorrectOptions:["2\\sqrt{19}","2\\sqrt{10}","4"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-1)、B(-1,7)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{65}",incorrectOptions:["\\sqrt{53}","3\\sqrt{2}","\\sqrt{26}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,0)、B(-3,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{2}",incorrectOptions:["\\sqrt{55}","\\sqrt{38}","\\sqrt{14}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,0)、B(-5,-6)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "6\\sqrt{2}",incorrectOptions:["\\sqrt{97}","2\\sqrt{22}","\\sqrt{19}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,3)、B(1,4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "5\\sqrt{2}",incorrectOptions:["\\sqrt{6}","\\sqrt{5}","3"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,-6)、B(0,-1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{41}",incorrectOptions:["\\sqrt{5}","\\sqrt{2}","3\\sqrt{11}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-3)、B(-1,-4)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{2}",incorrectOptions:["0","2\\sqrt{5}","\\sqrt{105}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(2,-1)、B(4,-3)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{2}",incorrectOptions:["2\\sqrt{26}","2\\sqrt{7}","\\sqrt{101}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(8,5)、B(-9,-9)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{485}",incorrectOptions:["\\sqrt{77}","\\sqrt{119}","4\\sqrt{2}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,2)、B(8,8)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{37}",incorrectOptions:["\\sqrt{11}","\\sqrt{89}","2\\sqrt{19}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-2,-1)、B(-10,-10)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{145}",incorrectOptions:["\\sqrt{57}","\\sqrt{91}","\\sqrt{70}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(4,-7)、B(-9,2)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "5\\sqrt{10}",incorrectOptions:["\\sqrt{105}","8","\\sqrt{30}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,7)、B(8,-3)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{149}",incorrectOptions:["\\sqrt{14}","\\sqrt{47}","\\sqrt{115}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(-7,-5)、B(-7,-8)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "3",incorrectOptions:["\\sqrt{46}","\\sqrt{15}","\\sqrt{114}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(7,-10)、B(-9,-9)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{257}",incorrectOptions:["\\sqrt{37}","7\\sqrt{2}","\\sqrt{97}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,4)、B(6,3)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "\\sqrt{26}",incorrectOptions:["2\\sqrt{3}","2\\sqrt{5}","\\sqrt{46}"]},

{equation: "\\begin{gather}直角坐标系中有两点A(1,5)、B(3,1)\\textup{;}\\\\则AB的距离=\\textup{?}\\\\画出直角坐标系及相关点线再计算。\\end{gather}",correctOption: "2\\sqrt{5}",incorrectOptions:["\\sqrt{69}","3\\sqrt{10}","\\sqrt{95}"]},



]



 const 根式运算01简单有理化 = [
{equation: "\\[{\\sqrt{14}=?}\\]",correctOption: "\\sqrt{14}",incorrectOptions:["\\sqrt{7}","2\\sqrt{14}","3\\sqrt{2}"]},

{equation: "\\[{\\sqrt{56}=?}\\]",correctOption: "2\\sqrt{14}",incorrectOptions:["2\\sqrt{33}","\\sqrt{14}","\\sqrt{6}"]},

{equation: "\\[{\\sqrt{18}=?}\\]",correctOption: "3\\sqrt{2}",incorrectOptions:["\\sqrt{66}","2\\sqrt{14}","\\sqrt{30}"]},

{equation: "\\[{\\sqrt{60}=?}\\]",correctOption: "2\\sqrt{15}",incorrectOptions:["2\\sqrt{7}","3\\sqrt{7}","3\\sqrt{6}"]},

{equation: "\\[{\\sqrt{64}=?}\\]",correctOption: "8",incorrectOptions:["2\\sqrt{14}","5","2\\sqrt{6}"]},

{equation: "\\[{\\sqrt{60}=?}\\]",correctOption: "2\\sqrt{15}",incorrectOptions:["\\sqrt{182}","\\sqrt{30}","\\sqrt{42}"]},

{equation: "\\[{\\sqrt{20}=?}\\]",correctOption: "2\\sqrt{5}",incorrectOptions:["5\\sqrt{3}","\\sqrt{5}","6\\sqrt{2}"]},

{equation: "\\[{\\sqrt{54}=?}\\]",correctOption: "3\\sqrt{6}",incorrectOptions:["\\sqrt{130}","2\\sqrt{42}","\\sqrt{6}"]},

{equation: "\\[{\\sqrt{32}=?}\\]",correctOption: "4\\sqrt{2}",incorrectOptions:["2\\sqrt{15}","4\\sqrt{7}","3\\sqrt{10}"]},

{equation: "\\[{\\sqrt{28}=?}\\]",correctOption: "2\\sqrt{7}",incorrectOptions:["2\\sqrt{14}","\\sqrt{105}","2\\sqrt{3}"]},

{equation: "\\[{\\sqrt{80}=?}\\]",correctOption: "4\\sqrt{5}",incorrectOptions:["\\sqrt{15}","\\sqrt{39}","2\\sqrt{2}"]},

{equation: "\\[{\\sqrt{56}=?}\\]",correctOption: "2\\sqrt{14}",incorrectOptions:["2","\\sqrt{22}","5\\sqrt{2}"]},

{equation: "\\[{\\sqrt{24}=?}\\]",correctOption: "2\\sqrt{6}",incorrectOptions:["10","2\\sqrt{7}","2\\sqrt{14}"]},

{equation: "\\[{\\sqrt{16}=?}\\]",correctOption: "4",incorrectOptions:["\\sqrt{30}","\\sqrt{5}","\\sqrt{2}"]},

{equation: "\\[{\\sqrt{24}=?}\\]",correctOption: "2\\sqrt{6}",incorrectOptions:["2\\sqrt{3}","2\\sqrt{39}","\\sqrt{21}"]},

{equation: "\\[{\\sqrt{24}=?}\\]",correctOption: "2\\sqrt{6}",incorrectOptions:["\\sqrt{10}","\\sqrt{30}","4"]},

{equation: "\\[{\\sqrt{48}=?}\\]",correctOption: "4\\sqrt{3}",incorrectOptions:["2\\sqrt{30}","\\sqrt{105}","3\\sqrt{10}"]},

{equation: "\\[{\\sqrt{8}=?}\\]",correctOption: "2\\sqrt{2}",incorrectOptions:["3\\sqrt{5}","2\\sqrt{21}","\\sqrt{15}"]},

{equation: "\\[{\\sqrt{30}=?}\\]",correctOption: "\\sqrt{30}",incorrectOptions:["\\sqrt{42}","2","10"]},

{equation: "\\[{\\sqrt{18}=?}\\]",correctOption: "3\\sqrt{2}",incorrectOptions:["2\\sqrt{10}","3\\sqrt{11}","\\sqrt{15}"]},

{equation: "\\[{\\sqrt{16}=?}\\]",correctOption: "4",incorrectOptions:["\\sqrt{6}","\\sqrt{110}","6"]},

{equation: "\\[{\\sqrt{70}=?}\\]",correctOption: "\\sqrt{70}",incorrectOptions:["\\sqrt{165}","\\sqrt{35}","\\sqrt{10}"]},

{equation: "\\[{\\sqrt{42}=?}\\]",correctOption: "\\sqrt{42}",incorrectOptions:["2\\sqrt{14}","\\sqrt{154}","2\\sqrt{5}"]},

{equation: "\\[{\\sqrt{36}=?}\\]",correctOption: "6",incorrectOptions:["\\sqrt{30}","2\\sqrt{15}","2\\sqrt{10}"]},

{equation: "\\[{\\sqrt{48}=?}\\]",correctOption: "4\\sqrt{3}",incorrectOptions:["\\sqrt{10}","3\\sqrt{7}","\\sqrt{30}"]},

{equation: "\\[{\\sqrt{56}=?}\\]",correctOption: "2\\sqrt{14}",incorrectOptions:["4\\sqrt{7}","\\sqrt{33}","\\sqrt{2}"]},

{equation: "\\[{\\sqrt{28}=?}\\]",correctOption: "2\\sqrt{7}",incorrectOptions:["\\sqrt{66}","2\\sqrt{21}","\\sqrt{70}"]},

{equation: "\\[{\\sqrt{80}=?}\\]",correctOption: "4\\sqrt{5}",incorrectOptions:["2\\sqrt{26}","2\\sqrt{7}","3\\sqrt{2}"]},

{equation: "\\[{\\sqrt{18}=?}\\]",correctOption: "3\\sqrt{2}",incorrectOptions:["3\\sqrt{5}","2\\sqrt{6}","\\sqrt{5}"]},

{equation: "\\[{\\sqrt{10}=?}\\]",correctOption: "\\sqrt{10}",incorrectOptions:["8","\\sqrt{15}","3\\sqrt{7}"]},
{equation: "\\[{\\sqrt{6}=?}\\]",correctOption: "\\sqrt{6}",incorrectOptions:["6\\sqrt{2}","2","3\\sqrt{3}"]},

{equation: "\\[{\\sqrt{24}=?}\\]",correctOption: "2\\sqrt{6}",incorrectOptions:["2\\sqrt{33}","\\sqrt{22}","3"]},

{equation: "\\[{\\sqrt{10}=?}\\]",correctOption: "\\sqrt{10}",incorrectOptions:["2\\sqrt{3}","6\\sqrt{2}","4"]},

{equation: "\\[{\\sqrt{48}=?}\\]",correctOption: "4\\sqrt{3}",incorrectOptions:["2\\sqrt{3}","\\sqrt{65}","\\sqrt{70}"]},

{equation: "\\[{\\sqrt{80}=?}\\]",correctOption: "4\\sqrt{5}",incorrectOptions:["\\sqrt{26}","\\sqrt{105}","3\\sqrt{6}"]},

{equation: "\\[{\\sqrt{27}=?}\\]",correctOption: "3\\sqrt{3}",incorrectOptions:["\\sqrt{6}","2\\sqrt{14}","5"]},

{equation: "\\[{\\sqrt{22}=?}\\]",correctOption: "\\sqrt{22}",incorrectOptions:["6\\sqrt{3}","2\\sqrt{11}","2\\sqrt{15}"]},

{equation: "\\[{\\sqrt{27}=?}\\]",correctOption: "3\\sqrt{3}",incorrectOptions:["7\\sqrt{2}","2\\sqrt{39}","4\\sqrt{3}"]},

{equation: "\\[{\\sqrt{22}=?}\\]",correctOption: "\\sqrt{22}",incorrectOptions:["\\sqrt{7}","9","\\sqrt{14}"]},

{equation: "\\[{\\sqrt{24}=?}\\]",correctOption: "2\\sqrt{6}",incorrectOptions:["\\sqrt{210}","2\\sqrt{21}","3\\sqrt{2}"]},

{equation: "\\[{\\sqrt{72}=?}\\]",correctOption: "6\\sqrt{2}",incorrectOptions:["\\sqrt{6}","\\sqrt{195}","\\sqrt{30}"]},

{equation: "\\[{\\sqrt{56}=?}\\]",correctOption: "2\\sqrt{14}",incorrectOptions:["3\\sqrt{2}","2\\sqrt{7}","\\sqrt{6}"]},

{equation: "\\[{\\sqrt{8}=?}\\]",correctOption: "2\\sqrt{2}",incorrectOptions:["3\\sqrt{7}","4\\sqrt{5}","3\\sqrt{5}"]},

{equation: "\\[{\\sqrt{18}=?}\\]",correctOption: "3\\sqrt{2}",incorrectOptions:["\\sqrt{1}","2\\sqrt{3}","\\sqrt{10}"]},

{equation: "\\[{\\sqrt{36}=?}\\]",correctOption: "6",incorrectOptions:["\\sqrt{15}","3\\sqrt{10}","4\\sqrt{2}"]},

{equation: "\\[{\\sqrt{63}=?}\\]",correctOption: "3\\sqrt{7}",incorrectOptions:["\\sqrt{42}","4\\sqrt{2}","4\\sqrt{3}"]},

{equation: "\\[{\\sqrt{30}=?}\\]",correctOption: "\\sqrt{30}",incorrectOptions:["2\\sqrt{5}","2\\sqrt{42}","6"]},

{equation: "\\[{\\sqrt{42}=?}\\]",correctOption: "\\sqrt{42}",incorrectOptions:["\\sqrt{35}","2\\sqrt{15}","\\sqrt{10}"]},

{equation: "\\[{\\sqrt{48}=?}\\]",correctOption: "4\\sqrt{3}",incorrectOptions:["2\\sqrt{3}","\\sqrt{26}","\\sqrt{6}"]},

{equation: "\\[{\\sqrt{44}=?}\\]",correctOption: "2\\sqrt{11}",incorrectOptions:["\\sqrt{182}","2\\sqrt{30}","\\sqrt{14}"]},

{equation: "\\[{\\sqrt{36}=?}\\]",correctOption: "6",incorrectOptions:["\\sqrt{77}","3\\sqrt{2}","2\\sqrt{2}"]},

{equation: "\\[{\\sqrt{88}=?}\\]",correctOption: "2\\sqrt{22}",incorrectOptions:["\\sqrt{6}","3\\sqrt{5}","2\\sqrt{15}"]},

{equation: "\\[{\\sqrt{18}=?}\\]",correctOption: "3\\sqrt{2}",incorrectOptions:["6","\\sqrt{42}","4\\sqrt{3}"]},

{equation: "\\[{\\sqrt{54}=?}\\]",correctOption: "3\\sqrt{6}",incorrectOptions:["\\sqrt{35}","2\\sqrt{11}","2\\sqrt{15}"]},

{equation: "\\[{\\sqrt{16}=?}\\]",correctOption: "4",incorrectOptions:["3\\sqrt{10}","\\sqrt{26}","\\sqrt{10}"]},

{equation: "\\[{\\sqrt{32}=?}\\]",correctOption: "4\\sqrt{2}",incorrectOptions:["3\\sqrt{13}","2\\sqrt{21}","6\\sqrt{2}"]},

{equation: "\\[{\\sqrt{66}=?}\\]",correctOption: "\\sqrt{66}",incorrectOptions:["2\\sqrt{2}","2\\sqrt{30}","4"]},

{equation: "\\[{\\sqrt{56}=?}\\]",correctOption: "2\\sqrt{14}",incorrectOptions:["4\\sqrt{6}","\\sqrt{21}","\\sqrt{30}"]},

{equation: "\\[{\\sqrt{36}=?}\\]",correctOption: "6",incorrectOptions:["\\sqrt{2}","\\sqrt{154}","3\\sqrt{10}"]},

{equation: "\\[{\\sqrt{99}=?}\\]",correctOption: "3\\sqrt{11}",incorrectOptions:["6\\sqrt{3}","4\\sqrt{7}","4\\sqrt{2}"]},
{equation: "\\[{\\sqrt{4}=?}\\]",correctOption: "2",incorrectOptions:["2\\sqrt{11}","2\\sqrt{10}","\\sqrt{35}"]},

{equation: "\\[{\\sqrt{40}=?}\\]",correctOption: "2\\sqrt{10}",incorrectOptions:["\\sqrt{11}","3\\sqrt{14}","\\sqrt{6}"]},

{equation: "\\[{\\sqrt{28}=?}\\]",correctOption: "2\\sqrt{7}",incorrectOptions:["10","4\\sqrt{2}","2\\sqrt{15}"]},

{equation: "\\[{\\sqrt{50}=?}\\]",correctOption: "5\\sqrt{2}",incorrectOptions:["\\sqrt{7}","6","2\\sqrt{10}"]},

{equation: "\\[{\\sqrt{8}=?}\\]",correctOption: "2\\sqrt{2}",incorrectOptions:["6\\sqrt{5}","6","4\\sqrt{2}"]},

{equation: "\\[{\\sqrt{15}=?}\\]",correctOption: "\\sqrt{15}",incorrectOptions:["\\sqrt{30}","4\\sqrt{2}","\\sqrt{6}"]},

{equation: "\\[{\\sqrt{50}=?}\\]",correctOption: "5\\sqrt{2}",incorrectOptions:["2\\sqrt{14}","\\sqrt{6}","\\sqrt{3}"]},

{equation: "\\[{\\sqrt{21}=?}\\]",correctOption: "\\sqrt{21}",incorrectOptions:["\\sqrt{210}","\\sqrt{78}","\\sqrt{70}"]},

{equation: "\\[{\\sqrt{24}=?}\\]",correctOption: "2\\sqrt{6}",incorrectOptions:["3\\sqrt{13}","\\sqrt{6}","2\\sqrt{14}"]},

{equation: "\\[{\\sqrt{4}=?}\\]",correctOption: "2",incorrectOptions:["\\sqrt{39}","2\\sqrt{6}","3\\sqrt{3}"]},

{equation: "\\[{\\sqrt{33}=?}\\]",correctOption: "\\sqrt{33}",incorrectOptions:["2\\sqrt{6}","\\sqrt{195}","3\\sqrt{2}"]},

{equation: "\\[{\\sqrt{8}=?}\\]",correctOption: "2\\sqrt{2}",incorrectOptions:["3\\sqrt{14}","2\\sqrt{14}","\\sqrt{35}"]},

{equation: "\\[{\\sqrt{36}=?}\\]",correctOption: "6",incorrectOptions:["\\sqrt{78}","3\\sqrt{2}","3\\sqrt{3}"]},

{equation: "\\[{\\sqrt{12}=?}\\]",correctOption: "2\\sqrt{3}",incorrectOptions:["\\sqrt{6}","\\sqrt{15}","\\sqrt{10}"]},

{equation: "\\[{\\sqrt{14}=?}\\]",correctOption: "\\sqrt{14}",incorrectOptions:["2\\sqrt{5}","2\\sqrt{15}","\\sqrt{42}"]},

{equation: "\\[{\\sqrt{4}=?}\\]",correctOption: "2",incorrectOptions:["2\\sqrt{7}","2\\sqrt{21}","3\\sqrt{3}"]},

{equation: "\\[{\\sqrt{30}=?}\\]",correctOption: "\\sqrt{30}",incorrectOptions:["\\sqrt{11}","\\sqrt{15}","2\\sqrt{7}"]},

{equation: "\\[{\\sqrt{45}=?}\\]",correctOption: "3\\sqrt{5}",incorrectOptions:["7","6\\sqrt{2}","2\\sqrt{10}"]},

{equation: "\\[{\\sqrt{32}=?}\\]",correctOption: "4\\sqrt{2}",incorrectOptions:["2\\sqrt{30}","2\\sqrt{3}","\\sqrt{30}"]},

{equation: "\\[{\\sqrt{63}=?}\\]",correctOption: "3\\sqrt{7}",incorrectOptions:["4","\\sqrt{154}","2\\sqrt{5}"]},

{equation: "\\[{\\sqrt{88}=?}\\]",correctOption: "2\\sqrt{22}",incorrectOptions:["2\\sqrt{33}","6\\sqrt{3}","\\sqrt{14}"]},

{equation: "\\[{\\sqrt{35}=?}\\]",correctOption: "\\sqrt{35}",incorrectOptions:["2\\sqrt{14}","\\sqrt{130}","3"]},

{equation: "\\[{\\sqrt{12}=?}\\]",correctOption: "2\\sqrt{3}",incorrectOptions:["2\\sqrt{6}","2\\sqrt{5}","8"]},

{equation: "\\[{\\sqrt{42}=?}\\]",correctOption: "\\sqrt{42}",incorrectOptions:["3\\sqrt{14}","2\\sqrt{39}","3\\sqrt{5}"]},

{equation: "\\[{\\sqrt{32}=?}\\]",correctOption: "4\\sqrt{2}",incorrectOptions:["\\sqrt{39}","2\\sqrt{2}","\\sqrt{14}"]},

{equation: "\\[{\\sqrt{20}=?}\\]",correctOption: "2\\sqrt{5}",incorrectOptions:["6\\sqrt{3}","3\\sqrt{15}","3\\sqrt{3}"]},

{equation: "\\[{\\sqrt{70}=?}\\]",correctOption: "\\sqrt{70}",incorrectOptions:["3\\sqrt{15}","7\\sqrt{2}","2\\sqrt{5}"]},

{equation: "\\[{\\sqrt{49}=?}\\]",correctOption: "7",incorrectOptions:["2\\sqrt{11}","2\\sqrt{7}","4\\sqrt{2}"]},

{equation: "\\[{\\sqrt{60}=?}\\]",correctOption: "2\\sqrt{15}",incorrectOptions:["2\\sqrt{21}","2\\sqrt{6}","4"]},

{equation: "\\[{\\sqrt{24}=?}\\]",correctOption: "2\\sqrt{6}",incorrectOptions:["3\\sqrt{2}","2\\sqrt{22}","2\\sqrt{3}"]},

        ]
   
 const 鸡兔同笼头脚和 = [
{equation: "\\begin{gather}鸡兔同笼共23个头;有74只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=9 , 兔=14",incorrectOptions:[" 鸡=10 , 兔=13", "鸡=17 , 兔=6","鸡=7 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有72只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=12 , 兔=12",incorrectOptions:[" 鸡=13 , 兔=11", "鸡=7 , 兔=17","鸡=16 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共22个头;有72只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=8 , 兔=14",incorrectOptions:[" 鸡=17 , 兔=5", "鸡=20 , 兔=2","鸡=12 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共13个头;有38只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=6",incorrectOptions:[" 鸡=2 , 兔=11", "鸡=11 , 兔=2","鸡=8 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共16个头;有46只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=9 , 兔=7",incorrectOptions:[" 鸡=10 , 兔=6", "鸡=7 , 兔=9","鸡=13 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共35个头;有108只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=16 , 兔=19",incorrectOptions:[" 鸡=4 , 兔=31", "鸡=28 , 兔=7","鸡=6 , 兔=29"]},

{equation: "\\begin{gather}鸡兔同笼共10个头;有26只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=3",incorrectOptions:[" 鸡=2 , 兔=8", "鸡=4 , 兔=6","鸡=9 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共23个头;有58只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=17 , 兔=6",incorrectOptions:[" 鸡=12 , 兔=11", "鸡=16 , 兔=7","鸡=6 , 兔=17"]},

{equation: "\\begin{gather}鸡兔同笼共8个头;有20只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=6 , 兔=2",incorrectOptions:[" 鸡=2 , 兔=6", "鸡=3 , 兔=5","鸡=3 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共29个头;有82只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=17 , 兔=12",incorrectOptions:[" 鸡=14 , 兔=15", "鸡=16 , 兔=13","鸡=24 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共38个头;有114只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=19 , 兔=19",incorrectOptions:[" 鸡=6 , 兔=32", "鸡=11 , 兔=27","鸡=12 , 兔=26"]},

{equation: "\\begin{gather}鸡兔同笼共5个头;有16只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=2 , 兔=3",incorrectOptions:[" 鸡=1 , 兔=4", "鸡=1 , 兔=4","鸡=1 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共8个头;有18只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=1",incorrectOptions:[" 鸡=6 , 兔=2", "鸡=6 , 兔=2","鸡=6 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有58只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=19 , 兔=5",incorrectOptions:[" 鸡=21 , 兔=3", "鸡=13 , 兔=11","鸡=17 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共29个头;有84只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=16 , 兔=13",incorrectOptions:[" 鸡=25 , 兔=4", "鸡=5 , 兔=24","鸡=8 , 兔=21"]},

{equation: "\\begin{gather}鸡兔同笼共23个头;有82只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=5 , 兔=18",incorrectOptions:[" 鸡=16 , 兔=7", "鸡=13 , 兔=10","鸡=18 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共14个头;有44只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=6 , 兔=8",incorrectOptions:[" 鸡=1 , 兔=13", "鸡=3 , 兔=11","鸡=9 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共14个头;有48只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=10",incorrectOptions:[" 鸡=1 , 兔=13", "鸡=11 , 兔=3","鸡=11 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共34个头;有96只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=20 , 兔=14",incorrectOptions:[" 鸡=5 , 兔=29", "鸡=32 , 兔=2","鸡=15 , 兔=19"]},

{equation: "\\begin{gather}鸡兔同笼共25个头;有80只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=10 , 兔=15",incorrectOptions:[" 鸡=15 , 兔=10", "鸡=21 , 兔=4","鸡=22 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共29个头;有90只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=13 , 兔=16",incorrectOptions:[" 鸡=3 , 兔=26", "鸡=16 , 兔=13","鸡=6 , 兔=23"]},

{equation: "\\begin{gather}鸡兔同笼共25个头;有70只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=15 , 兔=10",incorrectOptions:[" 鸡=17 , 兔=8", "鸡=10 , 兔=15","鸡=9 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共30个头;有86只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=17 , 兔=13",incorrectOptions:[" 鸡=12 , 兔=18", "鸡=6 , 兔=24","鸡=21 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共21个头;有74只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=5 , 兔=16",incorrectOptions:[" 鸡=3 , 兔=18", "鸡=6 , 兔=15","鸡=1 , 兔=20"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有74只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=11 , 兔=13",incorrectOptions:[" 鸡=1 , 兔=23", "鸡=12 , 兔=12","鸡=5 , 兔=19"]},

{equation: "\\begin{gather}鸡兔同笼共30个头;有92只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=14 , 兔=16",incorrectOptions:[" 鸡=8 , 兔=22", "鸡=18 , 兔=12","鸡=3 , 兔=27"]},

{equation: "\\begin{gather}鸡兔同笼共15个头;有34只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=13 , 兔=2",incorrectOptions:[" 鸡=7 , 兔=8", "鸡=11 , 兔=4","鸡=6 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共5个头;有12只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=1",incorrectOptions:[" 鸡=2 , 兔=3", "鸡=1 , 兔=4","鸡=3 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共17个头;有48只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=10 , 兔=7",incorrectOptions:[" 鸡=6 , 兔=11", "鸡=5 , 兔=12","鸡=5 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共34个头;有96只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=20 , 兔=14",incorrectOptions:[" 鸡=11 , 兔=23", "鸡=11 , 兔=23","鸡=16 , 兔=18"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有72只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=12 , 兔=12",incorrectOptions:[" 鸡=4 , 兔=20", "鸡=2 , 兔=22","鸡=7 , 兔=17"]},

{equation: "\\begin{gather}鸡兔同笼共30个头;有98只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=11 , 兔=19",incorrectOptions:[" 鸡=16 , 兔=14", "鸡=13 , 兔=17","鸡=16 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共9个头;有26只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=5 , 兔=4",incorrectOptions:[" 鸡=2 , 兔=7", "鸡=2 , 兔=7","鸡=6 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共21个头;有68只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=8 , 兔=13",incorrectOptions:[" 鸡=14 , 兔=7", "鸡=3 , 兔=18","鸡=18 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共18个头;有60只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=6 , 兔=12",incorrectOptions:[" 鸡=1 , 兔=17", "鸡=16 , 兔=2","鸡=5 , 兔=13"]},

{equation: "\\begin{gather}鸡兔同笼共3个头;有10只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=1 , 兔=2",incorrectOptions:[" 鸡=2 , 兔=1", "鸡=2 , 兔=1","鸡=2 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共16个头;有62只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=1 , 兔=15",incorrectOptions:[" 鸡=11 , 兔=5", "鸡=7 , 兔=9","鸡=10 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共23个头;有72只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=10 , 兔=13",incorrectOptions:[" 鸡=9 , 兔=14", "鸡=18 , 兔=5","鸡=3 , 兔=20"]},

{equation: "\\begin{gather}鸡兔同笼共11个头;有34只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=5 , 兔=6",incorrectOptions:[" 鸡=7 , 兔=4", "鸡=9 , 兔=2","鸡=7 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共14个头;有34只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=11 , 兔=3",incorrectOptions:[" 鸡=8 , 兔=6", "鸡=12 , 兔=2","鸡=9 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共21个头;有54只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=15 , 兔=6",incorrectOptions:[" 鸡=18 , 兔=3", "鸡=3 , 兔=18","鸡=5 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共19个头;有68只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=15",incorrectOptions:[" 鸡=10 , 兔=9", "鸡=13 , 兔=6","鸡=16 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共32个头;有98只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=15 , 兔=17",incorrectOptions:[" 鸡=1 , 兔=31", "鸡=24 , 兔=8","鸡=20 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共7个头;有26只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=1 , 兔=6",incorrectOptions:[" 鸡=5 , 兔=2", "鸡=3 , 兔=4","鸡=4 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共37个头;有114只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=17 , 兔=20",incorrectOptions:[" 鸡=28 , 兔=9", "鸡=33 , 兔=4","鸡=2 , 兔=35"]},

{equation: "\\begin{gather}鸡兔同笼共20个头;有56只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=12 , 兔=8",incorrectOptions:[" 鸡=6 , 兔=14", "鸡=15 , 兔=5","鸡=8 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共18个头;有64只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=14",incorrectOptions:[" 鸡=8 , 兔=10", "鸡=5 , 兔=13","鸡=1 , 兔=17"]},

{equation: "\\begin{gather}鸡兔同笼共13个头;有34只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=9 , 兔=4",incorrectOptions:[" 鸡=6 , 兔=7", "鸡=1 , 兔=12","鸡=12 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共39个头;有116只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=20 , 兔=19",incorrectOptions:[" 鸡=35 , 兔=4", "鸡=13 , 兔=26","鸡=9 , 兔=30"]},

{equation: "\\begin{gather}鸡兔同笼共20个头;有70只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=5 , 兔=15",incorrectOptions:[" 鸡=8 , 兔=12", "鸡=14 , 兔=6","鸡=7 , 兔=13"]},
{equation: "\\begin{gather}鸡兔同笼共9个头;有30只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=3 , 兔=6",incorrectOptions:[" 鸡=5 , 兔=4", "鸡=4 , 兔=5","鸡=7 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共19个头;有50只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=13 , 兔=6",incorrectOptions:[" 鸡=18 , 兔=1", "鸡=2 , 兔=17","鸡=5 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共23个头;有78只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=16",incorrectOptions:[" 鸡=3 , 兔=20", "鸡=14 , 兔=9","鸡=8 , 兔=15"]},

{equation: "\\begin{gather}鸡兔同笼共15个头;有44只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=8 , 兔=7",incorrectOptions:[" 鸡=7 , 兔=8", "鸡=13 , 兔=2","鸡=12 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共14个头;有54只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=1 , 兔=13",incorrectOptions:[" 鸡=3 , 兔=11", "鸡=13 , 兔=1","鸡=13 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共29个头;有88只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=14 , 兔=15",incorrectOptions:[" 鸡=3 , 兔=26", "鸡=13 , 兔=16","鸡=2 , 兔=27"]},

{equation: "\\begin{gather}鸡兔同笼共6个头;有18只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=3 , 兔=3",incorrectOptions:[" 鸡=2 , 兔=4", "鸡=2 , 兔=4","鸡=1 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共16个头;有62只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=1 , 兔=15",incorrectOptions:[" 鸡=13 , 兔=3", "鸡=6 , 兔=10","鸡=13 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共14个头;有52只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=2 , 兔=12",incorrectOptions:[" 鸡=6 , 兔=8", "鸡=3 , 兔=11","鸡=10 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有56只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=20 , 兔=4",incorrectOptions:[" 鸡=11 , 兔=13", "鸡=2 , 兔=22","鸡=15 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共20个头;有60只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=10 , 兔=10",incorrectOptions:[" 鸡=7 , 兔=13", "鸡=4 , 兔=16","鸡=6 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共23个头;有78只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=16",incorrectOptions:[" 鸡=5 , 兔=18", "鸡=14 , 兔=9","鸡=13 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共22个头;有80只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=18",incorrectOptions:[" 鸡=21 , 兔=1", "鸡=2 , 兔=20","鸡=14 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共22个头;有74只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=15",incorrectOptions:[" 鸡=1 , 兔=21", "鸡=20 , 兔=2","鸡=15 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共19个头;有60只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=8 , 兔=11",incorrectOptions:[" 鸡=15 , 兔=4", "鸡=11 , 兔=8","鸡=11 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共7个头;有16只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=6 , 兔=1",incorrectOptions:[" 鸡=1 , 兔=6", "鸡=4 , 兔=3","鸡=5 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共17个头;有54只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=10",incorrectOptions:[" 鸡=5 , 兔=12", "鸡=12 , 兔=5","鸡=10 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共19个头;有50只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=13 , 兔=6",incorrectOptions:[" 鸡=9 , 兔=10", "鸡=12 , 兔=7","鸡=1 , 兔=18"]},

{equation: "\\begin{gather}鸡兔同笼共27个头;有70只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=19 , 兔=8",incorrectOptions:[" 鸡=20 , 兔=7", "鸡=2 , 兔=25","鸡=13 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共7个头;有26只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=1 , 兔=6",incorrectOptions:[" 鸡=4 , 兔=3", "鸡=2 , 兔=5","鸡=4 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共29个头;有78只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=19 , 兔=10",incorrectOptions:[" 鸡=1 , 兔=28", "鸡=9 , 兔=20","鸡=23 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共31个头;有94只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=15 , 兔=16",incorrectOptions:[" 鸡=8 , 兔=23", "鸡=16 , 兔=15","鸡=27 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共26个头;有66只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=19 , 兔=7",incorrectOptions:[" 鸡=6 , 兔=20", "鸡=11 , 兔=15","鸡=18 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共23个头;有84只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=19",incorrectOptions:[" 鸡=6 , 兔=17", "鸡=21 , 兔=2","鸡=5 , 兔=18"]},

{equation: "\\begin{gather}鸡兔同笼共9个头;有32只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=2 , 兔=7",incorrectOptions:[" 鸡=7 , 兔=2", "鸡=8 , 兔=1","鸡=3 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共20个头;有56只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=12 , 兔=8",incorrectOptions:[" 鸡=14 , 兔=6", "鸡=6 , 兔=14","鸡=2 , 兔=18"]},

{equation: "\\begin{gather}鸡兔同笼共23个头;有68只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=12 , 兔=11",incorrectOptions:[" 鸡=7 , 兔=16", "鸡=18 , 兔=5","鸡=7 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共18个头;有64只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=14",incorrectOptions:[" 鸡=9 , 兔=9", "鸡=6 , 兔=12","鸡=1 , 兔=17"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有74只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=11 , 兔=13",incorrectOptions:[" 鸡=14 , 兔=10", "鸡=20 , 兔=4","鸡=10 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共11个头;有26只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=9 , 兔=2",incorrectOptions:[" 鸡=2 , 兔=9", "鸡=5 , 兔=6","鸡=6 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共29个头;有76只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=20 , 兔=9",incorrectOptions:[" 鸡=10 , 兔=19", "鸡=12 , 兔=17","鸡=5 , 兔=24"]},

{equation: "\\begin{gather}鸡兔同笼共16个头;有42只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=11 , 兔=5",incorrectOptions:[" 鸡=4 , 兔=12", "鸡=3 , 兔=13","鸡=15 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共22个头;有48只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=20 , 兔=2",incorrectOptions:[" 鸡=17 , 兔=5", "鸡=8 , 兔=14","鸡=13 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共17个头;有54只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=10",incorrectOptions:[" 鸡=13 , 兔=4", "鸡=15 , 兔=2","鸡=15 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有74只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=11 , 兔=13",incorrectOptions:[" 鸡=19 , 兔=5", "鸡=7 , 兔=17","鸡=4 , 兔=20"]},

{equation: "\\begin{gather}鸡兔同笼共16个头;有42只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=11 , 兔=5",incorrectOptions:[" 鸡=1 , 兔=15", "鸡=5 , 兔=11","鸡=10 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共26个头;有68只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=18 , 兔=8",incorrectOptions:[" 鸡=15 , 兔=11", "鸡=2 , 兔=24","鸡=7 , 兔=19"]},

{equation: "\\begin{gather}鸡兔同笼共13个头;有44只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=9",incorrectOptions:[" 鸡=2 , 兔=11", "鸡=8 , 兔=5","鸡=7 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共24个头;有80只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=8 , 兔=16",incorrectOptions:[" 鸡=6 , 兔=18", "鸡=19 , 兔=5","鸡=9 , 兔=15"]},

{equation: "\\begin{gather}鸡兔同笼共26个头;有88只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=8 , 兔=18",incorrectOptions:[" 鸡=22 , 兔=4", "鸡=24 , 兔=2","鸡=2 , 兔=24"]},

{equation: "\\begin{gather}鸡兔同笼共21个头;有54只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=15 , 兔=6",incorrectOptions:[" 鸡=17 , 兔=4", "鸡=8 , 兔=13","鸡=18 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共22个头;有60只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=14 , 兔=8",incorrectOptions:[" 鸡=6 , 兔=16", "鸡=18 , 兔=4","鸡=16 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共36个头;有112只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=16 , 兔=20",incorrectOptions:[" 鸡=29 , 兔=7", "鸡=30 , 兔=6","鸡=35 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共19个头;有60只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=8 , 兔=11",incorrectOptions:[" 鸡=1 , 兔=18", "鸡=11 , 兔=8","鸡=9 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共18个头;有64只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=14",incorrectOptions:[" 鸡=9 , 兔=9", "鸡=12 , 兔=6","鸡=17 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共10个头;有26只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=7 , 兔=3",incorrectOptions:[" 鸡=8 , 兔=2", "鸡=4 , 兔=6","鸡=1 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共21个头;有60只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=12 , 兔=9",incorrectOptions:[" 鸡=3 , 兔=18", "鸡=17 , 兔=4","鸡=1 , 兔=20"]},

{equation: "\\begin{gather}鸡兔同笼共28个头;有76只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=18 , 兔=10",incorrectOptions:[" 鸡=14 , 兔=14", "鸡=4 , 兔=24","鸡=2 , 兔=26"]},

{equation: "\\begin{gather}鸡兔同笼共15个头;有52只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=4 , 兔=11",incorrectOptions:[" 鸡=1 , 兔=14", "鸡=7 , 兔=8","鸡=12 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共26个头;有66只脚，\\\\请问有多少只鸡，有多少只兔？\\end{gather}",correctOption: "鸡=19 , 兔=7",incorrectOptions:[" 鸡=24 , 兔=2", "鸡=21 , 兔=5","鸡=16 , 兔=10"]},




        ];

        

 const 鸡兔同笼头和差 = [
{equation: "\\begin{gather}鸡兔同笼共9只;鸡比兔少1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=5",incorrectOptions:[" 鸡=1 , 兔=8", "鸡=3 , 兔=6","鸡=6 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共20只;鸡比兔少12只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=16",incorrectOptions:[" 鸡=2 , 兔=18", "鸡=5 , 兔=15","鸡=14 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共5只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=3, 兔=2",incorrectOptions:[" 鸡=4 , 兔=1", "鸡=1 , 兔=4","鸡=4 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共5只;鸡比兔少1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=3",incorrectOptions:[" 鸡=4 , 兔=1", "鸡=1 , 兔=4","鸡=3 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共7只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=6, 兔=1",incorrectOptions:[" 鸡=3 , 兔=4", "鸡=2 , 兔=5","鸡=4 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共39只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=19",incorrectOptions:[" 鸡=16 , 兔=23", "鸡=37 , 兔=2","鸡=23 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共10只;鸡比兔少6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=8",incorrectOptions:[" 鸡=1 , 兔=9", "鸡=9 , 兔=1","鸡=4 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共37只;鸡比兔少3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=17, 兔=20",incorrectOptions:[" 鸡=8 , 兔=29", "鸡=19 , 兔=18","鸡=21 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共23只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=14, 兔=9",incorrectOptions:[" 鸡=2 , 兔=21", "鸡=7 , 兔=16","鸡=18 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共8只;鸡比兔多2只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=5, 兔=3",incorrectOptions:[" 鸡=6 , 兔=2", "鸡=3 , 兔=5","鸡=2 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共15只;鸡比兔少5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=5, 兔=10",incorrectOptions:[" 鸡=10 , 兔=5", "鸡=4 , 兔=11","鸡=6 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共35只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=19, 兔=16",incorrectOptions:[" 鸡=31 , 兔=4", "鸡=6 , 兔=29","鸡=22 , 兔=13"]},

{equation: "\\begin{gather}鸡兔同笼共22只;鸡比兔多12只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=17, 兔=5",incorrectOptions:[" 鸡=8 , 兔=14", "鸡=12 , 兔=10","鸡=9 , 兔=13"]},

{equation: "\\begin{gather}鸡兔同笼共40只;鸡和兔一样多，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=20",incorrectOptions:[" 鸡=23 , 兔=17", "鸡=25 , 兔=15","鸡=4 , 兔=36"]},

{equation: "\\begin{gather}鸡兔同笼共24只;鸡比兔多10只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=17, 兔=7",incorrectOptions:[" 鸡=8 , 兔=16", "鸡=7 , 兔=17","鸡=14 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔少15只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=3, 兔=18",incorrectOptions:[" 鸡=18 , 兔=3", "鸡=5 , 兔=16","鸡=11 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共13只;鸡比兔少9只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=11",incorrectOptions:[" 鸡=5 , 兔=8", "鸡=11 , 兔=2","鸡=7 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共16只;鸡比兔多6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=11, 兔=5",incorrectOptions:[" 鸡=13 , 兔=3", "鸡=12 , 兔=4","鸡=7 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共26只;鸡比兔多14只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=6",incorrectOptions:[" 鸡=12 , 兔=14", "鸡=5 , 兔=21","鸡=4 , 兔=22"]},

{equation: "\\begin{gather}鸡兔同笼共34只;鸡比兔多6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=14",incorrectOptions:[" 鸡=3 , 兔=31", "鸡=25 , 兔=9","鸡=32 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共28只;鸡比兔多4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=12",incorrectOptions:[" 鸡=8 , 兔=20", "鸡=18 , 兔=10","鸡=6 , 兔=22"]},

{equation: "\\begin{gather}鸡兔同笼共33只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=15",incorrectOptions:[" 鸡=21 , 兔=12", "鸡=26 , 兔=7","鸡=1 , 兔=32"]},

{equation: "\\begin{gather}鸡兔同笼共24只;鸡比兔少16只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=20",incorrectOptions:[" 鸡=5 , 兔=19", "鸡=23 , 兔=1","鸡=5 , 兔=19"]},

{equation: "\\begin{gather}鸡兔同笼共29只;鸡比兔少9只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=10, 兔=19",incorrectOptions:[" 鸡=12 , 兔=17", "鸡=4 , 兔=25","鸡=7 , 兔=22"]},

{equation: "\\begin{gather}鸡兔同笼共26只;鸡比兔多14只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=6",incorrectOptions:[" 鸡=3 , 兔=23", "鸡=2 , 兔=24","鸡=10 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共16只;鸡比兔多10只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=13, 兔=3",incorrectOptions:[" 鸡=9 , 兔=7", "鸡=15 , 兔=1","鸡=11 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔少3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=7, 兔=10",incorrectOptions:[" 鸡=10 , 兔=7", "鸡=1 , 兔=16","鸡=1 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共34只;鸡比兔少6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=14, 兔=20",incorrectOptions:[" 鸡=5 , 兔=29", "鸡=1 , 兔=33","鸡=2 , 兔=32"]},

{equation: "\\begin{gather}鸡兔同笼共7只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=3",incorrectOptions:[" 鸡=6 , 兔=1", "鸡=3 , 兔=4","鸡=1 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔多17只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=19, 兔=2",incorrectOptions:[" 鸡=12 , 兔=9", "鸡=6 , 兔=15","鸡=2 , 兔=19"]},

{equation: "\\begin{gather}鸡兔同笼共30只;鸡比兔多2只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=14",incorrectOptions:[" 鸡=14 , 兔=16", "鸡=8 , 兔=22","鸡=1 , 兔=29"]},

{equation: "\\begin{gather}鸡兔同笼共22只;鸡比兔少18只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=20",incorrectOptions:[" 鸡=8 , 兔=14", "鸡=19 , 兔=3","鸡=1 , 兔=21"]},

{equation: "\\begin{gather}鸡兔同笼共10只;鸡比兔少6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=8",incorrectOptions:[" 鸡=4 , 兔=6", "鸡=5 , 兔=5","鸡=1 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔多15只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=1",incorrectOptions:[" 鸡=1 , 兔=16", "鸡=5 , 兔=12","鸡=9 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共14只;鸡比兔多4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=9, 兔=5",incorrectOptions:[" 鸡=4 , 兔=10", "鸡=13 , 兔=1","鸡=2 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共29只;鸡比兔多11只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=9",incorrectOptions:[" 鸡=14 , 兔=15", "鸡=13 , 兔=16","鸡=6 , 兔=23"]},

{equation: "\\begin{gather}鸡兔同笼共20只;鸡比兔多6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=13, 兔=7",incorrectOptions:[" 鸡=15 , 兔=5", "鸡=1 , 兔=19","鸡=18 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共11只;鸡比兔多7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=9, 兔=2",incorrectOptions:[" 鸡=6 , 兔=5", "鸡=10 , 兔=1","鸡=4 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共19只;鸡比兔多7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=13, 兔=6",incorrectOptions:[" 鸡=15 , 兔=4", "鸡=9 , 兔=10","鸡=7 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共14只;鸡比兔少2只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=6, 兔=8",incorrectOptions:[" 鸡=4 , 兔=10", "鸡=11 , 兔=3","鸡=9 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔多11只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=5",incorrectOptions:[" 鸡=4 , 兔=17", "鸡=8 , 兔=13","鸡=9 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共8只;鸡和兔一样多，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=4",incorrectOptions:[" 鸡=3 , 兔=5", "鸡=7 , 兔=1","鸡=6 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共13只;鸡比兔多7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=10, 兔=3",incorrectOptions:[" 鸡=8 , 兔=5", "鸡=7 , 兔=6","鸡=5 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔多7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=14, 兔=7",incorrectOptions:[" 鸡=20 , 兔=1", "鸡=9 , 兔=12","鸡=5 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共8只;鸡比兔少6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=1, 兔=7",incorrectOptions:[" 鸡=5 , 兔=3", "鸡=7 , 兔=1","鸡=4 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔少11只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=3, 兔=14",incorrectOptions:[" 鸡=13 , 兔=4", "鸡=6 , 兔=11","鸡=12 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共16只;鸡比兔少4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=6, 兔=10",incorrectOptions:[" 鸡=14 , 兔=2", "鸡=3 , 兔=13","鸡=12 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔多13只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=17, 兔=4",incorrectOptions:[" 鸡=4 , 兔=17", "鸡=20 , 兔=1","鸡=3 , 兔=18"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=11, 兔=6",incorrectOptions:[" 鸡=12 , 兔=5", "鸡=16 , 兔=1","鸡=13 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共7只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=5, 兔=2",incorrectOptions:[" 鸡=2 , 兔=5", "鸡=6 , 兔=1","鸡=4 , 兔=3"]},
{equation: "\\begin{gather}鸡兔同笼共11只;鸡比兔少1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=5, 兔=6",incorrectOptions:[" 鸡=6 , 兔=5", "鸡=1 , 兔=10","鸡=1 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共23只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=14, 兔=9",incorrectOptions:[" 鸡=16 , 兔=7", "鸡=15 , 兔=8","鸡=2 , 兔=21"]},

{equation: "\\begin{gather}鸡兔同笼共7只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=6, 兔=1",incorrectOptions:[" 鸡=1 , 兔=6", "鸡=4 , 兔=3","鸡=3 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共35只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=15",incorrectOptions:[" 鸡=33 , 兔=2", "鸡=25 , 兔=10","鸡=16 , 兔=19"]},

{equation: "\\begin{gather}鸡兔同笼共24只;鸡比兔少14只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=5, 兔=19",incorrectOptions:[" 鸡=4 , 兔=20", "鸡=18 , 兔=6","鸡=22 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共24只;鸡比兔多8只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=8",incorrectOptions:[" 鸡=7 , 兔=17", "鸡=14 , 兔=10","鸡=13 , 兔=11"]},

{equation: "\\begin{gather}鸡兔同笼共15只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=10, 兔=5",incorrectOptions:[" 鸡=3 , 兔=12", "鸡=8 , 兔=7","鸡=6 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共12只;鸡比兔少8只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=10",incorrectOptions:[" 鸡=10 , 兔=2", "鸡=6 , 兔=6","鸡=5 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共34只;鸡比兔多6只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=14",incorrectOptions:[" 鸡=24 , 兔=10", "鸡=16 , 兔=18","鸡=22 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共24只;鸡比兔多4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=14, 兔=10",incorrectOptions:[" 鸡=5 , 兔=19", "鸡=6 , 兔=18","鸡=8 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔少9只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=13",incorrectOptions:[" 鸡=1 , 兔=16", "鸡=12 , 兔=5","鸡=2 , 兔=15"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔少3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=9, 兔=12",incorrectOptions:[" 鸡=17 , 兔=4", "鸡=12 , 兔=9","鸡=13 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共28只;鸡比兔多2只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=15, 兔=13",incorrectOptions:[" 鸡=21 , 兔=7", "鸡=22 , 兔=6","鸡=21 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共31只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=17, 兔=14",incorrectOptions:[" 鸡=10 , 兔=21", "鸡=30 , 兔=1","鸡=24 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共7只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=3",incorrectOptions:[" 鸡=1 , 兔=6", "鸡=3 , 兔=4","鸡=6 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=9, 兔=8",incorrectOptions:[" 鸡=6 , 兔=11", "鸡=10 , 兔=7","鸡=2 , 兔=15"]},

{equation: "\\begin{gather}鸡兔同笼共29只;鸡比兔多7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=11",incorrectOptions:[" 鸡=16 , 兔=13", "鸡=2 , 兔=27","鸡=22 , 兔=7"]},

{equation: "\\begin{gather}鸡兔同笼共24只;鸡比兔多4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=14, 兔=10",incorrectOptions:[" 鸡=11 , 兔=13", "鸡=6 , 兔=18","鸡=12 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共13只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=7, 兔=6",incorrectOptions:[" 鸡=12 , 兔=1", "鸡=9 , 兔=4","鸡=3 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共19只;鸡比兔少7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=6, 兔=13",incorrectOptions:[" 鸡=11 , 兔=8", "鸡=11 , 兔=8","鸡=3 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共35只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=17",incorrectOptions:[" 鸡=10 , 兔=25", "鸡=6 , 兔=29","鸡=25 , 兔=10"]},

{equation: "\\begin{gather}鸡兔同笼共26只;鸡比兔少10只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=8, 兔=18",incorrectOptions:[" 鸡=14 , 兔=12", "鸡=7 , 兔=19","鸡=1 , 兔=25"]},

{equation: "\\begin{gather}鸡兔同笼共29只;鸡比兔多7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=11",incorrectOptions:[" 鸡=12 , 兔=17", "鸡=8 , 兔=21","鸡=5 , 兔=24"]},

{equation: "\\begin{gather}鸡兔同笼共20只;鸡比兔多16只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=2",incorrectOptions:[" 鸡=13 , 兔=7", "鸡=17 , 兔=3","鸡=12 , 兔=8"]},

{equation: "\\begin{gather}鸡兔同笼共8只;鸡和兔一样多，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=4, 兔=4",incorrectOptions:[" 鸡=6 , 兔=2", "鸡=7 , 兔=1","鸡=5 , 兔=3"]},

{equation: "\\begin{gather}鸡兔同笼共27只;鸡比兔多5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=11",incorrectOptions:[" 鸡=3 , 兔=24", "鸡=4 , 兔=23","鸡=12 , 兔=15"]},

{equation: "\\begin{gather}鸡兔同笼共37只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=17",incorrectOptions:[" 鸡=14 , 兔=23", "鸡=13 , 兔=24","鸡=33 , 兔=4"]},

{equation: "\\begin{gather}鸡兔同笼共27只;鸡比兔多11只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=19, 兔=8",incorrectOptions:[" 鸡=13 , 兔=14", "鸡=3 , 兔=24","鸡=26 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔多17只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=19, 兔=2",incorrectOptions:[" 鸡=11 , 兔=10", "鸡=18 , 兔=3","鸡=9 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共28只;鸡比兔少12只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=8, 兔=20",incorrectOptions:[" 鸡=3 , 兔=25", "鸡=25 , 兔=3","鸡=12 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共37只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=17",incorrectOptions:[" 鸡=26 , 兔=11", "鸡=16 , 兔=21","鸡=23 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共38只;鸡和兔一样多，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=19, 兔=19",incorrectOptions:[" 鸡=36 , 兔=2", "鸡=22 , 兔=16","鸡=7 , 兔=31"]},

{equation: "\\begin{gather}鸡兔同笼共6只;鸡比兔少2只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=4",incorrectOptions:[" 鸡=1 , 兔=5", "鸡=5 , 兔=1","鸡=4 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共28只;鸡比兔少4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=12, 兔=16",incorrectOptions:[" 鸡=17 , 兔=11", "鸡=14 , 兔=14","鸡=8 , 兔=20"]},

{equation: "\\begin{gather}鸡兔同笼共25只;鸡比兔多7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=9",incorrectOptions:[" 鸡=23 , 兔=2", "鸡=17 , 兔=8","鸡=9 , 兔=16"]},

{equation: "\\begin{gather}鸡兔同笼共30只;鸡比兔多2只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=16, 兔=14",incorrectOptions:[" 鸡=10 , 兔=20", "鸡=26 , 兔=4","鸡=3 , 兔=27"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔少15只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=1, 兔=16",incorrectOptions:[" 鸡=10 , 兔=7", "鸡=3 , 兔=14","鸡=8 , 兔=9"]},

{equation: "\\begin{gather}鸡兔同笼共24只;鸡比兔多12只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=6",incorrectOptions:[" 鸡=19 , 兔=5", "鸡=17 , 兔=7","鸡=10 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共35只;鸡比兔多1只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=17",incorrectOptions:[" 鸡=7 , 兔=28", "鸡=20 , 兔=15","鸡=33 , 兔=2"]},

{equation: "\\begin{gather}鸡兔同笼共27只;鸡比兔多9只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=18, 兔=9",incorrectOptions:[" 鸡=7 , 兔=20", "鸡=1 , 兔=26","鸡=9 , 兔=18"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔少11只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=5, 兔=16",incorrectOptions:[" 鸡=11 , 兔=10", "鸡=2 , 兔=19","鸡=9 , 兔=12"]},

{equation: "\\begin{gather}鸡兔同笼共6只;鸡比兔少4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=1, 兔=5",incorrectOptions:[" 鸡=3 , 兔=3", "鸡=4 , 兔=2","鸡=5 , 兔=1"]},

{equation: "\\begin{gather}鸡兔同笼共36只;鸡比兔多4只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=20, 兔=16",incorrectOptions:[" 鸡=30 , 兔=6", "鸡=12 , 兔=24","鸡=16 , 兔=20"]},

{equation: "\\begin{gather}鸡兔同笼共19只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=11, 兔=8",incorrectOptions:[" 鸡=6 , 兔=13", "鸡=10 , 兔=9","鸡=5 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔少5只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=8, 兔=13",incorrectOptions:[" 鸡=15 , 兔=6", "鸡=2 , 兔=19","鸡=10 , 兔=11"]},

{equation: "\\begin{gather}鸡兔同笼共21只;鸡比兔少7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=7, 兔=14",incorrectOptions:[" 鸡=10 , 兔=11", "鸡=1 , 兔=20","鸡=16 , 兔=5"]},

{equation: "\\begin{gather}鸡兔同笼共29只;鸡比兔少7只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=11, 兔=18",incorrectOptions:[" 鸡=13 , 兔=16", "鸡=19 , 兔=10","鸡=12 , 兔=17"]},

{equation: "\\begin{gather}鸡兔同笼共18只;鸡比兔少2只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=8, 兔=10",incorrectOptions:[" 鸡=4 , 兔=14", "鸡=11 , 兔=7","鸡=4 , 兔=14"]},

{equation: "\\begin{gather}鸡兔同笼共17只;鸡比兔多3只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=10, 兔=7",incorrectOptions:[" 鸡=1 , 兔=16", "鸡=6 , 兔=11","鸡=11 , 兔=6"]},

{equation: "\\begin{gather}鸡兔同笼共16只;鸡比兔少12只，\\\\请问鸡有几只？兔有几只？\\end{gather}",correctOption: "鸡=2, 兔=14",incorrectOptions:[" 鸡=4 , 兔=12", "鸡=5 , 兔=11","鸡=13 , 兔=3"]},

        ];




 const 分数加减运算 = [
{equation:"\\[ {\\frac{4}{9}+\\frac{2}{5}=?} \\]",correctOption:"\\frac{38}{45}",incorrectOptions:["\\frac{8}{5}","\\frac{1}{8}","\\frac{9}{8}"]},

{equation:"\\[ {\\frac{1}{6}+\\frac{1}{4}=?} \\]",correctOption:"\\frac{5}{12}",incorrectOptions:["\\frac{10}{9}","\\frac{7}{9}",2]},

{equation:"\\[ {\\frac{1}{9}+\\frac{7}{8}=?} \\]",correctOption:"\\frac{71}{72}",incorrectOptions:["\\frac{7}{2}","\\frac{3}{4}","\\frac{1}{2}"]},

{equation:"\\[ {\\frac{4}{5}+\\frac{5}{8}=?} \\]",correctOption:"\\frac{57}{40}",incorrectOptions:["\\frac{3}{2}","\\frac{4}{9}","\\frac{1}{5}"]},

{equation:"\\[ {\\frac{5}{6}+\\frac{2}{7}=?} \\]",correctOption:"\\frac{47}{42}",incorrectOptions:["\\frac{9}{7}","\\frac{3}{5}","\\frac{5}{7}"]},

{equation:"\\[ {\\frac{1}{9}+\\frac{2}{7}=?} \\]",correctOption:"\\frac{25}{63}",incorrectOptions:["\\frac{7}{5}","\\frac{8}{3}","\\frac{3}{4}"]},


{equation:"\\[ {\\frac{2}{5}+\\frac{9}{10}=?} \\]",correctOption:"\\frac{13}{10}",incorrectOptions:["\\frac{4}{3}","\\frac{4}{3}","\\frac{9}{4}"]},

{equation:"\\[ {\\frac{3}{10}+\\frac{5}{7}=?} \\]",correctOption:"\\frac{71}{70}",incorrectOptions:["\\frac{10}{7}","\\frac{1}{6}","\\frac{9}{7}"]},

{equation:"\\[ {\\frac{2}{9}+\\frac{1}{10}=?} \\]",correctOption:"\\frac{29}{90}",incorrectOptions:["\\frac{1}{10}",3,"\\frac{7}{4}"]},

{equation:"\\[ {\\frac{5}{8}+\\frac{2}{7}=?} \\]",correctOption:"\\frac{51}{56}",incorrectOptions:["\\frac{6}{7}","\\frac{1}{2}","\\frac{1}{8}"]},

{equation:"\\[ {\\frac{2}{5}+\\frac{7}{8}=?} \\]",correctOption:"\\frac{51}{40}",incorrectOptions:["\\frac{5}{3}","\\frac{9}{7}","\\frac{1}{10}"]},



{equation:"\\[ {\\frac{4}{7}+\\frac{7}{9}=?} \\]",correctOption:"\\frac{85}{63}",incorrectOptions:["\\frac{1}{10}","\\frac{3}{7}","\\frac{5}{8}"]},

{equation:"\\[ {\\frac{2}{7}+\\frac{2}{5}=?} \\]",correctOption:"\\frac{24}{35}",incorrectOptions:[10,"\\frac{4}{7}","\\frac{9}{4}"]},

{equation:"\\[ {\\frac{5}{6}+\\frac{9}{10}=?} \\]",correctOption:"\\frac{26}{15}",incorrectOptions:["\\frac{10}{9}","\\frac{8}{9}","\\frac{1}{4}"]},

{equation:"\\[ {\\frac{1}{3}+\\frac{1}{10}=?} \\]",correctOption:"\\frac{13}{30}",incorrectOptions:["\\frac{5}{2}","\\frac{1}{10}","\\frac{1}{5}"]},

{equation:"\\[ {\\frac{3}{7}+\\frac{1}{7}=?} \\]",correctOption:"\\frac{4}{7}",incorrectOptions:["\\frac{5}{2}",1,4]},

{equation:"\\[ {\\frac{5}{8}+\\frac{3}{4}=?} \\]",correctOption:"\\frac{11}{8}",incorrectOptions:[3,"\\frac{1}{10}","\\frac{1}{3}"]},

{equation:"\\[ {\\frac{3}{7}+\\frac{4}{5}=?} \\]",correctOption:"\\frac{43}{35}",incorrectOptions:["\\frac{6}{5}","\\frac{9}{7}","\\frac{10}{9}"]},

{equation:"\\[ {\\frac{2}{7}+\\frac{3}{4}=?} \\]",correctOption:"\\frac{29}{28}",incorrectOptions:["\\frac{7}{4}",9,"\\frac{5}{4}"]},

{equation:"\\[ {\\frac{4}{7}+\\frac{7}{10}=?} \\]",correctOption:"\\frac{89}{70}",incorrectOptions:["\\frac{9}{7}","\\frac{5}{2}","\\frac{10}{3}"]},

{equation:"\\[ {\\frac{3}{5}+\\frac{3}{8}=?} \\]",correctOption:"\\frac{39}{40}",incorrectOptions:["\\frac{10}{7}","\\frac{9}{8}","\\frac{1}{6}"]},

{equation:"\\[ {\\frac{1}{10}+\\frac{1}{9}=?} \\]",correctOption:"\\frac{19}{90}",incorrectOptions:["\\frac{2}{3}","\\frac{7}{4}","\\frac{3}{4}"]},

{equation:"\\[ {\\frac{5}{8}+\\frac{1}{4}=?} \\]",correctOption:"\\frac{7}{8}",incorrectOptions:[7,"\\frac{7}{6}","\\frac{8}{3}"]},

{equation:"\\[ {\\frac{1}{9}+\\frac{5}{7}=?} \\]",correctOption:"\\frac{52}{63}",incorrectOptions:["\\frac{1}{10}","\\frac{9}{5}","\\frac{7}{4}"]},

{equation:"\\[ {\\frac{5}{8}+\\frac{5}{9}=?} \\]",correctOption:"\\frac{85}{72}",incorrectOptions:["\\frac{1}{4}","\\frac{1}{5}",1]},

{equation:"\\[ {\\frac{4}{5}+\\frac{1}{3}=?} \\]",correctOption:"\\frac{17}{15}",incorrectOptions:["\\frac{1}{6}",9,"\\frac{3}{8}"]},

{equation:"\\[ {\\frac{5}{6}+\\frac{1}{4}=?} \\]",correctOption:"\\frac{13}{12}",incorrectOptions:[5,"\\frac{1}{8}",2]},

{equation:"\\[ {\\frac{9}{10}+\\frac{2}{5}=?} \\]",correctOption:"\\frac{13}{10}",incorrectOptions:["\\frac{4}{9}","\\frac{8}{3}","\\frac{2}{5}"]},

{equation:"\\[ {\\frac{1}{5}+\\frac{3}{10}=?} \\]",correctOption:"\\frac{1}{2}",incorrectOptions:["\\frac{3}{7}","\\frac{3}{5}","\\frac{9}{10}"]},

{equation:"\\[ {\\frac{1}{4}+\\frac{1}{8}=?} \\]",correctOption:"\\frac{3}{8}",incorrectOptions:["\\frac{4}{7}","\\frac{2}{7}","\\frac{1}{7}"]},

{equation:"\\[ {\\frac{1}{10}+\\frac{2}{5}=?} \\]",correctOption:"\\frac{1}{2}",incorrectOptions:["\\frac{1}{3}","\\frac{2}{9}","\\frac{1}{8}"]},

{equation:"\\[ {\\frac{5}{7}+\\frac{5}{8}=?} \\]",correctOption:"\\frac{75}{56}",incorrectOptions:["\\frac{7}{8}","\\frac{2}{7}","\\frac{8}{9}"]},

{equation:"\\[ {\\frac{7}{8}+\\frac{1}{9}=?} \\]",correctOption:"\\frac{71}{72}",incorrectOptions:["\\frac{2}{9}","\\frac{5}{9}","\\frac{1}{6}"]},

{equation:"\\[ {\\frac{4}{9}+\\frac{5}{7}=?} \\]",correctOption:"\\frac{73}{63}",incorrectOptions:["\\frac{7}{9}","\\frac{7}{9}","\\frac{1}{9}"]},

{equation:"\\[ {\\frac{8}{9}+\\frac{2}{9}=?} \\]",correctOption:"\\frac{10}{9}",incorrectOptions:["\\frac{1}{4}","\\frac{5}{8}","\\frac{3}{8}"]},

{equation:"\\[ {\\frac{6}{7}+\\frac{2}{7}=?} \\]",correctOption:"\\frac{8}{7}",incorrectOptions:["\\frac{2}{9}","\\frac{5}{8}","\\frac{1}{3}"]},

{equation:"\\[ {\\frac{9}{10}+\\frac{1}{2}=?} \\]",correctOption:"\\frac{7}{5}",incorrectOptions:["\\frac{4}{7}","\\frac{1}{10}","\\frac{4}{7}"]},

{equation:"\\[ {\\frac{5}{6}+\\frac{2}{9}=?} \\]",correctOption:"\\frac{19}{18}",incorrectOptions:["\\frac{1}{4}","\\frac{7}{9}","\\frac{8}{9}"]},

{equation:"\\[ {\\frac{3}{5}+\\frac{1}{3}=?} \\]",correctOption:"\\frac{14}{15}",incorrectOptions:["\\frac{4}{7}","\\frac{1}{8}","\\frac{1}{10}"]},

{equation:"\\[ {\\frac{9}{10}+\\frac{5}{6}=?} \\]",correctOption:"\\frac{26}{15}",incorrectOptions:["\\frac{5}{6}","\\frac{2}{5}","\\frac{3}{5}"]},

{equation:"\\[ {\\frac{5}{9}+\\frac{7}{8}=?} \\]",correctOption:"\\frac{103}{72}",incorrectOptions:["\\frac{5}{6}","\\frac{2}{5}","\\frac{5}{7}"]},

{equation:"\\[ {\\frac{3}{10}+\\frac{1}{4}=?} \\]",correctOption:"\\frac{11}{20}",incorrectOptions:["\\frac{9}{10}","\\frac{7}{8}","\\frac{1}{4}"]},

{equation:"\\[ {\\frac{3}{5}+\\frac{2}{9}=?} \\]",correctOption:"\\frac{37}{45}",incorrectOptions:["\\frac{1}{3}","\\frac{1}{2}","\\frac{9}{10}"]},

{equation:"\\[ {\\frac{3}{5}+\\frac{1}{8}=?} \\]",correctOption:"\\frac{29}{40}",incorrectOptions:["\\frac{7}{9}","\\frac{4}{5}","\\frac{4}{9}"]},

{equation:"\\[ {\\frac{3}{4}+\\frac{3}{7}=?} \\]",correctOption:"\\frac{33}{28}",incorrectOptions:["\\frac{4}{7}","\\frac{1}{8}","\\frac{4}{7}"]},

{equation:"\\[ {\\frac{4}{9}+\\frac{2}{3}=?} \\]",correctOption:"\\frac{10}{9}",incorrectOptions:["\\frac{1}{6}","\\frac{1}{4}","\\frac{1}{2}"]},

{equation:"\\[ {\\frac{7}{8}+\\frac{7}{10}=?} \\]",correctOption:"\\frac{63}{40}",incorrectOptions:["\\frac{5}{7}","\\frac{3}{8}","\\frac{1}{6}"]},

{equation:"\\[ {\\frac{3}{7}+\\frac{2}{7}=?} \\]",correctOption:"\\frac{5}{7}",incorrectOptions:["\\frac{8}{9}","\\frac{4}{7}","\\frac{3}{10}"]},

{equation:"\\[ {\\frac{3}{5}+\\frac{7}{8}=?} \\]",correctOption:"\\frac{59}{40}",incorrectOptions:["\\frac{7}{9}","\\frac{3}{10}","\\frac{7}{10}"]},

{equation:"\\[ {\\frac{1}{6}+\\frac{4}{5}=?} \\]",correctOption:"\\frac{29}{30}",incorrectOptions:["\\frac{1}{7}","\\frac{5}{7}","\\frac{7}{8}"]},

{equation:"\\[ {\\frac{1}{7}+\\frac{2}{9}=?} \\]",correctOption:"\\frac{23}{63}",incorrectOptions:["\\frac{8}{9}","\\frac{3}{4}","\\frac{5}{7}"]},

{equation:"\\[ {\\frac{3}{7}+\\frac{1}{2}=?} \\]",correctOption:"\\frac{13}{14}",incorrectOptions:["\\frac{2}{9}","\\frac{7}{10}","\\frac{5}{8}"]},

{equation:"\\[ {\\frac{5}{8}+\\frac{1}{3}=?} \\]",correctOption:"\\frac{23}{24}",incorrectOptions:["\\frac{3}{4}","\\frac{7}{10}","\\frac{3}{4}"]},

{equation:"\\[ {\\frac{3}{5}+\\frac{7}{9}=?} \\]",correctOption:"\\frac{62}{45}",incorrectOptions:["\\frac{1}{2}","\\frac{3}{8}","\\frac{1}{10}"]},

{equation:"\\[ {\\frac{7}{8}+\\frac{1}{2}=?} \\]",correctOption:"\\frac{11}{8}",incorrectOptions:["\\frac{7}{9}","\\frac{3}{5}","\\frac{1}{6}"]},

{equation:"\\[ {\\frac{2}{3}+\\frac{3}{8}=?} \\]",correctOption:"\\frac{25}{24}",incorrectOptions:["\\frac{2}{9}","\\frac{5}{7}","\\frac{5}{9}"]},

{equation:"\\[ {\\frac{3}{4}+\\frac{1}{5}=?} \\]",correctOption:"\\frac{19}{20}",incorrectOptions:["\\frac{7}{9}","\\frac{2}{3}","\\frac{8}{9}"]},

{equation:"\\[ {\\frac{1}{5}+\\frac{1}{9}=?} \\]",correctOption:"\\frac{14}{45}",incorrectOptions:["\\frac{2}{5}","\\frac{8}{9}","\\frac{7}{9}"]},

{equation:"\\[ {\\frac{1}{6}-\\frac{3}{5}=?} \\]",correctOption:"\\frac{-13}{30}",incorrectOptions:["\\frac{1}{6}","\\frac{1}{10}","\\frac{3}{7}"]},

{equation:"\\[ {\\frac{5}{8}-\\frac{4}{5}=?} \\]",correctOption:"\\frac{-7}{40}",incorrectOptions:["\\frac{2}{5}","\\frac{1}{10}","\\frac{2}{5}"]},

{equation:"\\[ {\\frac{5}{6}-\\frac{8}{9}=?} \\]",correctOption:"\\frac{-1}{18}",incorrectOptions:["\\frac{1}{10}","\\frac{5}{9}","\\frac{9}{10}"]},

{equation:"\\[ {\\frac{7}{10}-\\frac{3}{8}=?} \\]",correctOption:"\\frac{13}{40}",incorrectOptions:["\\frac{1}{6}","\\frac{1}{3}","\\frac{4}{5}"]},

{equation:"\\[ {\\frac{5}{7}-\\frac{4}{5}=?} \\]",correctOption:"\\frac{-3}{35}",incorrectOptions:["\\frac{2}{7}","\\frac{7}{8}","\\frac{1}{9}"]},

{equation:"\\[ {\\frac{5}{8}-\\frac{4}{5}=?} \\]",correctOption:"\\frac{-7}{40}",incorrectOptions:["\\frac{3}{4}","\\frac{4}{5}","\\frac{5}{9}"]},

{equation:"\\[ {\\frac{1}{3}-\\frac{2}{3}=?} \\]",correctOption:"\\frac{-1}{3}",incorrectOptions:["\\frac{2}{9}","\\frac{7}{8}","\\frac{1}{3}"]},

{equation:"\\[ {\\frac{5}{6}-\\frac{4}{7}=?} \\]",correctOption:"\\frac{11}{42}",incorrectOptions:["\\frac{7}{9}","\\frac{5}{6}","\\frac{1}{9}"]},

{equation:"\\[ {\\frac{2}{9}-\\frac{1}{10}=?} \\]",correctOption:"\\frac{11}{90}",incorrectOptions:["\\frac{3}{4}","\\frac{2}{7}","\\frac{3}{5}"]},

{equation:"\\[ {\\frac{1}{8}-\\frac{5}{7}=?} \\]",correctOption:"\\frac{-33}{56}",incorrectOptions:["\\frac{1}{7}","\\frac{9}{10}","\\frac{4}{9}"]},

{equation:"\\[ {\\frac{5}{9}-\\frac{6}{7}=?} \\]",correctOption:"\\frac{-19}{63}",incorrectOptions:["\\frac{9}{10}","\\frac{5}{8}","\\frac{1}{4}"]},

{equation:"\\[ {\\frac{2}{5}-\\frac{1}{10}=?} \\]",correctOption:"\\frac{3}{10}",incorrectOptions:["\\frac{3}{8}","\\frac{1}{10}","\\frac{1}{2}"]},

{equation:"\\[ {\\frac{3}{5}-\\frac{1}{9}=?} \\]",correctOption:"\\frac{22}{45}",incorrectOptions:["\\frac{5}{6}","\\frac{1}{5}","\\frac{1}{3}"]},

{equation:"\\[ {\\frac{2}{9}-\\frac{5}{8}=?} \\]",correctOption:"\\frac{-29}{72}",incorrectOptions:["\\frac{9}{10}","\\frac{5}{8}","\\frac{6}{7}"]},

{equation:"\\[ {\\frac{3}{7}-\\frac{1}{3}=?} \\]",correctOption:"\\frac{2}{21}",incorrectOptions:["\\frac{1}{2}","\\frac{4}{5}","\\frac{1}{3}"]},

{equation:"\\[ {\\frac{5}{9}-\\frac{4}{9}=?} \\]",correctOption:"\\frac{1}{9}",incorrectOptions:["\\frac{1}{6}","\\frac{6}{7}","\\frac{2}{9}"]},

{equation:"\\[ {\\frac{3}{4}-\\frac{1}{2}=?} \\]",correctOption:"\\frac{1}{4}",incorrectOptions:["\\frac{1}{7}","\\frac{8}{9}","\\frac{2}{5}"]},

{equation:"\\[ {\\frac{7}{9}-\\frac{1}{4}=?} \\]",correctOption:"\\frac{19}{36}",incorrectOptions:["\\frac{3}{10}","\\frac{1}{8}","\\frac{1}{10}"]},

{equation:"\\[ {\\frac{5}{7}-\\frac{3}{10}=?} \\]",correctOption:"\\frac{29}{70}",incorrectOptions:["\\frac{3}{8}","\\frac{2}{9}","\\frac{6}{7}"]},

{equation:"\\[ {\\frac{5}{7}-\\frac{1}{3}=?} \\]",correctOption:"\\frac{8}{21}",incorrectOptions:["\\frac{5}{9}","\\frac{1}{2}","\\frac{3}{7}"]},

{equation:"\\[ {\\frac{9}{10}-\\frac{4}{7}=?} \\]",correctOption:"\\frac{23}{70}",incorrectOptions:["\\frac{1}{3}","\\frac{1}{8}","\\frac{3}{8}"]},

{equation:"\\[ {\\frac{3}{7}-\\frac{2}{5}=?} \\]",correctOption:"\\frac{1}{35}",incorrectOptions:["\\frac{4}{5}","\\frac{4}{5}","\\frac{1}{3}"]},

{equation:"\\[ {\\frac{4}{5}-\\frac{1}{8}=?} \\]",correctOption:"\\frac{27}{40}",incorrectOptions:["\\frac{2}{7}","\\frac{2}{3}","\\frac{2}{5}"]},

{equation:"\\[ {\\frac{3}{8}-\\frac{1}{2}=?} \\]",correctOption:"\\frac{-1}{8}",incorrectOptions:["\\frac{1}{8}","\\frac{7}{9}","\\frac{7}{8}"]},

{equation:"\\[ {\\frac{3}{4}-\\frac{2}{7}=?} \\]",correctOption:"\\frac{13}{28}",incorrectOptions:["\\frac{2}{3}","\\frac{2}{3}","\\frac{6}{7}"]},

{equation:"\\[ {\\frac{2}{9}-\\frac{1}{9}=?} \\]",correctOption:"\\frac{1}{9}",incorrectOptions:["\\frac{7}{10}","\\frac{2}{5}","\\frac{5}{8}"]},

{equation:"\\[ {\\frac{3}{10}-\\frac{7}{10}=?} \\]",correctOption:"\\frac{-2}{5}",incorrectOptions:["\\frac{7}{10}","\\frac{1}{4}","\\frac{1}{8}"]},

{equation:"\\[ {\\frac{1}{7}-\\frac{4}{9}=?} \\]",correctOption:"\\frac{-19}{63}",incorrectOptions:["\\frac{5}{8}","\\frac{5}{7}","\\frac{1}{10}"]},

{equation:"\\[ {\\frac{2}{7}-\\frac{2}{5}=?} \\]",correctOption:"\\frac{-4}{35}",incorrectOptions:["\\frac{1}{4}","\\frac{2}{3}","\\frac{8}{9}"]},

{equation:"\\[ {\\frac{4}{5}-\\frac{2}{5}=?} \\]",correctOption:"\\frac{2}{5}",incorrectOptions:["\\frac{4}{9}","\\frac{3}{10}","\\frac{3}{10}"]},




        ];

        const 分数混合运算 = [
           {equation:"8\\frac{1}{7}=?} \\]",correctOption:"\\frac{57}{7}",incorrectOptions:["\\frac{24}{7}","\\frac{9}{7}","\\frac{45}{7}",]},

          {equation:"7\\frac{1}{6}=?} \\]",correctOption:"\\frac{43}{6}",incorrectOptions:["\\frac{56}{6}","\\frac{72}{6}","\\frac{5}{6}",]},

          {equation:"7\\frac{1}{7}=?} \\]",correctOption:"\\frac{50}{7}",incorrectOptions:["\\frac{72}{7}","\\frac{3}{7}","\\frac{42}{7}",]}, 
{equation:"\\[ {\\frac{1}{8}\\times\\frac{4}{5}=?} \\]",correctOption:"\\frac{1}{10}",incorrectOptions:["\\frac{7}{40}","\\frac{1}{4}","\\frac{7}{20}"]},

{equation:"\\[ {\\frac{7}{8}\\times\\frac{5}{6}=?} \\]",correctOption:"\\frac{35}{48}",incorrectOptions:["\\frac{21}{16}","\\frac{7}{48}","\\frac{15}{8}"]},

{equation:"\\[ {\\frac{2}{5}\\times\\frac{7}{10}=?} \\]",correctOption:"\\frac{7}{25}",incorrectOptions:["\\frac{21}{25}","\\frac{14}{25}","\\frac{21}{50}"]},

{equation:"\\[ {\\frac{8}{9}\\times\\frac{3}{8}=?} \\]",correctOption:"\\frac{1}{3}",incorrectOptions:["\\frac{35}{36}","\\frac{7}{12}","\\frac{7}{72}"]},

{equation:"\\[ {\\frac{3}{4}\\times\\frac{6}{7}=?} \\]",correctOption:"\\frac{9}{14}",incorrectOptions:["\\frac{15}{14}","\\frac{3}{28}","\\frac{3}{14}"]},

{equation:"\\[ {\\frac{3}{7}\\times\\frac{3}{7}=?} \\]",correctOption:"\\frac{9}{49}",incorrectOptions:["\\frac{40}{49}","\\frac{6}{49}","\\frac{4}{7}"]},

{equation:"\\[ {\\frac{4}{9}\\times\\frac{6}{7}=?} \\]",correctOption:"\\frac{8}{21}",incorrectOptions:["\\frac{4}{63}","\\frac{10}{63}","\\frac{10}{21}"]},

{equation:"\\[ {\\frac{3}{5}\\times\\frac{1}{10}=?} \\]",correctOption:"\\frac{3}{50}",incorrectOptions:["\\frac{7}{50}","\\frac{14}{25}","\\frac{3}{5}"]},

{equation:"\\[ {\\frac{4}{9}\\times\\frac{1}{2}=?} \\]",correctOption:"\\frac{2}{9}",incorrectOptions:["\\frac{1}{9}","\\frac{7}{3}",2]},

{equation:"\\[ {\\frac{1}{9}\\times\\frac{1}{10}=?} \\]",correctOption:"\\frac{1}{90}",incorrectOptions:["\\frac{7}{15}","\\frac{2}{9}","\\frac{1}{18}"]},

{equation:"\\[ {\\frac{7}{10}\\times\\frac{2}{7}=?} \\]",correctOption:"\\frac{1}{5}",incorrectOptions:["\\frac{6}{35}","\\frac{3}{10}","\\frac{9}{14}"]},

{equation:"\\[ {\\frac{1}{9}\\times\\frac{5}{9}=?} \\]",correctOption:"\\frac{5}{81}",incorrectOptions:["\\frac{10}{81}","\\frac{10}{27}","\\frac{8}{9}"]},

{equation:"\\[ {\\frac{2}{9}\\times\\frac{3}{10}=?} \\]",correctOption:"\\frac{1}{15}",incorrectOptions:["\\frac{28}{45}","\\frac{1}{3}","\\frac{1}{10}"]},

{equation:"\\[ {\\frac{1}{10}\\times\\frac{2}{9}=?} \\]",correctOption:"\\frac{1}{45}",incorrectOptions:["\\frac{4}{5}","\\frac{1}{9}","\\frac{28}{45}"]},

{equation:"\\[ {\\frac{2}{7}\\times\\frac{7}{8}=?} \\]",correctOption:"\\frac{1}{4}",incorrectOptions:["\\frac{5}{28}","\\frac{5}{7}","\\frac{3}{56}"]},

{equation:"\\[ {\\frac{3}{4}\\times\\frac{3}{7}=?} \\]",correctOption:"\\frac{9}{28}",incorrectOptions:["\\frac{3}{14}","\\frac{1}{2}","\\frac{9}{7}"]},

{equation:"\\[ {\\frac{5}{9}\\times\\frac{3}{8}=?} \\]",correctOption:"\\frac{5}{24}",incorrectOptions:["\\frac{1}{6}","\\frac{5}{12}","\\frac{5}{72}"]},

{equation:"\\[ {\\frac{3}{4}\\times\\frac{3}{8}=?} \\]",correctOption:"\\frac{9}{32}",incorrectOptions:["\\frac{15}{32}","\\frac{5}{8}","\\frac{63}{32}"]},

{equation:"\\[ {\\frac{5}{7}\\times\\frac{4}{9}=?} \\]",correctOption:"\\frac{20}{63}",incorrectOptions:["\\frac{1}{9}","\\frac{2}{21}","\\frac{8}{7}"]},

{equation:"\\[ {\\frac{4}{9}\\times\\frac{1}{5}=?} \\]",correctOption:"\\frac{4}{45}",incorrectOptions:["\\frac{4}{5}","\\frac{14}{9}","\\frac{2}{3}"]},

{equation:"\\[ {\\frac{1}{7}\\times\\frac{3}{4}=?} \\]",correctOption:"\\frac{3}{28}",incorrectOptions:["\\frac{9}{14}","\\frac{15}{14}","\\frac{9}{28}"]},

{equation:"\\[ {\\frac{1}{5}\\times\\frac{8}{9}=?} \\]",correctOption:"\\frac{8}{45}",incorrectOptions:["\\frac{28}{45}","\\frac{2}{3}","\\frac{1}{5}"]},

{equation:"\\[ {\\frac{3}{4}\\times\\frac{1}{8}=?} \\]",correctOption:"\\frac{3}{32}",incorrectOptions:["\\frac{63}{32}","\\frac{7}{4}","\\frac{7}{32}"]},

{equation:"\\[ {\\frac{5}{9}\\times\\frac{6}{7}=?} \\]",correctOption:"\\frac{10}{21}",incorrectOptions:["\\frac{5}{63}","\\frac{1}{21}","\\frac{5}{9}"]},

{equation:"\\[ {\\frac{1}{5}\\times\\frac{2}{9}=?} \\]",correctOption:"\\frac{2}{45}",incorrectOptions:["\\frac{7}{9}","\\frac{8}{15}","\\frac{2}{3}"]},

{equation:"\\[ {\\frac{3}{4}\\times\\frac{1}{10}=?} \\]",correctOption:"\\frac{3}{40}",incorrectOptions:["\\frac{9}{20}","\\frac{1}{4}","\\frac{9}{8}"]},

{equation:"\\[ {\\frac{3}{5}\\times\\frac{1}{8}=?} \\]",correctOption:"\\frac{3}{40}",incorrectOptions:["\\frac{3}{20}","\\frac{1}{4}","\\frac{9}{4}"]},

{equation:"\\[ {\\frac{4}{7}\\times\\frac{4}{9}=?} \\]",correctOption:"\\frac{16}{63}",incorrectOptions:["\\frac{5}{63}","\\frac{40}{63}","\\frac{4}{9}"]},

{equation:"\\[ {\\frac{1}{3}\\times\\frac{9}{10}=?} \\]",correctOption:"\\frac{3}{10}",incorrectOptions:["\\frac{7}{3}","\\frac{2}{3}","\\frac{4}{5}"]},

{equation:"\\[ {\\frac{3}{10}\\times\\frac{1}{6}=?} \\]",correctOption:"\\frac{1}{20}",incorrectOptions:["\\frac{2}{3}","\\frac{7}{10}","\\frac{3}{10}"]},
{equation:"\\[ {\\frac{5}{6}\\div\\frac{4}{9}=?} \\]",correctOption:"\\frac{15}{8}",incorrectOptions:[3,"\\frac{1}{4}","\\frac{21}{8}"]},

{equation:"\\[ {\\frac{9}{10}\\div\\frac{1}{7}=?} \\]",correctOption:"\\frac{63}{10}",incorrectOptions:["\\frac{1}{5}","\\frac{6}{5}","\\frac{12}{5}"]},

{equation:"\\[ {\\frac{1}{3}\\div\\frac{7}{5}=?} \\]",correctOption:"\\frac{5}{21}",incorrectOptions:["\\frac{10}{21}","\\frac{1}{3}","\\frac{4}{3}"]},

{equation:"\\[ {\\frac{9}{10}\\div\\frac{10}{3}=?} \\]",correctOption:"\\frac{27}{100}",incorrectOptions:["\\frac{9}{100}","\\frac{7}{10}","\\frac{1}{50}"]},

{equation:"\\[ {\\frac{2}{5}\\div\\frac{3}{2}=?} \\]",correctOption:"\\frac{4}{15}",incorrectOptions:[3,"\\frac{14}{5}","\\frac{21}{5}"]},

{equation:"\\[ {\\frac{8}{9}\\div\\frac{1}{4}=?} \\]",correctOption:"\\frac{32}{9}",incorrectOptions:["\\frac{56}{9}","\\frac{5}{9}","\\frac{20}{9}"]},

{equation:"\\[ {\\frac{8}{9}\\div\\frac{1}{7}=?} \\]",correctOption:"\\frac{56}{9}",incorrectOptions:["\\frac{8}{3}","\\frac{70}{9}","\\frac{7}{3}"]},

{equation:"\\[ {\\frac{3}{5}\\div\\frac{5}{7}=?} \\]",correctOption:"\\frac{21}{25}",incorrectOptions:["\\frac{6}{25}","\\frac{18}{25}","\\frac{63}{25}"]},

{equation:"\\[ {\\frac{5}{6}\\div\\frac{3}{4}=?} \\]",correctOption:"\\frac{10}{9}",incorrectOptions:[4,"\\frac{2}{9}","\\frac{5}{6}"]},

{equation:"\\[ {\\frac{2}{3}\\div\\frac{7}{8}=?} \\]",correctOption:"\\frac{16}{21}",incorrectOptions:["\\frac{5}{3}","\\frac{6}{7}","\\frac{2}{21}"]},

{equation:"\\[ {\\frac{1}{3}\\div\\frac{3}{5}=?} \\]",correctOption:"\\frac{5}{9}",incorrectOptions:["\\frac{10}{3}","\\frac{4}{9}","\\frac{20}{9}"]},

{equation:"\\[ {\\frac{8}{9}\\div\\frac{1}{7}=?} \\]",correctOption:"\\frac{56}{9}",incorrectOptions:["\\frac{7}{9}","\\frac{4}{9}","\\frac{14}{9}"]},

{equation:"\\[ {\\frac{8}{9}\\div\\frac{1}{8}=?} \\]",correctOption:"\\frac{64}{9}",incorrectOptions:["\\frac{5}{9}","\\frac{2}{3}","\\frac{10}{9}"]},

{equation:"\\[ {\\frac{4}{5}\\div\\frac{3}{5}=?} \\]",correctOption:"\\frac{4}{3}",incorrectOptions:[2,"\\frac{6}{5}","\\frac{21}{5}"]},

{equation:"\\[ {\\frac{1}{6}\\div\\frac{3}{1}=?} \\]",correctOption:"\\frac{1}{18}",incorrectOptions:["\\frac{35}{18}","\\frac{5}{3}","\\frac{5}{9}"]},

{equation:"\\[ {\\frac{3}{4}\\div\\frac{7}{6}=?} \\]",correctOption:"\\frac{9}{14}",incorrectOptions:["\\frac{5}{4}","\\frac{5}{14}","\\frac{1}{7}"]},

{equation:"\\[ {\\frac{1}{8}\\div\\frac{7}{9}=?} \\]",correctOption:"\\frac{9}{56}",incorrectOptions:["\\frac{3}{4}","\\frac{1}{7}","\\frac{3}{14}"]},

{equation:"\\[ {\\frac{7}{10}\\div\\frac{7}{6}=?} \\]",correctOption:"\\frac{3}{5}",incorrectOptions:["\\frac{18}{35}","\\frac{12}{35}","\\frac{1}{7}"]},

{equation:"\\[ {\\frac{1}{7}\\div\\frac{7}{4}=?} \\]",correctOption:"\\frac{4}{49}",incorrectOptions:["\\frac{18}{49}","\\frac{9}{49}","\\frac{15}{49}"]},

{equation:"\\[ {\\frac{3}{5}\\div\\frac{1}{10}=?} \\]",correctOption:"6",incorrectOptions:["\\frac{72}{5}","\\frac{24}{5}","\\frac{14}{5}"]},

{equation:"\\[ {\\frac{5}{8}\\div\\frac{10}{7}=?} \\]",correctOption:"\\frac{7}{16}",incorrectOptions:["\\frac{3}{20}","\\frac{9}{10}","\\frac{1}{10}"]},

{equation:"\\[ {\\frac{7}{9}\\div\\frac{2}{9}=?} \\]",correctOption:"\\frac{7}{2}",incorrectOptions:["\\frac{35}{18}","\\frac{7}{18}","\\frac{20}{9}"]},

{equation:"\\[ {\\frac{5}{8}\\div\\frac{8}{3}=?} \\]",correctOption:"\\frac{15}{64}",incorrectOptions:["\\frac{9}{64}","\\frac{9}{32}","\\frac{15}{32}"]},

{equation:"\\[ {\\frac{3}{10}\\div\\frac{3}{4}=?} \\]",correctOption:"\\frac{2}{5}",incorrectOptions:["\\frac{14}{15}","\\frac{1}{2}","\\frac{1}{6}"]},

{equation:"\\[ {\\frac{4}{7}\\div\\frac{7}{8}=?} \\]",correctOption:"\\frac{32}{49}",incorrectOptions:["\\frac{45}{49}","\\frac{10}{49}","\\frac{9}{49}"]},

{equation:"\\[ {\\frac{2}{9}\\div\\frac{8}{3}=?} \\]",correctOption:"\\frac{1}{12}",incorrectOptions:[1,"\\frac{5}{36}","\\frac{5}{24}"]},

{equation:"\\[ {\\frac{1}{6}\\div\\frac{5}{3}=?} \\]",correctOption:"\\frac{1}{10}",incorrectOptions:["\\frac{3}{5}","\\frac{1}{5}","\\frac{2}{3}"]},

{equation:"\\[ {\\frac{5}{9}\\div\\frac{1}{5}=?} \\]",correctOption:"\\frac{25}{9}",incorrectOptions:["\\frac{4}{9}","\\frac{8}{3}",5]},

{equation:"\\[ {\\frac{3}{7}\\div\\frac{3}{4}=?} \\]",correctOption:"\\frac{4}{7}",incorrectOptions:["\\frac{5}{21}","\\frac{15}{7}","\\frac{12}{7}"]},

{equation:"\\[ {\\frac{1}{5}\\div\\frac{5}{4}=?} \\]",correctOption:"\\frac{4}{25}",incorrectOptions:["\\frac{14}{25}","\\frac{42}{25}","\\frac{9}{5}"]},
{equation:"\\[ {\\frac{1}{9}+8=?} \\]",correctOption:"\\frac{73}{9}",incorrectOptions:["\\frac{42}{9}","\\frac{20}{9}","\\frac{7}{9}",]},

{equation:"\\[ {\\frac{3}{7}+9=?} \\]",correctOption:"\\frac{66}{7}",incorrectOptions:["\\frac{42}{7}","\\frac{30}{7}","\\frac{4}{7}",]},

{equation:"\\[ {\\frac{4}{7}+7=?} \\]",correctOption:"\\frac{53}{7}",incorrectOptions:["\\frac{2}{7}","\\frac{42}{7}","\\frac{21}{7}",]},

{equation:"\\[ {\\frac{4}{9}+7=?} \\]",correctOption:"\\frac{67}{9}",incorrectOptions:["\\frac{7}{9}","\\frac{24}{9}","\\frac{9}{9}",]},

{equation:"\\[ {\\frac{5}{9}+1=?} \\]",correctOption:"\\frac{14}{9}",incorrectOptions:["\\frac{30}{9}","\\frac{9}{9}","\\frac{8}{9}",]},

{equation:"\\[ {\\frac{8}{9}+2=?} \\]",correctOption:"\\frac{26}{9}",incorrectOptions:["\\frac{15}{9}","\\frac{30}{9}","\\frac{45}{9}",]},

{equation:"\\[ {\\frac{7}{8}+9=?} \\]",correctOption:"\\frac{79}{8}",incorrectOptions:["\\frac{63}{8}","\\frac{3}{8}","\\frac{4}{8}",]},

{equation:"\\[ {\\frac{1}{6}+2=?} \\]",correctOption:"\\frac{13}{6}",incorrectOptions:["\\frac{45}{6}","\\frac{7}{6}","\\frac{3}{6}",]},

{equation:"\\[ {\\frac{7}{10}+3=?} \\]",correctOption:"\\frac{37}{10}",incorrectOptions:["\\frac{7}{10}","\\frac{20}{10}","\\frac{30}{10}",]},

{equation:"\\[ {\\frac{1}{9}+3=?} \\]",correctOption:"\\frac{28}{9}",incorrectOptions:["\\frac{30}{9}","\\frac{26}{9}","\\frac{6}{9}",]},

{equation:"\\[ {\\frac{2}{3}+8=?} \\]",correctOption:"\\frac{26}{3}",incorrectOptions:["\\frac{6}{3}","\\frac{4}{3}","\\frac{30}{3}",]},

{equation:"\\[ {\\frac{3}{4}+2=?} \\]",correctOption:"\\frac{11}{4}",incorrectOptions:["\\frac{5}{4}","\\frac{12}{4}","\\frac{42}{4}",]},

{equation:"\\[ {\\frac{4}{5}+7=?} \\]",correctOption:"\\frac{39}{5}",incorrectOptions:["\\frac{6}{5}","\\frac{21}{5}","\\frac{90}{5}",]},

{equation:"\\[ {\\frac{4}{7}+6=?} \\]",correctOption:"\\frac{46}{7}",incorrectOptions:["\\frac{2}{7}","\\frac{45}{7}","\\frac{7}{7}",]},

{equation:"\\[ {\\frac{1}{7}+2=?} \\]",correctOption:"\\frac{15}{7}",incorrectOptions:["\\frac{12}{7}","\\frac{9}{7}","\\frac{72}{7}",]},

{equation:"\\[ {\\frac{5}{7}+6=?} \\]",correctOption:"\\frac{47}{7}",incorrectOptions:["\\frac{30}{7}","\\frac{9}{7}","\\frac{63}{7}",]},

{equation:"\\[ {\\frac{4}{5}+10=?} \\]",correctOption:"\\frac{54}{5}",incorrectOptions:["\\frac{15}{5}","\\frac{40}{5}","\\frac{5}{5}",]},

{equation:"\\[ {\\frac{2}{3}+4=?} \\]",correctOption:"\\frac{14}{3}",incorrectOptions:["\\frac{24}{3}","\\frac{90}{3}","\\frac{9}{3}",]},

{equation:"\\[ {\\frac{3}{7}+5=?} \\]",correctOption:"\\frac{38}{7}",incorrectOptions:["\\frac{40}{7}","\\frac{72}{7}","\\frac{9}{7}",]},

{equation:"\\[ {\\frac{7}{9}+10=?} \\]",correctOption:"\\frac{97}{9}",incorrectOptions:["\\frac{20}{9}","\\frac{10}{9}","\\frac{28}{9}",]},

{equation:"\\[ {\\frac{7}{10}+5=?} \\]",correctOption:"\\frac{57}{10}",incorrectOptions:["\\frac{6}{10}","\\frac{8}{10}","\\frac{7}{10}",]},

{equation:"\\[ {\\frac{5}{6}+1=?} \\]",correctOption:"\\frac{11}{6}",incorrectOptions:["\\frac{21}{6}","\\frac{40}{6}","\\frac{12}{6}",]},

{equation:"\\[ {\\frac{3}{4}+3=?} \\]",correctOption:"\\frac{15}{4}",incorrectOptions:["\\frac{28}{4}","\\frac{18}{4}","\\frac{6}{4}",]},

{equation:"\\[ {\\frac{7}{10}+9=?} \\]",correctOption:"\\frac{97}{10}",incorrectOptions:["\\frac{6}{10}","\\frac{21}{10}","\\frac{10}{10}",]},

{equation:"\\[ {\\frac{3}{7}+8=?} \\]",correctOption:"\\frac{59}{7}",incorrectOptions:["\\frac{6}{7}","\\frac{24}{7}","\\frac{7}{7}",]},

{equation:"\\[ {\\frac{3}{7}+6=?} \\]",correctOption:"\\frac{45}{7}",incorrectOptions:["\\frac{7}{7}","\\frac{20}{7}","\\frac{24}{7}",]},

{equation:"\\[ {\\frac{2}{9}+2=?} \\]",correctOption:"\\frac{20}{9}",incorrectOptions:["\\frac{6}{9}","\\frac{40}{9}","\\frac{56}{9}",]},

{equation:"\\[ {\\frac{2}{5}+3=?} \\]",correctOption:"\\frac{17}{5}",incorrectOptions:["\\frac{42}{5}","\\frac{8}{5}","\\frac{18}{5}",]},

{equation:"\\[ {\\frac{2}{9}+9=?} \\]",correctOption:"\\frac{83}{9}",incorrectOptions:["\\frac{90}{9}","\\frac{45}{9}","\\frac{2}{9}",]},

{equation:"\\[ {\\frac{2}{5}+2=?} \\]",correctOption:"\\frac{12}{5}",incorrectOptions:["\\frac{6}{5}","\\frac{20}{5}","\\frac{63}{5}",]},

{equation:"\\[ {\\frac{3}{10}+6=?} \\]",correctOption:"\\frac{63}{10}",incorrectOptions:["\\frac{6}{10}","\\frac{15}{10}","\\frac{14}{10}",]},

{equation:"\\[ {\\frac{2}{3}+10=?} \\]",correctOption:"\\frac{32}{3}",incorrectOptions:["\\frac{21}{3}","\\frac{28}{3}","\\frac{45}{3}",]},

{equation:"\\[ {\\frac{4}{7}+7=?} \\]",correctOption:"\\frac{53}{7}",incorrectOptions:["\\frac{21}{7}","\\frac{42}{7}","\\frac{2}{7}",]},

{equation:"\\[ {\\frac{1}{4}+9=?} \\]",correctOption:"\\frac{37}{4}",incorrectOptions:["\\frac{30}{4}","\\frac{3}{4}","\\frac{15}{4}",]},

{equation:"\\[ {\\frac{1}{2}+10=?} \\]",correctOption:"\\frac{21}{2}",incorrectOptions:["\\frac{56}{2}","\\frac{42}{2}","\\frac{2}{2}",]},

{equation:"\\[ {\\frac{3}{10}+2=?} \\]",correctOption:"\\frac{23}{10}",incorrectOptions:["\\frac{63}{10}","\\frac{10}{10}","\\frac{42}{10}",]},

{equation:"\\[ {\\frac{2}{7}+10=?} \\]",correctOption:"\\frac{72}{7}",incorrectOptions:["\\frac{15}{7}","\\frac{12}{7}","\\frac{24}{7}",]},

{equation:"\\[ {\\frac{3}{10}+3=?} \\]",correctOption:"\\frac{33}{10}",incorrectOptions:["\\frac{70}{10}","\\frac{10}{10}","\\frac{18}{10}",]},

{equation:"\\[ {\\frac{2}{5}+6=?} \\]",correctOption:"\\frac{32}{5}",incorrectOptions:["\\frac{21}{5}","\\frac{90}{5}","\\frac{40}{5}",]},

{equation:"\\[ {\\frac{7}{10}+4=?} \\]",correctOption:"\\frac{47}{10}",incorrectOptions:["\\frac{12}{10}","\\frac{30}{10}","\\frac{18}{10}",]},

{equation:"\\[ {\\frac{9}{10}+3=?} \\]",correctOption:"\\frac{39}{10}",incorrectOptions:["\\frac{10}{10}","\\frac{9}{10}","\\frac{72}{10}",]},

{equation:"\\[ {\\frac{5}{9}+8=?} \\]",correctOption:"\\frac{77}{9}",incorrectOptions:["\\frac{10}{9}","\\frac{35}{9}","\\frac{56}{9}",]},

{equation:"\\[ {\\frac{1}{6}+4=?} \\]",correctOption:"\\frac{25}{6}",incorrectOptions:["\\frac{40}{6}","\\frac{15}{6}","\\frac{7}{6}",]},

{equation:"\\[ {\\frac{4}{7}+8=?} \\]",correctOption:"\\frac{60}{7}",incorrectOptions:["\\frac{9}{7}","\\frac{45}{7}","\\frac{35}{7}",]},

{equation:"\\[ {\\frac{3}{10}+9=?} \\]",correctOption:"\\frac{93}{10}",incorrectOptions:["\\frac{8}{10}","\\frac{10}{10}","\\frac{6}{10}",]},

{equation:"\\[ {\\frac{4}{7}+9=?} \\]",correctOption:"\\frac{67}{7}",incorrectOptions:["\\frac{90}{7}","\\frac{40}{7}","\\frac{7}{7}",]},

{equation:"\\[ {\\frac{4}{9}+10=?} \\]",correctOption:"\\frac{94}{9}",incorrectOptions:["\\frac{8}{9}","\\frac{2}{9}","\\frac{6}{9}",]},

{equation:"\\[ {\\frac{2}{3}+8=?} \\]",correctOption:"\\frac{26}{3}",incorrectOptions:["\\frac{12}{3}","\\frac{70}{3}","\\frac{42}{3}",]},

{equation:"\\[ {\\frac{3}{4}+4=?} \\]",correctOption:"\\frac{19}{4}",incorrectOptions:["\\frac{24}{4}","\\frac{10}{4}","\\frac{30}{4}",]},

{equation:"\\[ {\\frac{5}{9}+6=?} \\]",correctOption:"\\frac{59}{9}",incorrectOptions:["\\frac{6}{9}","\\frac{8}{9}","\\frac{14}{9}",]},



        ];



        const 二元一次方程组 = [
{equation: "\\[ {\\begin{cases} 2x-y=-9 \\\\ -6x-4y=-8\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-2 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=14\\end{cases}","\\begin{cases} x=12 \\\\ y=10\\end{cases}","\\begin{cases} x=7 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=-28 \\\\ -6x-2y=52\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=5\\end{cases}","\\begin{cases} x=1 \\\\ y=3\\end{cases}","\\begin{cases} x=4 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-y=-25 \\\\ -6x-4y=26\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=3\\end{cases}","\\begin{cases} x=3 \\\\ y=15\\end{cases}","\\begin{cases} x=5 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-3y=-18 \\\\ -4x-4y=-44\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=12\\end{cases}","\\begin{cases} x=10 \\\\ y=6\\end{cases}","\\begin{cases} x=1 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=-9 \\\\ -4x-4y=-4\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-2 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=6\\end{cases}","\\begin{cases} x=2 \\\\ y=10\\end{cases}","\\begin{cases} x=5 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-3y=-7 \\\\ -5x-4y=-17\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=1\\end{cases}","\\begin{cases} x=5 \\\\ y=6\\end{cases}","\\begin{cases} x=4 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-3y=-33 \\\\ -6x-4y=34\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=15 \\\\ y=7\\end{cases}","\\begin{cases} x=12 \\\\ y=10\\end{cases}","\\begin{cases} x=8 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-y=-3 \\\\ -4x-4y=0\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-1 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=14 \\\\ y=4\\end{cases}","\\begin{cases} x=4 \\\\ y=14\\end{cases}","\\begin{cases} x=10 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x-3y=-39 \\\\ -3x-4y=-8\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-4 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=11\\end{cases}","\\begin{cases} x=13 \\\\ y=1\\end{cases}","\\begin{cases} x=7 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x-2y=-51 \\\\ -2x-3y=-10\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=3\\end{cases}","\\begin{cases} x=6 \\\\ y=5\\end{cases}","\\begin{cases} x=9 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=-11 \\\\ -6x-4y=-8\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-2 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=11\\end{cases}","\\begin{cases} x=4 \\\\ y=1\\end{cases}","\\begin{cases} x=10 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x-y=-31 \\\\ -6x-3y=12\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-5 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=8\\end{cases}","\\begin{cases} x=5 \\\\ y=11\\end{cases}","\\begin{cases} x=4 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-y=-15 \\\\ -4x-3y=25\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=10\\end{cases}","\\begin{cases} x=7 \\\\ y=4\\end{cases}","\\begin{cases} x=8 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-y=14 \\\\ -6x-3y=-48\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=5 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=2\\end{cases}","\\begin{cases} x=3 \\\\ y=8\\end{cases}","\\begin{cases} x=7 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-y=0 \\\\ -6x-2y=-14\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=1\\end{cases}","\\begin{cases} x=2 \\\\ y=9\\end{cases}","\\begin{cases} x=3 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-y=-9 \\\\ -3x-3y=3\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-2 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=13\\end{cases}","\\begin{cases} x=4 \\\\ y=4\\end{cases}","\\begin{cases} x=1 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-y=5 \\\\ -3x-4y=-46\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=6 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=14 \\\\ y=3\\end{cases}","\\begin{cases} x=2 \\\\ y=11\\end{cases}","\\begin{cases} x=7 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-y=-19 \\\\ -6x-4y=8\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-6 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=10\\end{cases}","\\begin{cases} x=7 \\\\ y=1\\end{cases}","\\begin{cases} x=2 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x-y=-19 \\\\ -3x-4y=-7\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-3 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=13\\end{cases}","\\begin{cases} x=15 \\\\ y=9\\end{cases}","\\begin{cases} x=4 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-2y=-22 \\\\ -6x-3y=27\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-5 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=12\\end{cases}","\\begin{cases} x=3 \\\\ y=6\\end{cases}","\\begin{cases} x=6 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x-y=-22 \\\\ -4x-4y=-16\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-3 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=11\\end{cases}","\\begin{cases} x=9 \\\\ y=10\\end{cases}","\\begin{cases} x=2 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=1 \\\\ -2x-2y=-6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=2\\end{cases} ",incorrectOptions:["\\begin{cases} x=8 \\\\ y=11\\end{cases}","\\begin{cases} x=11 \\\\ y=5\\end{cases}","\\begin{cases} x=9 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-y=-4 \\\\ -4x-4y=-36\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=8 \\\\ y=5\\end{cases}","\\begin{cases} x=8 \\\\ y=2\\end{cases}","\\begin{cases} x=4 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x-y=-43 \\\\ -6x-2y=40\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=4\\end{cases}","\\begin{cases} x=3 \\\\ y=13\\end{cases}","\\begin{cases} x=7 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-2y=-2 \\\\ -2x-3y=-3\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=0 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=15\\end{cases}","\\begin{cases} x=10 \\\\ y=9\\end{cases}","\\begin{cases} x=10 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-3y=-6 \\\\ -2x-4y=-2\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-1 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=13\\end{cases}","\\begin{cases} x=15 \\\\ y=8\\end{cases}","\\begin{cases} x=2 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-2y=-44 \\\\ -5x-3y=29\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-10 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=2\\end{cases}","\\begin{cases} x=11 \\\\ y=3\\end{cases}","\\begin{cases} x=1 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-2y=-23 \\\\ -6x-3y=39\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=14 \\\\ y=5\\end{cases}","\\begin{cases} x=1 \\\\ y=8\\end{cases}","\\begin{cases} x=8 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x-y=-29 \\\\ -4x-4y=-4\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-4 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=2\\end{cases}","\\begin{cases} x=3 \\\\ y=12\\end{cases}","\\begin{cases} x=3 \\\\ y=6\\end{cases}",]},
{equation: "\\[ {\\begin{cases} 3x-y=4 \\\\ 5x+3y=30\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=6\\end{cases}","\\begin{cases} x=9 \\\\ y=14\\end{cases}","\\begin{cases} x=7 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x-y=10 \\\\ 4x+3y=36\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=1\\end{cases}","\\begin{cases} x=5 \\\\ y=15\\end{cases}","\\begin{cases} x=7 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-y=3 \\\\ 5x+3y=25\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=11\\end{cases}","\\begin{cases} x=14 \\\\ y=9\\end{cases}","\\begin{cases} x=5 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=1 \\\\ 6x+4y=32\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=10\\end{cases}","\\begin{cases} x=6 \\\\ y=7\\end{cases}","\\begin{cases} x=1 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x-y=1 \\\\ 2x+3y=21\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=1\\end{cases}","\\begin{cases} x=8 \\\\ y=1\\end{cases}","\\begin{cases} x=1 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=-1 \\\\ 4x+4y=20\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=15\\end{cases}","\\begin{cases} x=5 \\\\ y=1\\end{cases}","\\begin{cases} x=10 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-y=-32 \\\\ 3x+2y=-13\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=7\\end{cases}","\\begin{cases} x=4 \\\\ y=3\\end{cases}","\\begin{cases} x=10 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x-y=15 \\\\ 5x+4y=40\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=2\\end{cases}","\\begin{cases} x=7 \\\\ y=15\\end{cases}","\\begin{cases} x=7 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=13 \\\\ 4x+2y=44\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=7 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=5\\end{cases}","\\begin{cases} x=13 \\\\ y=7\\end{cases}","\\begin{cases} x=2 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x-y=7 \\\\ 4x+4y=32\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=6\\end{cases}","\\begin{cases} x=10 \\\\ y=7\\end{cases}","\\begin{cases} x=10 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=5 \\\\ 3x+4y=25\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=7\\end{cases}","\\begin{cases} x=9 \\\\ y=6\\end{cases}","\\begin{cases} x=9 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x-y=-28 \\\\ 6x+2y=-52\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=3\\end{cases}","\\begin{cases} x=10 \\\\ y=11\\end{cases}","\\begin{cases} x=10 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x-y=-43 \\\\ 5x+2y=-34\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-8 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=10\\end{cases}","\\begin{cases} x=14 \\\\ y=10\\end{cases}","\\begin{cases} x=2 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x-2y=0 \\\\ 4x+3y=13\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=12\\end{cases}","\\begin{cases} x=8 \\\\ y=7\\end{cases}","\\begin{cases} x=6 \\\\ y=6\\end{cases}",]},
{equation: "\\[ {\\begin{cases} 4x+3y=-13 \\\\ 3x+4y=-8\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-4 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=2\\end{cases}","\\begin{cases} x=1 \\\\ y=5\\end{cases}","\\begin{cases} x=4 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+y=-23 \\\\ 5x+3y=-29\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-10 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=13\\end{cases}","\\begin{cases} x=10 \\\\ y=4\\end{cases}","\\begin{cases} x=2 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+y=15 \\\\ 2x+2y=18\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=12\\end{cases}","\\begin{cases} x=15 \\\\ y=1\\end{cases}","\\begin{cases} x=4 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+y=-17 \\\\ 2x+2y=-4\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-5 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=10\\end{cases}","\\begin{cases} x=11 \\\\ y=13\\end{cases}","\\begin{cases} x=8 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+2y=-46 \\\\ 3x+3y=-21\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-8 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=10\\end{cases}","\\begin{cases} x=4 \\\\ y=12\\end{cases}","\\begin{cases} x=3 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+y=19 \\\\ 3x+2y=23\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=5 \\\\ y=4\\end{cases}","\\begin{cases} x=9 \\\\ y=11\\end{cases}","\\begin{cases} x=1 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+2y=16 \\\\ 2x+3y=19\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=2\\end{cases}","\\begin{cases} x=15 \\\\ y=15\\end{cases}","\\begin{cases} x=10 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+3y=33 \\\\ 2x+4y=34\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=5 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=15 \\\\ y=7\\end{cases}","\\begin{cases} x=15 \\\\ y=1\\end{cases}","\\begin{cases} x=1 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x+2y=6 \\\\ 6x+3y=-6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-5 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=15\\end{cases}","\\begin{cases} x=14 \\\\ y=12\\end{cases}","\\begin{cases} x=2 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+2y=-7 \\\\ 2x+3y=6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-3 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=14 \\\\ y=6\\end{cases}","\\begin{cases} x=10 \\\\ y=11\\end{cases}","\\begin{cases} x=8 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+3y=-1 \\\\ 5x+4y=-1\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-1 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=13\\end{cases}","\\begin{cases} x=11 \\\\ y=12\\end{cases}","\\begin{cases} x=3 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x+y=-11 \\\\ 3x+3y=-6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=8 \\\\ y=1\\end{cases}","\\begin{cases} x=15 \\\\ y=15\\end{cases}","\\begin{cases} x=5 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x+3y=33 \\\\ 2x+4y=40\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=6 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=3\\end{cases}","\\begin{cases} x=9 \\\\ y=10\\end{cases}","\\begin{cases} x=1 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+y=9 \\\\ 5x+2y=15\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=13\\end{cases}","\\begin{cases} x=10 \\\\ y=10\\end{cases}","\\begin{cases} x=2 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x+y=-17 \\\\ 5x+4y=-41\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=15\\end{cases}","\\begin{cases} x=3 \\\\ y=10\\end{cases}","\\begin{cases} x=7 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x+3y=-15 \\\\ 6x+4y=-50\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=6\\end{cases}","\\begin{cases} x=15 \\\\ y=10\\end{cases}","\\begin{cases} x=6 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+y=-17 \\\\ 6x+3y=-33\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-6 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=2\\end{cases}","\\begin{cases} x=7 \\\\ y=7\\end{cases}","\\begin{cases} x=9 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+3y=6 \\\\ 2x+4y=22\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-3 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=14\\end{cases}","\\begin{cases} x=4 \\\\ y=1\\end{cases}","\\begin{cases} x=1 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+3y=-12 \\\\ 5x+4y=-1\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-5 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=7\\end{cases}","\\begin{cases} x=11 \\\\ y=3\\end{cases}","\\begin{cases} x=4 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+y=13 \\\\ 2x+4y=22\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=1\\end{cases}","\\begin{cases} x=5 \\\\ y=13\\end{cases}","\\begin{cases} x=10 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+y=-14 \\\\ 5x+4y=-11\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-3 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=7\\end{cases}","\\begin{cases} x=7 \\\\ y=11\\end{cases}","\\begin{cases} x=2 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+y=20 \\\\ 6x+3y=33\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=11\\end{cases}","\\begin{cases} x=6 \\\\ y=2\\end{cases}","\\begin{cases} x=5 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+y=-11 \\\\ 2x+4y=-2\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-3 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=13\\end{cases}","\\begin{cases} x=10 \\\\ y=12\\end{cases}","\\begin{cases} x=9 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+3y=37 \\\\ 5x+4y=48\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=15\\end{cases}","\\begin{cases} x=13 \\\\ y=2\\end{cases}","\\begin{cases} x=5 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+y=10 \\\\ 4x+2y=12\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=7\\end{cases}","\\begin{cases} x=11 \\\\ y=7\\end{cases}","\\begin{cases} x=9 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+y=29 \\\\ 6x+3y=66\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=7 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=11\\end{cases}","\\begin{cases} x=3 \\\\ y=12\\end{cases}","\\begin{cases} x=2 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+2y=18 \\\\ 6x+3y=27\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=15\\end{cases}","\\begin{cases} x=3 \\\\ y=7\\end{cases}","\\begin{cases} x=5 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x+y=-1 \\\\ 2x+4y=8\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-2 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=8\\end{cases}","\\begin{cases} x=2 \\\\ y=14\\end{cases}","\\begin{cases} x=1 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+2y=-40 \\\\ 4x+3y=-25\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=8\\end{cases}","\\begin{cases} x=6 \\\\ y=13\\end{cases}","\\begin{cases} x=9 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+y=26 \\\\ 5x+3y=39\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=15 \\\\ y=7\\end{cases}","\\begin{cases} x=14 \\\\ y=5\\end{cases}","\\begin{cases} x=10 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+3y=29 \\\\ 5x+4y=38\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=9\\end{cases}","\\begin{cases} x=8 \\\\ y=15\\end{cases}","\\begin{cases} x=10 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+3y=39 \\\\ 5x+4y=58\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=6 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=13\\end{cases}","\\begin{cases} x=13 \\\\ y=8\\end{cases}","\\begin{cases} x=3 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+3y=-16 \\\\ 5x+4y=-19\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=9\\end{cases}","\\begin{cases} x=9 \\\\ y=9\\end{cases}","\\begin{cases} x=2 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+2y=18 \\\\ 5x+3y=19\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=13 \\\\ y=5\\end{cases}","\\begin{cases} x=12 \\\\ y=9\\end{cases}","\\begin{cases} x=3 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+2y=26 \\\\ 3x+3y=33\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=11\\end{cases}","\\begin{cases} x=7 \\\\ y=14\\end{cases}","\\begin{cases} x=1 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+y=5 \\\\ 6x+2y=10\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=2\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=10\\end{cases}","\\begin{cases} x=2 \\\\ y=5\\end{cases}","\\begin{cases} x=4 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+y=21 \\\\ 6x+4y=44\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=7\\end{cases}","\\begin{cases} x=15 \\\\ y=7\\end{cases}","\\begin{cases} x=7 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+y=20 \\\\ 2x+4y=26\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=3 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=10\\end{cases}","\\begin{cases} x=4 \\\\ y=2\\end{cases}","\\begin{cases} x=1 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+2y=-28 \\\\ 5x+3y=-22\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-5 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=15\\end{cases}","\\begin{cases} x=4 \\\\ y=11\\end{cases}","\\begin{cases} x=4 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 3x+y=13 \\\\ 3x+4y=34\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=2 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=8\\end{cases}","\\begin{cases} x=5 \\\\ y=11\\end{cases}","\\begin{cases} x=5 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+y=13 \\\\ 4x+2y=20\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=1 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=3\\end{cases}","\\begin{cases} x=12 \\\\ y=14\\end{cases}","\\begin{cases} x=4 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 6x+y=37 \\\\ 2x+2y=24\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=5 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=3\\end{cases}","\\begin{cases} x=9 \\\\ y=12\\end{cases}","\\begin{cases} x=10 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+3y=-47 \\\\ 4x+4y=-36\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-10 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=9\\end{cases}","\\begin{cases} x=1 \\\\ y=13\\end{cases}","\\begin{cases} x=7 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 2x+y=-11 \\\\ 3x+2y=-13\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-9 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=12\\end{cases}","\\begin{cases} x=13 \\\\ y=3\\end{cases}","\\begin{cases} x=3 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+3y=-1 \\\\ 4x+4y=0\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-1 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=13 \\\\ y=15\\end{cases}","\\begin{cases} x=5 \\\\ y=4\\end{cases}","\\begin{cases} x=10 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+y=-29 \\\\ 6x+4y=-32\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-6 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=13\\end{cases}","\\begin{cases} x=15 \\\\ y=14\\end{cases}","\\begin{cases} x=10 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 4x+y=-17 \\\\ 4x+2y=-10\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-6 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=2\\end{cases}","\\begin{cases} x=11 \\\\ y=1\\end{cases}","\\begin{cases} x=7 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+y=-7 \\\\ 2x+2y=2\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-2 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=2\\end{cases}","\\begin{cases} x=5 \\\\ y=13\\end{cases}","\\begin{cases} x=10 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+y=-34 \\\\ 3x+3y=-18\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=-7 \\\\ y=1\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=4\\end{cases}","\\begin{cases} x=4 \\\\ y=7\\end{cases}","\\begin{cases} x=1 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} 5x+3y=43 \\\\ 2x+4y=34\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=5 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=14 \\\\ y=8\\end{cases}","\\begin{cases} x=4 \\\\ y=4\\end{cases}","\\begin{cases} x=7 \\\\ y=4\\end{cases}",]},


             ];







        const 分数二元一次方程组01 = [
{equation: "\\[ {\\begin{cases} -\\frac{1}{4}x-2y=-22 \\\\ -\\frac{1}{2}x+3y=26\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=8 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=5 \\\\ y=3\\end{cases}","\\begin{cases} x=8 \\\\ y=7\\end{cases}","\\begin{cases} x=1 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{5}{6}x-y=-35 \\\\ -\\frac{2}{3}x+4y=-4\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=36 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=14 \\\\ y=3\\end{cases}","\\begin{cases} x=2 \\\\ y=3\\end{cases}","\\begin{cases} x=6 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{5}x-3y=-30 \\\\ -\\frac{1}{3}x+4y=23\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=15 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=14\\end{cases}","\\begin{cases} x=6 \\\\ y=5\\end{cases}","\\begin{cases} x=2 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{5}x-y=-17 \\\\ -\\frac{1}{6}x+3y=10\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=30 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=15 \\\\ y=6\\end{cases}","\\begin{cases} x=12 \\\\ y=1\\end{cases}","\\begin{cases} x=3 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-y=-13 \\\\ -\\frac{1}{2}x+4y=32\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=8 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=12\\end{cases}","\\begin{cases} x=15 \\\\ y=5\\end{cases}","\\begin{cases} x=10 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{4}x-2y=-18 \\\\ -\\frac{1}{2}x+3y=14\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=8 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=1\\end{cases}","\\begin{cases} x=6 \\\\ y=5\\end{cases}","\\begin{cases} x=10 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{4}x-y=-11 \\\\ -\\frac{3}{4}x+3y=9\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=16 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=13 \\\\ y=1\\end{cases}","\\begin{cases} x=2 \\\\ y=6\\end{cases}","\\begin{cases} x=10 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{3}x-y=-18 \\\\ -\\frac{3}{5}x+2y=7\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=15 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=8 \\\\ y=6\\end{cases}","\\begin{cases} x=4 \\\\ y=2\\end{cases}","\\begin{cases} x=8 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{3}x-y=-15 \\\\ -\\frac{1}{3}x+3y=24\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=9 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=6\\end{cases}","\\begin{cases} x=15 \\\\ y=12\\end{cases}","\\begin{cases} x=3 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{4}x-3y=-39 \\\\ -\\frac{1}{4}x+4y=32\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=16 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=6\\end{cases}","\\begin{cases} x=11 \\\\ y=1\\end{cases}","\\begin{cases} x=7 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{3}x-y=-18 \\\\ -\\frac{3}{5}x+2y=-2\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=30 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=12\\end{cases}","\\begin{cases} x=3 \\\\ y=13\\end{cases}","\\begin{cases} x=4 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{3}x-3y=-32 \\\\ -\\frac{1}{2}x+4y=26\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=14\\end{cases}","\\begin{cases} x=14 \\\\ y=12\\end{cases}","\\begin{cases} x=9 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{3}x-y=-13 \\\\ -\\frac{1}{3}x+3y=15\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=18 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=10\\end{cases}","\\begin{cases} x=4 \\\\ y=10\\end{cases}","\\begin{cases} x=3 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-3y=-16 \\\\ -\\frac{3}{4}x+4y=10\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=8 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=3\\end{cases}","\\begin{cases} x=11 \\\\ y=7\\end{cases}","\\begin{cases} x=6 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{4}x-y=-12 \\\\ -\\frac{1}{3}x+2y=2\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=4\\end{cases}","\\begin{cases} x=9 \\\\ y=15\\end{cases}","\\begin{cases} x=10 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-y=-10 \\\\ -\\frac{1}{2}x+2y=14\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=15 \\\\ y=12\\end{cases}","\\begin{cases} x=11 \\\\ y=10\\end{cases}","\\begin{cases} x=1 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{4}x-y=-27 \\\\ -\\frac{1}{3}x+4y=28\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=24 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=10\\end{cases}","\\begin{cases} x=7 \\\\ y=14\\end{cases}","\\begin{cases} x=7 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{5}{6}x-y=-37 \\\\ -\\frac{1}{6}x+3y=15\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=36 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=8 \\\\ y=3\\end{cases}","\\begin{cases} x=9 \\\\ y=9\\end{cases}","\\begin{cases} x=7 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{4}x-y=-17 \\\\ -\\frac{1}{4}x+2y=6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=16 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=11\\end{cases}","\\begin{cases} x=13 \\\\ y=3\\end{cases}","\\begin{cases} x=3 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-3y=-31 \\\\ -\\frac{1}{2}x+4y=32\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=8 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=5 \\\\ y=8\\end{cases}","\\begin{cases} x=5 \\\\ y=7\\end{cases}","\\begin{cases} x=5 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{4}x-2y=-22 \\\\ -\\frac{1}{3}x+3y=16\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=24 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=1 \\\\ y=6\\end{cases}","\\begin{cases} x=12 \\\\ y=1\\end{cases}","\\begin{cases} x=5 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{6}x-y=-15 \\\\ -\\frac{1}{3}x+2y=6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=36 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=2\\end{cases}","\\begin{cases} x=2 \\\\ y=12\\end{cases}","\\begin{cases} x=2 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{3}x-y=-13 \\\\ -\\frac{3}{4}x+4y=11\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=6\\end{cases}","\\begin{cases} x=4 \\\\ y=8\\end{cases}","\\begin{cases} x=3 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{4}{5}x-3y=-39 \\\\ -\\frac{1}{3}x+4y=31\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=15 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=6\\end{cases}","\\begin{cases} x=6 \\\\ y=10\\end{cases}","\\begin{cases} x=4 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{6}x-3y=-17 \\\\ -\\frac{1}{5}x+4y=10\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=30 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=9 \\\\ y=10\\end{cases}","\\begin{cases} x=14 \\\\ y=5\\end{cases}","\\begin{cases} x=4 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{4}{5}x-3y=-38 \\\\ -\\frac{1}{2}x+4y=35\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=10 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=15 \\\\ y=1\\end{cases}","\\begin{cases} x=2 \\\\ y=13\\end{cases}","\\begin{cases} x=5 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{4}x-y=-25 \\\\ -\\frac{4}{5}x+3y=14\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=20 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=13 \\\\ y=14\\end{cases}","\\begin{cases} x=5 \\\\ y=6\\end{cases}","\\begin{cases} x=5 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{3}x-y=-13 \\\\ -\\frac{1}{2}x+3y=12\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=18 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=15\\end{cases}","\\begin{cases} x=9 \\\\ y=8\\end{cases}","\\begin{cases} x=9 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{5}x-y=-14 \\\\ -\\frac{1}{4}x+4y=35\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=20 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=8\\end{cases}","\\begin{cases} x=13 \\\\ y=14\\end{cases}","\\begin{cases} x=3 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-y=-18 \\\\ -\\frac{1}{4}x+4y=36\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=16 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=11\\end{cases}","\\begin{cases} x=1 \\\\ y=11\\end{cases}","\\begin{cases} x=10 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-2y=-13 \\\\ -\\frac{1}{3}x+3y=13\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=6 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=3\\end{cases}","\\begin{cases} x=8 \\\\ y=15\\end{cases}","\\begin{cases} x=2 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{3}x-y=-19 \\\\ -\\frac{3}{4}x+3y=-9\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=24 \\\\ y=3\\end{cases} ",incorrectOptions:["\\begin{cases} x=5 \\\\ y=9\\end{cases}","\\begin{cases} x=13 \\\\ y=9\\end{cases}","\\begin{cases} x=3 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-y=-10 \\\\ -\\frac{1}{2}x+4y=30\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=12 \\\\ y=2\\end{cases}","\\begin{cases} x=13 \\\\ y=7\\end{cases}","\\begin{cases} x=10 \\\\ y=5\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{4}{5}x-y=-26 \\\\ -\\frac{1}{5}x+4y=19\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=25 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=15 \\\\ y=13\\end{cases}","\\begin{cases} x=10 \\\\ y=15\\end{cases}","\\begin{cases} x=4 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{3}x-2y=-22 \\\\ -\\frac{1}{4}x+3y=18\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=2\\end{cases}","\\begin{cases} x=14 \\\\ y=2\\end{cases}","\\begin{cases} x=5 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{3}x-2y=-14 \\\\ -\\frac{3}{4}x+3y=6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=5\\end{cases} ",incorrectOptions:["\\begin{cases} x=14 \\\\ y=12\\end{cases}","\\begin{cases} x=11 \\\\ y=14\\end{cases}","\\begin{cases} x=6 \\\\ y=10\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{4}x-2y=-17 \\\\ -\\frac{1}{3}x+3y=17\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=3 \\\\ y=13\\end{cases}","\\begin{cases} x=12 \\\\ y=14\\end{cases}","\\begin{cases} x=5 \\\\ y=6\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{4}x-y=-11 \\\\ -\\frac{1}{3}x+2y=12\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=8\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=5\\end{cases}","\\begin{cases} x=4 \\\\ y=2\\end{cases}","\\begin{cases} x=1 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-y=-12 \\\\ -\\frac{2}{3}x+4y=16\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=6\\end{cases} ",incorrectOptions:["\\begin{cases} x=4 \\\\ y=9\\end{cases}","\\begin{cases} x=12 \\\\ y=14\\end{cases}","\\begin{cases} x=5 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-2y=-23 \\\\ -\\frac{1}{3}x+3y=28\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=6 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=6 \\\\ y=14\\end{cases}","\\begin{cases} x=3 \\\\ y=15\\end{cases}","\\begin{cases} x=9 \\\\ y=3\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{4}x-y=-25 \\\\ -\\frac{1}{5}x+3y=26\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=20 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=13 \\\\ y=6\\end{cases}","\\begin{cases} x=6 \\\\ y=2\\end{cases}","\\begin{cases} x=4 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{5}x-2y=-24 \\\\ -\\frac{1}{6}x+3y=22\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=30 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=5 \\\\ y=8\\end{cases}","\\begin{cases} x=14 \\\\ y=13\\end{cases}","\\begin{cases} x=7 \\\\ y=4\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{2}{5}x-y=-14 \\\\ -\\frac{3}{5}x+2y=-7\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=25 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=2 \\\\ y=9\\end{cases}","\\begin{cases} x=2 \\\\ y=3\\end{cases}","\\begin{cases} x=1 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-y=-11 \\\\ -\\frac{1}{2}x+2y=16\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=5 \\\\ y=2\\end{cases}","\\begin{cases} x=11 \\\\ y=3\\end{cases}","\\begin{cases} x=9 \\\\ y=1\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{4}x-2y=-24 \\\\ -\\frac{5}{6}x+3y=7\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=24 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=10 \\\\ y=13\\end{cases}","\\begin{cases} x=7 \\\\ y=7\\end{cases}","\\begin{cases} x=1 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{3}{5}x-y=-25 \\\\ -\\frac{2}{5}x+2y=10\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=25 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=15\\end{cases}","\\begin{cases} x=15 \\\\ y=8\\end{cases}","\\begin{cases} x=7 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-2y=-23 \\\\ -\\frac{1}{3}x+3y=15\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=18 \\\\ y=7\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=15\\end{cases}","\\begin{cases} x=15 \\\\ y=13\\end{cases}","\\begin{cases} x=1 \\\\ y=9\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{4}x-y=-13 \\\\ -\\frac{1}{3}x+2y=16\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=11 \\\\ y=15\\end{cases}","\\begin{cases} x=6 \\\\ y=8\\end{cases}","\\begin{cases} x=2 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{6}x-y=-8 \\\\ -\\frac{3}{4}x+3y=-6\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=24 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=13 \\\\ y=6\\end{cases}","\\begin{cases} x=5 \\\\ y=10\\end{cases}","\\begin{cases} x=10 \\\\ y=2\\end{cases}",]},

{equation: "\\[ {\\begin{cases} -\\frac{1}{2}x-y=-11 \\\\ -\\frac{1}{2}x+3y=25\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=4 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=5 \\\\ y=12\\end{cases}","\\begin{cases} x=6 \\\\ y=11\\end{cases}","\\begin{cases} x=3 \\\\ y=5\\end{cases}",]},


            {equation: "\\[ {\\begin{cases} \\frac{1}{3}x+y=15 \\\\ \\frac{4}{5}x+3y=42\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} y=15 \\\\ x=10\\end{cases} ",incorrectOptions:["\\begin{cases} x=8 \\\\ y=1\\end{cases}","\\begin{cases} x=12 \\\\ y=1\\end{cases}","\\begin{cases} x=1 \\\\ y=7\\end{cases}",]},

{equation: "\\[ {\\begin{cases} \\frac{2}{5}x+y=19 \\\\ \\frac{4}{5}x+4y=56\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=25 \\\\ y=9\\end{cases} ",incorrectOptions:["\\begin{cases} x=7 \\\\ y=7\\end{cases}","\\begin{cases} x=9 \\\\ y=10\\end{cases}","\\begin{cases} x=3 \\\\ y=8\\end{cases}",]},

{equation: "\\[ {\\begin{cases} \\frac{1}{2}x+y=10 \\\\ \\frac{1}{3}x+2y=12\\end{cases}\\genfrac{}{}{0pt}{}{①}{②}} \\] ",correctOption:"\\begin{cases} x=12 \\\\ y=4\\end{cases} ",incorrectOptions:["\\begin{cases} x=13 \\\\ y=6\\end{cases}","\\begin{cases} x=5 \\\\ y=11\\end{cases}","\\begin{cases} x=5 \\\\ y=7\\end{cases}",]},// 分数方程组的题库
            // {equation: "...", correctOption: "...", incorrectOptions: ["...", "...", "..."]},
            // 其他题目
        ];

const 图片  =[
{ equation: "\\[ {A} \\]", img: "images/测试.gif",correctOption: "A",incorrectOptions: ["B", "C", "D"]}

]







        let currentQuestionBank;
        let currentEquationSystem;
        let score = 0;
        let questionsAnswered = 0;
        let roundsScores = [];
        let currentTopic = '';



function loadQuestions(questionBank, topic) {
    currentQuestionBank = questionBank;
    currentTopic = topic;
    score = 0;
    questionsAnswered = 0;
    updateScoreboard();
    updateRoundsScoreboard();
    document.getElementById('current-topic').textContent = `玖数学: ${currentTopic}`; // 更新题型名称
    startNewRound();
}



function generateEquationSystem() {
    const randomIndex = Math.floor(Math.random() * currentQuestionBank.length);
    const { equation, img, correctOption, incorrectOptions } = currentQuestionBank[randomIndex];

    const correctIndex = Math.floor(Math.random() * 4);
    const options = [...incorrectOptions];
    options.splice(correctIndex, 0, correctOption);

    let equationHTML = equation;

    // 检查是否存在图片路径，如果存在则添加图片的 HTML
    if (img && img.trim() !== '') {
        equationHTML += `<br><img src="${img}" alt="题目图片">`;
    }

    currentEquationSystem = {
        equationSystem: equationHTML,
        correctIndex,
        options
    };
}








        function generateOptions() {
            const labels = ['A', 'B', 'C', 'D',];
            return currentEquationSystem.options.map((option, index) => `<div class="option" onclick="checkAnswer(${index})"><span>${labels[index]}. \\(${option}\\)</span></div>`).join('');
        }

        function displayEquationSystem() {
            generateEquationSystem();
            document.getElementById('equation').innerHTML = currentEquationSystem.equationSystem;
            document.getElementById('options').innerHTML = generateOptions();
            MathJax.typeset();
        }

        function startNewRound() {
            if (questionsAnswered >= 10) {
                roundsScores.push({ topic: currentTopic, score: score });
                score = 0;
                questionsAnswered = 0;
                updateRoundsScoreboard();
            }
            displayEquationSystem();
        }

        function checkAnswer(selectedIndex) {
            if (parseInt(selectedIndex) === currentEquationSystem.correctIndex) {
                score++;
            }

            questionsAnswered++;
            updateScoreboard();
            startNewRound();
        }

        function updateScoreboard() {
            document.getElementById('score').textContent = score;
            document.getElementById('answered').textContent = questionsAnswered;
        }

        function updateRoundsScoreboard() {
            let roundsScoresText = roundsScores.map((round, index) => `第${index + 1}轮 (${round.topic}): ${round.score}分共10题`).join('<br>');
            document.getElementById('rounds-scoreboard').innerHTML = roundsScoresText;
        }


function myFunction(id) {
  var x = document.getElementById('分数运算');
  var y = document.getElementById('方程应用');
  var z = document.getElementById('微分积分');
  var a = document.getElementById('线性代数');
  
  if (id === '分数运算') {
    x.style.display = "block";
    y.style.display = "none";
    z.style.display = "none";
    a.style.display = "none";
    
  } else if (id === '方程应用') {
    x.style.display = "none";
    y.style.display = "block";
    z.style.display = "none";
    a.style.display = "none";
  } else if (id === '微分积分') {
    x.style.display = "none";
    y.style.display = "none";
    z.style.display = "block";
    a.style.display = "none";

  } else if (id === '线性代数') {
    x.style.display = "none";
    y.style.display = "none";
    z.style.display = "none";
    a.style.display = "block";
  


}
}

        // 默认不显示网页窗口点击才显示
function showFrame(url) {
  var frame = document.getElementById('myframe');
  frame.style.display = 'block';
  frame.src = url;
}



 // 网页关闭窗口按钮
function hideFrame() {
  var frame = document.getElementById('myframe');
  frame.style.display = 'none';
}



        // 默认加载分数混合运算题库
        window.onload = () => loadQuestions( 函数01二次最值01, ' 函数01二次最值01');
    
