window.JIUSHU_QUIZ = {
  topic: "分数应用题06还原问题1",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{12}，以后的10天,分别分了当天糖果的\\frac{1}{11},\\frac{1}{10},…...\\frac{1}{2}。\\\\分了11天，最后剩下14颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "168"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{8}，以后的6天,分别分了当天糖果的\\frac{1}{7},\\frac{1}{6},…...\\frac{1}{2}。\\\\分了7天，最后剩下22颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "176"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{14}，以后的12天,分别分了当天糖果的\\frac{1}{13},\\frac{1}{12},…...\\frac{1}{2}。\\\\分了13天，最后剩下22颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "308"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{11}，以后的9天,分别分了当天糖果的\\frac{1}{10},\\frac{1}{9},…...\\frac{1}{2}。\\\\分了10天，最后剩下19颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "209"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{6}，以后的4天,分别分了当天糖果的\\frac{1}{5},\\frac{1}{4},…...\\frac{1}{2}。\\\\分了5天，最后剩下16颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "96"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{15}，以后的13天,分别分了当天糖果的\\frac{1}{14},\\frac{1}{13},…...\\frac{1}{2}。\\\\分了14天，最后剩下15颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "225"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{10}，以后的8天,分别分了当天糖果的\\frac{1}{9},\\frac{1}{8},…...\\frac{1}{2}。\\\\分了9天，最后剩下25颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "250"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{6}，以后的4天,分别分了当天糖果的\\frac{1}{5},\\frac{1}{4},…...\\frac{1}{2}。\\\\分了5天，最后剩下23颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "138"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{13}，以后的11天,分别分了当天糖果的\\frac{1}{12},\\frac{1}{11},…...\\frac{1}{2}。\\\\分了12天，最后剩下13颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "169"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{8}，以后的6天,分别分了当天糖果的\\frac{1}{7},\\frac{1}{6},…...\\frac{1}{2}。\\\\分了7天，最后剩下10颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "80"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{9}，以后的7天,分别分了当天糖果的\\frac{1}{8},\\frac{1}{7},…...\\frac{1}{2}。\\\\分了8天，最后剩下23颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "207"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{12}，以后的10天,分别分了当天糖果的\\frac{1}{11},\\frac{1}{10},…...\\frac{1}{2}。\\\\分了11天，最后剩下21颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "252"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{11}，以后的9天,分别分了当天糖果的\\frac{1}{10},\\frac{1}{9},…...\\frac{1}{2}。\\\\分了10天，最后剩下8颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "88"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下6颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "42"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{12}，以后的10天,分别分了当天糖果的\\frac{1}{11},\\frac{1}{10},…...\\frac{1}{2}。\\\\分了11天，最后剩下2颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{13}，以后的11天,分别分了当天糖果的\\frac{1}{12},\\frac{1}{11},…...\\frac{1}{2}。\\\\分了12天，最后剩下15颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "195"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{9}，以后的7天,分别分了当天糖果的\\frac{1}{8},\\frac{1}{7},…...\\frac{1}{2}。\\\\分了8天，最后剩下22颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "198"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{15}，以后的13天,分别分了当天糖果的\\frac{1}{14},\\frac{1}{13},…...\\frac{1}{2}。\\\\分了14天，最后剩下12颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "180"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{6}，以后的4天,分别分了当天糖果的\\frac{1}{5},\\frac{1}{4},…...\\frac{1}{2}。\\\\分了5天，最后剩下21颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "126"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{11}，以后的9天,分别分了当天糖果的\\frac{1}{10},\\frac{1}{9},…...\\frac{1}{2}。\\\\分了10天，最后剩下24颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "264"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{9}，以后的7天,分别分了当天糖果的\\frac{1}{8},\\frac{1}{7},…...\\frac{1}{2}。\\\\分了8天，最后剩下12颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "108"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{5}，以后的3天,分别分了当天糖果的\\frac{1}{4},\\frac{1}{3},…...\\frac{1}{2}。\\\\分了4天，最后剩下5颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "25"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下18颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "126"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{15}，以后的13天,分别分了当天糖果的\\frac{1}{14},\\frac{1}{13},…...\\frac{1}{2}。\\\\分了14天，最后剩下23颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "345"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{12}，以后的10天,分别分了当天糖果的\\frac{1}{11},\\frac{1}{10},…...\\frac{1}{2}。\\\\分了11天，最后剩下23颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "276"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{8}，以后的6天,分别分了当天糖果的\\frac{1}{7},\\frac{1}{6},…...\\frac{1}{2}。\\\\分了7天，最后剩下8颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "64"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{6}，以后的4天,分别分了当天糖果的\\frac{1}{5},\\frac{1}{4},…...\\frac{1}{2}。\\\\分了5天，最后剩下14颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "84"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{15}，以后的13天,分别分了当天糖果的\\frac{1}{14},\\frac{1}{13},…...\\frac{1}{2}。\\\\分了14天，最后剩下25颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "375"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下7颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "49"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{14}，以后的12天,分别分了当天糖果的\\frac{1}{13},\\frac{1}{12},…...\\frac{1}{2}。\\\\分了13天，最后剩下18颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "252"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下16颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "112"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{10}，以后的8天,分别分了当天糖果的\\frac{1}{9},\\frac{1}{8},…...\\frac{1}{2}。\\\\分了9天，最后剩下18颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "180"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{13}，以后的11天,分别分了当天糖果的\\frac{1}{12},\\frac{1}{11},…...\\frac{1}{2}。\\\\分了12天，最后剩下14颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "182"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下17颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "119"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{8}，以后的6天,分别分了当天糖果的\\frac{1}{7},\\frac{1}{6},…...\\frac{1}{2}。\\\\分了7天，最后剩下2颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "16"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{5}，以后的3天,分别分了当天糖果的\\frac{1}{4},\\frac{1}{3},…...\\frac{1}{2}。\\\\分了4天，最后剩下15颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "75"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下9颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "63"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{9}，以后的7天,分别分了当天糖果的\\frac{1}{8},\\frac{1}{7},…...\\frac{1}{2}。\\\\分了8天，最后剩下21颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "189"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{11}，以后的9天,分别分了当天糖果的\\frac{1}{10},\\frac{1}{9},…...\\frac{1}{2}。\\\\分了10天，最后剩下18颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "198"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{13}，以后的11天,分别分了当天糖果的\\frac{1}{12},\\frac{1}{11},…...\\frac{1}{2}。\\\\分了12天，最后剩下23颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "299"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下15颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "105"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{7}，以后的5天,分别分了当天糖果的\\frac{1}{6},\\frac{1}{5},…...\\frac{1}{2}。\\\\分了6天，最后剩下23颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "161"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{9}，以后的7天,分别分了当天糖果的\\frac{1}{8},\\frac{1}{7},…...\\frac{1}{2}。\\\\分了8天，最后剩下19颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "171"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{10}，以后的8天,分别分了当天糖果的\\frac{1}{9},\\frac{1}{8},…...\\frac{1}{2}。\\\\分了9天，最后剩下24颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "240"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{14}，以后的12天,分别分了当天糖果的\\frac{1}{13},\\frac{1}{12},…...\\frac{1}{2}。\\\\分了13天，最后剩下4颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "56"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{14}，以后的12天,分别分了当天糖果的\\frac{1}{13},\\frac{1}{12},…...\\frac{1}{2}。\\\\分了13天，最后剩下14颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "196"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{13}，以后的11天,分别分了当天糖果的\\frac{1}{12},\\frac{1}{11},…...\\frac{1}{2}。\\\\分了12天，最后剩下3颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "39"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{5}，以后的3天,分别分了当天糖果的\\frac{1}{4},\\frac{1}{3},…...\\frac{1}{2}。\\\\分了4天，最后剩下24颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{13}，以后的11天,分别分了当天糖果的\\frac{1}{12},\\frac{1}{11},…...\\frac{1}{2}。\\\\分了12天，最后剩下4颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "52"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂里有一堆糖果，分给同学们，\\\\第一天分了全部的\\frac{1}{15}，以后的13天,分别分了当天糖果的\\frac{1}{14},\\frac{1}{13},…...\\frac{1}{2}。\\\\分了14天，最后剩下5颗糖果.玖数学堂原来有几颗糖果？\\end{array} \\]",
    "correctOption": {
      "single": "75"
    }
  }
]
};