window.JIUSHU_QUIZ = {
  topic: "分数应用题07还原问题2",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多4页。\\\\第二天看了剩下的\\frac{2}{3}，还多4页。\\\\第三天看了剩下的\\frac{2}{3}，还多4页。\\\\第四天看了最后的6页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "318"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多16页。\\\\第二天看了剩下的\\frac{2}{3}，还多16页。\\\\第三天看了剩下的\\frac{2}{3}，还多16页。\\\\第四天看了最后的8页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "840"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多16页。\\\\第二天看了剩下的\\frac{4}{5}，还多16页。\\\\第三天看了剩下的\\frac{4}{5}，还多16页。\\\\第四天看了最后的5页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "3105"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多30页。\\\\第二天看了剩下的\\frac{3}{4}，还多30页。\\\\第三天看了剩下的\\frac{3}{4}，还多30页。\\\\第四天看了最后的5页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2840"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多24页。\\\\第二天看了剩下的\\frac{3}{4}，还多24页。\\\\第三天看了剩下的\\frac{3}{4}，还多24页。\\\\第四天看了最后的4页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2272"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多40页。\\\\第二天看了剩下的\\frac{4}{5}，还多40页。\\\\第三天看了剩下的\\frac{4}{5}，还多40页。\\\\第四天看了最后的5页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "6825"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多16页。\\\\第二天看了剩下的\\frac{4}{5}，还多16页。\\\\第三天看了剩下的\\frac{4}{5}，还多16页。\\\\第四天看了最后的3页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2855"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多20页。\\\\第二天看了剩下的\\frac{2}{3}，还多20页。\\\\第三天看了剩下的\\frac{2}{3}，还多20页。\\\\第四天看了最后的3页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "861"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多20页。\\\\第二天看了剩下的\\frac{4}{5}，还多20页。\\\\第三天看了剩下的\\frac{4}{5}，还多20页。\\\\第四天看了最后的5页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "3725"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多18页。\\\\第二天看了剩下的\\frac{3}{4}，还多18页。\\\\第三天看了剩下的\\frac{3}{4}，还多18页。\\\\第四天看了最后的8页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2024"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多20页。\\\\第二天看了剩下的\\frac{2}{3}，还多20页。\\\\第三天看了剩下的\\frac{2}{3}，还多20页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "834"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多8页。\\\\第二天看了剩下的\\frac{4}{5}，还多8页。\\\\第三天看了剩下的\\frac{4}{5}，还多8页。\\\\第四天看了最后的6页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "1990"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多21页。\\\\第二天看了剩下的\\frac{3}{4}，还多21页。\\\\第三天看了剩下的\\frac{3}{4}，还多21页。\\\\第四天看了最后的10页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2404"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多6页。\\\\第二天看了剩下的\\frac{3}{4}，还多6页。\\\\第三天看了剩下的\\frac{3}{4}，还多6页。\\\\第四天看了最后的4页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "760"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多4页。\\\\第二天看了剩下的\\frac{2}{3}，还多4页。\\\\第三天看了剩下的\\frac{2}{3}，还多4页。\\\\第四天看了最后的9页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "399"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多8页。\\\\第二天看了剩下的\\frac{4}{5}，还多8页。\\\\第三天看了剩下的\\frac{4}{5}，还多8页。\\\\第四天看了最后的8页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2240"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多21页。\\\\第二天看了剩下的\\frac{3}{4}，还多21页。\\\\第三天看了剩下的\\frac{3}{4}，还多21页。\\\\第四天看了最后的3页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "1956"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多32页。\\\\第二天看了剩下的\\frac{4}{5}，还多32页。\\\\第三天看了剩下的\\frac{4}{5}，还多32页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "5210"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多27页。\\\\第二天看了剩下的\\frac{3}{4}，还多27页。\\\\第三天看了剩下的\\frac{3}{4}，还多27页。\\\\第四天看了最后的9页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2844"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多8页。\\\\第二天看了剩下的\\frac{4}{5}，还多8页。\\\\第三天看了剩下的\\frac{4}{5}，还多8页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "1490"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多12页。\\\\第二天看了剩下的\\frac{2}{3}，还多12页。\\\\第三天看了剩下的\\frac{2}{3}，还多12页。\\\\第四天看了最后的3页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "549"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多16页。\\\\第二天看了剩下的\\frac{2}{3}，还多16页。\\\\第三天看了剩下的\\frac{2}{3}，还多16页。\\\\第四天看了最后的9页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "867"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多6页。\\\\第二天看了剩下的\\frac{2}{3}，还多6页。\\\\第三天看了剩下的\\frac{2}{3}，还多6页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "288"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多8页。\\\\第二天看了剩下的\\frac{2}{3}，还多8页。\\\\第三天看了剩下的\\frac{2}{3}，还多8页。\\\\第四天看了最后的8页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "528"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多40页。\\\\第二天看了剩下的\\frac{4}{5}，还多40页。\\\\第三天看了剩下的\\frac{4}{5}，还多40页。\\\\第四天看了最后的8页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "7200"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{1}{2}，还多8页。\\\\第二天看了剩下的\\frac{1}{2}，还多8页。\\\\第三天看了剩下的\\frac{1}{2}，还多8页。\\\\第四天看了最后的7页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "168"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多27页。\\\\第二天看了剩下的\\frac{3}{4}，还多27页。\\\\第三天看了剩下的\\frac{3}{4}，还多27页。\\\\第四天看了最后的5页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2588"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多9页。\\\\第二天看了剩下的\\frac{3}{4}，还多9页。\\\\第三天看了剩下的\\frac{3}{4}，还多9页。\\\\第四天看了最后的6页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "1140"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多28页。\\\\第二天看了剩下的\\frac{4}{5}，还多28页。\\\\第三天看了剩下的\\frac{4}{5}，还多28页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "4590"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多8页。\\\\第二天看了剩下的\\frac{2}{3}，还多8页。\\\\第三天看了剩下的\\frac{2}{3}，还多8页。\\\\第四天看了最后的3页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "393"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{1}{2}，还多3页。\\\\第二天看了剩下的\\frac{1}{2}，还多3页。\\\\第三天看了剩下的\\frac{1}{2}，还多3页。\\\\第四天看了最后的6页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多12页。\\\\第二天看了剩下的\\frac{4}{5}，还多12页。\\\\第三天看了剩下的\\frac{4}{5}，还多12页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2110"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{1}{2}，还多2页。\\\\第二天看了剩下的\\frac{1}{2}，还多2页。\\\\第三天看了剩下的\\frac{1}{2}，还多2页。\\\\第四天看了最后的7页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "84"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多30页。\\\\第二天看了剩下的\\frac{3}{4}，还多30页。\\\\第三天看了剩下的\\frac{3}{4}，还多30页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2648"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多28页。\\\\第二天看了剩下的\\frac{4}{5}，还多28页。\\\\第三天看了剩下的\\frac{4}{5}，还多28页。\\\\第四天看了最后的5页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "4965"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多16页。\\\\第二天看了剩下的\\frac{4}{5}，还多16页。\\\\第三天看了剩下的\\frac{4}{5}，还多16页。\\\\第四天看了最后的9页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "3605"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多8页。\\\\第二天看了剩下的\\frac{2}{3}，还多8页。\\\\第三天看了剩下的\\frac{2}{3}，还多8页。\\\\第四天看了最后的2页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "366"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多24页。\\\\第二天看了剩下的\\frac{3}{4}，还多24页。\\\\第三天看了剩下的\\frac{3}{4}，还多24页。\\\\第四天看了最后的6页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2400"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多10页。\\\\第二天看了剩下的\\frac{2}{3}，还多10页。\\\\第三天看了剩下的\\frac{2}{3}，还多10页。\\\\第四天看了最后的10页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "660"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{1}{2}，还多10页。\\\\第二天看了剩下的\\frac{1}{2}，还多10页。\\\\第三天看了剩下的\\frac{1}{2}，还多10页。\\\\第四天看了最后的3页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "164"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多36页。\\\\第二天看了剩下的\\frac{4}{5}，还多36页。\\\\第三天看了剩下的\\frac{4}{5}，还多36页。\\\\第四天看了最后的4页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "6080"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多8页。\\\\第二天看了剩下的\\frac{2}{3}，还多8页。\\\\第三天看了剩下的\\frac{2}{3}，还多8页。\\\\第四天看了最后的10页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "582"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多10页。\\\\第二天看了剩下的\\frac{2}{3}，还多10页。\\\\第三天看了剩下的\\frac{2}{3}，还多10页。\\\\第四天看了最后的4页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "498"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{1}{2}，还多5页。\\\\第二天看了剩下的\\frac{1}{2}，还多5页。\\\\第三天看了剩下的\\frac{1}{2}，还多5页。\\\\第四天看了最后的6页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "118"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{2}{3}，还多4页。\\\\第二天看了剩下的\\frac{2}{3}，还多4页。\\\\第三天看了剩下的\\frac{2}{3}，还多4页。\\\\第四天看了最后的10页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "426"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多20页。\\\\第二天看了剩下的\\frac{4}{5}，还多20页。\\\\第三天看了剩下的\\frac{4}{5}，还多20页。\\\\第四天看了最后的10页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "4350"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{4}{5}，还多32页。\\\\第二天看了剩下的\\frac{4}{5}，还多32页。\\\\第三天看了剩下的\\frac{4}{5}，还多32页。\\\\第四天看了最后的10页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "6210"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{1}{2}，还多9页。\\\\第二天看了剩下的\\frac{1}{2}，还多9页。\\\\第三天看了剩下的\\frac{1}{2}，还多9页。\\\\第四天看了最后的5页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "166"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多27页。\\\\第二天看了剩下的\\frac{3}{4}，还多27页。\\\\第三天看了剩下的\\frac{3}{4}，还多27页。\\\\第四天看了最后的10页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "2908"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 小明同学在玖数学堂里看科幻小说，\\\\第一天看了全书的\\frac{3}{4}，还多15页。\\\\第二天看了剩下的\\frac{3}{4}，还多15页。\\\\第三天看了剩下的\\frac{3}{4}，还多15页。\\\\第四天看了最后的4页。请问原书有多少页？\\end{array} \\]",
    "correctOption": {
      "single": "1516"
    }
  }
]
};