window.JIUSHU_QUIZ = {
  topic: "分数应用题03转化单位1",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共83道，\\\\小明做了应用题的\\frac{1}{7}，几何题的\\frac{1}{6}，\\\\还剩下应用题和几何题共70道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "35",
        "y": "48"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共94道，\\\\小明做了应用题的\\frac{1}{2}，几何题的\\frac{1}{4}，\\\\还剩下应用题和几何题共53道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "70",
        "y": "24"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共69道，\\\\小明做了应用题的\\frac{2}{5}，几何题的\\frac{6}{11}，\\\\还剩下应用题和几何题共35道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "25",
        "y": "44"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共100道，\\\\小明做了应用题的\\frac{3}{5}，几何题的\\frac{1}{5}，\\\\还剩下应用题和几何题共48道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "80",
        "y": "20"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共72道，\\\\小明做了应用题的\\frac{5}{6}，几何题的\\frac{2}{3}，\\\\还剩下应用题和几何题共16道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "48",
        "y": "24"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共98道，\\\\小明做了应用题的\\frac{2}{3}，几何题的\\frac{3}{7}，\\\\还剩下应用题和几何题共46道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "42",
        "y": "56"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共78道，\\\\小明做了应用题的\\frac{5}{8}，几何题的\\frac{1}{3}，\\\\还剩下应用题和几何题共38道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "48",
        "y": "30"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共74道，\\\\小明做了应用题的\\frac{4}{7}，几何题的\\frac{2}{3}，\\\\还剩下应用题和几何题共30道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "56",
        "y": "18"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共158道，\\\\小明做了应用题的\\frac{5}{11}，几何题的\\frac{1}{2}，\\\\还剩下应用题和几何题共83道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "88",
        "y": "70"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共84道，\\\\小明做了应用题的\\frac{1}{2}，几何题的\\frac{1}{4}，\\\\还剩下应用题和几何题共56道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "28",
        "y": "56"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共76道，\\\\小明做了应用题的\\frac{3}{4}，几何题的\\frac{2}{7}，\\\\还剩下应用题和几何题共32道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "48",
        "y": "28"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共60道，\\\\小明做了应用题的\\frac{1}{2}，几何题的\\frac{3}{7}，\\\\还剩下应用题和几何题共33道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "18",
        "y": "42"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共49道，\\\\小明做了应用题的\\frac{1}{4}，几何题的\\frac{2}{3}，\\\\还剩下应用题和几何题共33道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "40",
        "y": "9"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共84道，\\\\小明做了应用题的\\frac{2}{5}，几何题的\\frac{3}{4}，\\\\还剩下应用题和几何题共42道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "60",
        "y": "24"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共60道，\\\\小明做了应用题的\\frac{1}{6}，几何题的\\frac{1}{2}，\\\\还剩下应用题和几何题共42道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "36",
        "y": "24"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共52道，\\\\小明做了应用题的\\frac{3}{5}，几何题的\\frac{1}{4}，\\\\还剩下应用题和几何题共32道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "20",
        "y": "32"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共66道，\\\\小明做了应用题的\\frac{2}{3}，几何题的\\frac{5}{7}，\\\\还剩下应用题和几何题共20道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "24",
        "y": "42"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共72道，\\\\小明做了应用题的\\frac{3}{7}，几何题的\\frac{2}{5}，\\\\还剩下应用题和几何题共42道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "42",
        "y": "30"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共68道，\\\\小明做了应用题的\\frac{3}{5}，几何题的\\frac{4}{7}，\\\\还剩下应用题和几何题共28道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "40",
        "y": "28"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共67道，\\\\小明做了应用题的\\frac{5}{7}，几何题的\\frac{3}{8}，\\\\还剩下应用题和几何题共30道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "35",
        "y": "32"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共90道，\\\\小明做了应用题的\\frac{1}{2}，几何题的\\frac{1}{6}，\\\\还剩下应用题和几何题共51道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "72",
        "y": "18"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共67道，\\\\小明做了应用题的\\frac{2}{5}，几何题的\\frac{4}{9}，\\\\还剩下应用题和几何题共39道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "40",
        "y": "27"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共88道，\\\\小明做了应用题的\\frac{1}{5}，几何题的\\frac{1}{2}，\\\\还剩下应用题和几何题共56道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "40",
        "y": "48"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共96道，\\\\小明做了应用题的\\frac{3}{8}，几何题的\\frac{1}{2}，\\\\还剩下应用题和几何题共56道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "64",
        "y": "32"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共62道，\\\\小明做了应用题的\\frac{1}{2}，几何题的\\frac{2}{7}，\\\\还剩下应用题和几何题共43道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "6",
        "y": "56"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共48道，\\\\小明做了应用题的\\frac{1}{3}，几何题的\\frac{3}{7}，\\\\还剩下应用题和几何题共30道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "27",
        "y": "21"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共87道，\\\\小明做了应用题的\\frac{1}{5}，几何题的\\frac{4}{9}，\\\\还剩下应用题和几何题共52道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "15",
        "y": "72"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共58道，\\\\小明做了应用题的\\frac{1}{7}，几何题的\\frac{5}{6}，\\\\还剩下应用题和几何题共29道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "28",
        "y": "30"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共37道，\\\\小明做了应用题的\\frac{4}{5}，几何题的\\frac{1}{2}，\\\\还剩下应用题和几何题共11道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "25",
        "y": "12"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共77道，\\\\小明做了应用题的\\frac{5}{8}，几何题的\\frac{2}{7}，\\\\还剩下应用题和几何题共36道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "56",
        "y": "21"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共102道，\\\\小明做了应用题的\\frac{2}{3}，几何题的\\frac{5}{8}，\\\\还剩下应用题和几何题共36道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "54",
        "y": "48"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共76道，\\\\小明做了应用题的\\frac{1}{5}，几何题的\\frac{2}{7}，\\\\还剩下应用题和几何题共56道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "20",
        "y": "56"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共75道，\\\\小明做了应用题的\\frac{3}{5}，几何题的\\frac{1}{5}，\\\\还剩下应用题和几何题共36道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "60",
        "y": "15"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共84道，\\\\小明做了应用题的\\frac{1}{6}，几何题的\\frac{1}{3}，\\\\还剩下应用题和几何题共64道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "48",
        "y": "36"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共114道，\\\\小明做了应用题的\\frac{5}{9}，几何题的\\frac{3}{5}，\\\\还剩下应用题和几何题共48道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "54",
        "y": "60"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共120道，\\\\小明做了应用题的\\frac{3}{5}，几何题的\\frac{2}{5}，\\\\还剩下应用题和几何题共60道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "60",
        "y": "60"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共101道，\\\\小明做了应用题的\\frac{5}{8}，几何题的\\frac{5}{11}，\\\\还剩下应用题和几何题共51道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "24",
        "y": "77"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共70道，\\\\小明做了应用题的\\frac{1}{7}，几何题的\\frac{3}{7}，\\\\还剩下应用题和几何题共48道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "28",
        "y": "42"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共54道，\\\\小明做了应用题的\\frac{1}{6}，几何题的\\frac{5}{6}，\\\\还剩下应用题和几何题共33道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "36",
        "y": "18"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共64道，\\\\小明做了应用题的\\frac{5}{8}，几何题的\\frac{3}{8}，\\\\还剩下应用题和几何题共34道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "24",
        "y": "40"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共60道，\\\\小明做了应用题的\\frac{3}{8}，几何题的\\frac{1}{7}，\\\\还剩下应用题和几何题共44道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "32",
        "y": "28"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共72道，\\\\小明做了应用题的\\frac{1}{3}，几何题的\\frac{1}{3}，\\\\还剩下应用题和几何题共48道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "24",
        "y": "48"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共66道，\\\\小明做了应用题的\\frac{1}{7}，几何题的\\frac{1}{3}，\\\\还剩下应用题和几何题共48道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "21",
        "y": "45"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共95道，\\\\小明做了应用题的\\frac{3}{5}，几何题的\\frac{1}{5}，\\\\还剩下应用题和几何题共52道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "60",
        "y": "35"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共69道，\\\\小明做了应用题的\\frac{1}{3}，几何题的\\frac{1}{6}，\\\\还剩下应用题和几何题共53道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "27",
        "y": "42"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共60道，\\\\小明做了应用题的\\frac{1}{2}，几何题的\\frac{3}{7}，\\\\还剩下应用题和几何题共32道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "32",
        "y": "28"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共68道，\\\\小明做了应用题的\\frac{1}{6}，几何题的\\frac{6}{11}，\\\\还剩下应用题和几何题共40道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "24",
        "y": "44"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共68道，\\\\小明做了应用题的\\frac{1}{4}，几何题的\\frac{1}{3}，\\\\还剩下应用题和几何题共48道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "32",
        "y": "36"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共24道，\\\\小明做了应用题的\\frac{1}{2}，几何题的\\frac{2}{3}，\\\\还剩下应用题和几何题共9道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "6",
        "y": "18"
      }
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂进行小升初试题训练，有应用题和几何题共54道，\\\\小明做了应用题的\\frac{5}{7}，几何题的\\frac{1}{3}，\\\\还剩下应用题和几何题共20道没完成，\\\\则原有应用题x道，几何题y道。 \\end{array} \\]",
    "correctOption": {
      "dual": {
        "x": "42",
        "y": "12"
      }
    }
  }
]
};