window.JIUSHU_QUIZ = {
  topic: "分数应用题05转化单位1化分为总",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有42人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "72"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{2}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有21人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "45"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有92人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "140"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有58人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "84"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{7}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有82人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "112"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有46人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "70"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有23人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "35"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{2}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有18人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{7}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有20人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "32"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有17人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "28"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有69人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "105"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有29人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "42"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有44人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "80"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有56人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "96"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{7}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有41人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "56"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有51人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "84"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有16人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "32"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有11人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "20"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有28人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "48"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有44人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "80"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有30人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "50"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有76人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有28人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "48"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有58人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "84"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有32人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "64"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有96人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "144"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有116人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "168"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有76人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{2}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有7人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "15"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有34人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "56"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有87人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "126"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{2}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有20人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "48"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{7}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有80人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "128"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{2}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有44人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "84"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有23人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "35"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{3}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有8人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "16"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有14人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有46人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "70"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{2}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有28人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "60"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有140人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "196"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有57人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有57人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有15人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "25"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{6}，获二等奖的同学占其它奖项同学占\\frac{1}{3}，获三等奖的同学有68人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "112"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{4}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有60人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "100"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{7}，获二等奖的同学占其它奖项同学占\\frac{1}{4}，获三等奖的同学有27人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "40"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{5}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有87人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "126"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{7}，获二等奖的同学占其它奖项同学占\\frac{1}{5}，获三等奖的同学有136人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "192"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{7}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有164人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "224"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂举行有数学编程大赛，\\\\获一等奖的同学占其它奖项同学的\\frac{1}{2}，获二等奖的同学占其它奖项同学占\\frac{1}{6}，获三等奖的同学有22人，\\\\那么一共有多少同学获奖呢？\\end{array} \\]",
    "correctOption": {
      "single": "42"
    }
  }
]
};