window.JIUSHU_QUIZ = {
  topic: "分数应用题02抓住不变量",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{4}{7}，\\\\后来又有50个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{3}{4},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有36个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{2}{3},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "108"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有63个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{17},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "119"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{7}{10}，\\\\后来又有56个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{5}{6},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "126"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{6}{13}，\\\\后来又有80个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{2}{3},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "210"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{9}{17}，\\\\后来又有72个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{9}{13},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "208"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有40个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{7}{10},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "100"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{4}{9}，\\\\后来又有81个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{18},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "162"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{5}{13}，\\\\后来又有24个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{1}{2},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "128"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{9}{17}，\\\\后来又有36个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{21},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "189"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有90个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{5}{7},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "210"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{4}{7}，\\\\后来又有48个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{4}{5},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{4}{13}，\\\\后来又有40个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{8}{17},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "170"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{9}{16}，\\\\后来又有18个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{12}{19},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "114"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{2}{3}，\\\\后来又有64个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{4}{5},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "160"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有35个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{19},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "95"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有15个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{2}{3},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "45"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{8}{17}，\\\\后来又有40个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{22},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "176"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{3}{4}，\\\\后来又有24个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{4}{5},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{4}{7}，\\\\后来又有45个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{17}{23},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "115"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{8}{11}，\\\\后来又有54个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{17}{20},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{3}，\\\\后来又有56个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{11}{17},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "119"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{9}{17}，\\\\后来又有63个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{2}{3},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "216"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{5}{13}，\\\\后来又有28个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{9}{17},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "119"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{3}{7}，\\\\后来又有54个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{15}{23},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "138"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{7}{11}，\\\\后来又有49个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{7}{9},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "126"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{5}{8}，\\\\后来又有63个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{4}{5},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "135"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有42个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{7}{11},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "154"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{8}{15}，\\\\后来又有30个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{11}{18},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "180"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{2}{5}，\\\\后来又有48个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{4}{7},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "168"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{7}{12}，\\\\后来又有45个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{16}{21},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "105"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{7}{16}，\\\\后来又有63个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{16}{25},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "175"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{9}{16}，\\\\后来又有25个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{2}{3},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "105"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{4}，\\\\后来又有81个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{4}{7},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "189"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{3}{10}，\\\\后来又有48个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{11}{18},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "108"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{7}{16}，\\\\后来又有20个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{11}{20},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "100"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{3}{5}，\\\\后来又有15个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{2}{3},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{4}{13}，\\\\后来又有21个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{7}{16},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "112"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{5}{13}，\\\\后来又有48个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{21},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "126"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{3}{8}，\\\\后来又有56个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{2}{3},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{6}{13}，\\\\后来又有50个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{11}{18},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "180"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{1}{2}，\\\\后来又有36个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{22},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "198"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{2}{5}，\\\\后来又有36个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{5}{8},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "96"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{7}{11}，\\\\后来又有60个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{13}{17},求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "170"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} 玖数学堂成立几何画板编程小组，其中女生占\\frac{3}{5}，\\\\后来又有35个女生参加这个几何画板编程小组，\\\\这时女生人数占总人数的\\frac{11}{15},\\\\求现在几何画板编程小组有多少人？\\end{array} \\]",
    "correctOption": {
      "single": "105"
    }
  }
]
};