window.JIUSHU_QUIZ = {
  topic: "工程问题05分对象2",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} \\text{有A、B两个仓库，A仓库的货物是B仓库的2倍。}\\\\ \\text{搬运完A仓库的货物，甲需要16小时；}\\\\ \\text{搬运完B仓库的货物，乙单干需要12小时，丙单干需要6小时。}\\\\ \\text{刚开始甲搬运A仓库，乙搬运B仓库，丙帮甲，后来丙又去帮乙，}\\\\ \\text{直到最后两个仓库的货物同时搬完。则丙帮了乙几个小时？} \\end{array} \\]",
    "correctOption": {
      "single": "2"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有A、B两个仓库，A仓库的货物是B仓库的2倍。}\\\\ \\text{搬运完A仓库的货物，甲需要32小时；}\\\\ \\text{搬运完B仓库的货物，乙单干需要24小时，丙单干需要12小时。}\\\\ \\text{刚开始甲搬运A仓库，乙搬运B仓库，丙帮甲，后来丙又去帮乙，}\\\\ \\text{直到最后两个仓库的货物同时搬完。则丙帮了乙几个小时？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有A、B两个仓库，A仓库的货物是B仓库的2倍。}\\\\ \\text{搬运完A仓库的货物，甲需要32小时；}\\\\ \\text{搬运完B仓库的货物，乙单干需要24小时，丙单干需要12小时。}\\\\ \\text{刚开始甲搬运A仓库，乙搬运B仓库，丙帮甲，后来丙又去帮乙，}\\\\ \\text{直到最后两个仓库的货物同时搬完。则丙帮了甲几个小时？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有A、B两个同样的仓库，搬运一个仓库里的货物，甲需要10小时，乙需要12小时，丙需要15小时。若一开始甲和丙在A仓库，乙在B仓库，同时开始搬运。中途丙又到B仓库帮助乙搬运，最后两个仓库同时搬完。丙帮助甲多少小时？（分对象）} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有A、B两个同样的仓库，搬运一个仓库里的货物，甲需要20小时，乙需要24小时，丙需要30小时。若一开始甲和丙在A仓库，乙在B仓库，同时开始搬运。中途丙又到B仓库帮助乙搬运，最后两个仓库同时搬完。丙帮助甲多少小时？（分对象）} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  }
]
};