window.JIUSHU_QUIZ = {
  topic: "工程问题04分对象1",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要105天，乙队单独修需要120天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了63天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "48"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要28天，乙队单独修需要21天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了24天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要27天，乙队单独修需要54天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了24天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要78天，乙队单独修需要91天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了54天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "28"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要65天，乙队单独修需要104天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了40天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "40"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要104天，乙队单独修需要65天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了40天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "40"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要130天，乙队单独修需要39天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了60天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "21"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要78天，乙队单独修需要91天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了42天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "42"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要90天，乙队单独修需要135天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了72天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "27"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要45天，乙队单独修需要36天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了30天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要15天，乙队单独修需要10天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了12天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "2"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要45天，乙队单独修需要36天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了30天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要143天，乙队单独修需要26天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了55天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "16"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要21天，乙队单独修需要28天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了12天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要45天，乙队单独修需要36天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了35天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "8"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要18天，乙队单独修需要63天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了14天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "14"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要10天，乙队单独修需要15天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了6天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要22天，乙队单独修需要99天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了18天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要26天，乙队单独修需要143天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了22天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "22"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要63天，乙队单独修需要18天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了28天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要35天，乙队单独修需要14天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了25天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要77天，乙队单独修需要44天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了56天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要36天，乙队单独修需要45天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了24天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "15"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要88天，乙队单独修需要33天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了80天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要28天，乙队单独修需要21天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了20天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要91天，乙队单独修需要78天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了63天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要117天，乙队单独修需要52天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了108天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要10天，乙队单独修需要15天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了6天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要45天，乙队单独修需要36天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了30天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要18天，乙队单独修需要63天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了14天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "14"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要99天，乙队单独修需要22天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了54天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要27天，乙队单独修需要54天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了18天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要15天，乙队单独修需要10天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了9天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要28天，乙队单独修需要21天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了12天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要18天，乙队单独修需要63天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了14天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "14"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要21天，乙队单独修需要28天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了18天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要88天，乙队单独修需要33天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了64天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要45天，乙队单独修需要180天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了36天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要26天，乙队单独修需要143天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了22天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "22"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要45天，乙队单独修需要180天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了39天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要78天，乙队单独修需要91天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了54天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "28"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要15天，乙队单独修需要10天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了9天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要55天，乙队单独修需要66天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了30天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "30"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要10天，乙队单独修需要15天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了6天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要45天，乙队单独修需要180天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了39天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要28天，乙队单独修需要21天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了16天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要65天，乙队单独修需要104天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了40天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "40"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要10天，乙队单独修需要15天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了6天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要54天，乙队单独修需要27天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了36天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一条公路，甲队单独修需要15天，乙队单独修需要10天。}\\\\ \\text{一开始两队一起修路，但是中间乙队因其他任务离开了，}\\\\ \\text{结果前后一共用了9天才把整条公路修完。}\\\\ \\text{请问乙队修了几天？（分对象1）} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  }
]
};