window.JIUSHU_QUIZ = {
  topic: "流水行船07分段2",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游3465千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时180和135千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "2880"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游5800千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时150和50千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "2700"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游60千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时35和25千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "35"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游330千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时35和20千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "210"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1375千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时70和55千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "1120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游510千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时45和40千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "450"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游2720千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时90和70千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "2340"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游825千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时90和75千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "720"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游840千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时80和40千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "480"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游4300千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时110和105千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "4180"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游3900千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时165和95千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "2640"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游675千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时90和45千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "360"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游3190千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时120和25千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "720"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游760千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时50和45千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "700"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1680千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时150和90千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "1200"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游850千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时55和30千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "550"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游855千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时55和40千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "660"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游400千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时55和25千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "220"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游900千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时60和40千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "600"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游3850千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时120和55千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "2160"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游2660千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时105和35千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "1050"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游325千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时40和25千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "160"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游990千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时60和50千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "840"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游880千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时60和20千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "360"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1540千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时120和20千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "240"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游7830千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时150和140千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "7500"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1035千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时60和55千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "960"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游2755千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时100和45千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "1600"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游600千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时50和25千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "300"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游420千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时40和20千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "240"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1320千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时70和50千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "980"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游165千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时30和25千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "120"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游520千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时45和20千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "270"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游3895千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时110和95千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "3520"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1265千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时70和45千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "840"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游2100千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时80和60千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "1760"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游260千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时35和30千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "210"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1950千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时90和40千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "900"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1155千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时120和45千米，水速为每小时15千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "480"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游10150千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时180和110千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "7560"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游455千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时45和20千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "180"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游6500千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时135和125千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "6210"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游50千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时30和20千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1900千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时110和80千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "1540"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1360千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时90和80千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "1260"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游800千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时105和55千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "525"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游455千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时40和25千米，水速为每小时5千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "320"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游880千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时90和20千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "180"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游1040千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时90和40千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "540"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{珠江上,码头A在B上游8260千米处,}\\\\ \\text{甲、乙两船在A、B之间往返运送货物。}\\\\ \\text{若甲、乙两船的静水速度分别为每小时150和145千米，水速为每小时10千米。}\\\\ \\text{则两船同时从B出发，甲第一次与乙相遇时，距离B多少千米？} \\end{array} \\]",
    "correctOption": {
      "single": "8100"
    }
  }
]
};