window.JIUSHU_QUIZ = {
  topic: "牛吃草7总效率不变的水管问题2",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管24个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管30个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "60"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管30个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管48个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管25个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "30"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管50个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "60"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管12小时能把空水池注满；}\\\\ \\text{单开排水管20个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "30"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管36个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管12小时能把空水池注满；}\\\\ \\text{单开排水管12个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管32个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管12小时能把空水池注满；}\\\\ \\text{单开排水管16个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管48个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和6条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管54小时能把空水池注满；}\\\\ \\text{单开排水管48个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管18个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和6条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管54小时能把空水池注满；}\\\\ \\text{单开排水管72个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和6条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管54小时能把空水池注满；}\\\\ \\text{单开排水管48个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管40个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "60"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管12小时能把空水池注满；}\\\\ \\text{单开排水管15个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管27个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管18个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和6条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管12小时能把空水池注满；}\\\\ \\text{单开排水管12个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管24个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管30个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "60"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管45个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管36个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管27个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管45个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管36个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管60个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管15个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管24个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和6条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管50个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "60"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管32个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管12小时能把空水池注满；}\\\\ \\text{单开排水管12个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管48个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管54小时能把空水池注满；}\\\\ \\text{单开排水管36个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管25个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "30"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管60个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管16个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管54小时能把空水池注满；}\\\\ \\text{单开排水管75个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "90"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管54小时能把空水池注满；}\\\\ \\text{单开排水管60个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "36"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管50个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "60"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管32个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管54小时能把空水池注满；}\\\\ \\text{单开排水管36个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管32个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管18小时能把空水池注满；}\\\\ \\text{单开排水管18个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和6条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管24小时能把空水池注满；}\\\\ \\text{单开排水管40个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和5条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "24"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管24个小时能把满的水池排空，}\\\\ \\text{问同时打开3条进水管和4条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{一个水池有一个进水管和一个排水管，}\\\\ \\text{单开进水管36小时能把空水池注满；}\\\\ \\text{单开排水管27个小时能把满的水池排空，}\\\\ \\text{问同时打开2条进水管和3条排水管几小时能把满水的水池排空？} \\end{array} \\]",
    "correctOption": {
      "single": "18"
    }
  }
]
};