window.JIUSHU_QUIZ = {
  topic: "牛吃草4经典问题牛数求天数",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养10头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养30头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养16头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养21头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养51头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养33头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养15头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养43头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养25头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养17头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养47头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养29头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养24头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养49头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养33头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养40头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养26头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养18头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养34头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养27头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养10头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养38头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养20头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养17头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养37头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养23头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养18头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养48头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养20头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养15头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养45头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养21头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养17头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养37头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养29头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养22头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养46头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养25头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养56头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养29头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养21头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养45头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养36头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养23头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养48头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养32头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养14头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养34头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养26头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养23头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养53头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养35头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养18头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养48头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养24头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养22头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养42头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养28头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养16头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养58头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养22头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养13头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养38头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养17头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养26头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养62头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养35头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养15头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养40头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养19头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养21头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养41头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养33头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养16头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养58头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养22头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养14头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养49头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养22头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养44头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养23头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养22头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养42头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养28头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养18头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养48头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养24头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养19头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养44头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养28头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养25头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养61头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养34头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养22头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养58头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养31头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养18头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养53头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养26头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养15头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养57头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养21头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养21头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养51头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养23头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养15头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养35头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养27头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养23头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养53头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养35头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养62头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养26头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养44头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养35头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养19头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养39头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养25头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养14头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养56头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养20头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养44头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养23头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养18头牛，那么9天能把草吃完；}\\\\ \\text{如果只放养53头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养26头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养56头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养24头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养50头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养22头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养23头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养47头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养26头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养15头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养40头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养19头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养16头牛，那么7天能把草吃完；}\\\\ \\text{如果只放养41头牛，那么2天能把草吃完．}\\\\ \\text{如果一开始放养20头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场，每天都在均匀地生长草，每头牛每天吃1份草．}\\\\ \\text{如果在牧场上放养20头牛，那么8天能把草吃完；}\\\\ \\text{如果只放养50头牛，那么3天能把草吃完．}\\\\ \\text{如果一开始放养26头牛，几天吃完？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  }
]
};