window.JIUSHU_QUIZ = {
  topic: "牛吃草3经典问题最多牛",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养19头牛,那么112天能把草吃完；}\\\\ \\text{如果只放养22头牛,那么88天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "8"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养22头牛,那么108天能把草吃完；}\\\\ \\text{如果只放养21头牛,那么117天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养15头牛,那么32天能把草吃完；}\\\\ \\text{如果只放养12头牛,那么44天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养21头牛,那么60天能把草吃完；}\\\\ \\text{如果只放养16头牛,那么90天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养14头牛,那么50天能把草吃完；}\\\\ \\text{如果只放养15头牛,那么45天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养20头牛,那么50天能把草吃完；}\\\\ \\text{如果只放养15头牛,那么75天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养10头牛,那么30天能把草吃完；}\\\\ \\text{如果只放养13头牛,那么21天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养11头牛,那么27天能把草吃完；}\\\\ \\text{如果只放养12头牛,那么24天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养15头牛,那么52天能把草吃完；}\\\\ \\text{如果只放养17头牛,那么44天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养17头牛,那么48天能把草吃完；}\\\\ \\text{如果只放养14头牛,那么66天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养17头牛,那么35天能把草吃完；}\\\\ \\text{如果只放养12头牛,那么60天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养15头牛,那么72天能把草吃完；}\\\\ \\text{如果只放养18头牛,那么54天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养11头牛,那么21天能把草吃完；}\\\\ \\text{如果只放养10头牛,那么24天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养19头牛,那么50天能把草吃完；}\\\\ \\text{如果只放养15头牛,那么70天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养19头牛,那么48天能把草吃完；}\\\\ \\text{如果只放养16头牛,那么60天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养11头牛,那么24天能把草吃完；}\\\\ \\text{如果只放养10头牛,那么28天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养24头牛,那么108天能把草吃完；}\\\\ \\text{如果只放养21头牛,那么135天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养14头牛,那么24天能把草吃完；}\\\\ \\text{如果只放养11头牛,那么33天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养18头牛,那么78天能把草吃完；}\\\\ \\text{如果只放养19头牛,那么72天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养19头牛,那么48天能把草吃完；}\\\\ \\text{如果只放养16头牛,那么60天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养12头牛,那么36天能把草吃完；}\\\\ \\text{如果只放养13头牛,那么32天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养25头牛,那么120天能把草吃完；}\\\\ \\text{如果只放养22头牛,那么150天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养16头牛,那么75天能把草吃完；}\\\\ \\text{如果只放养20头牛,那么55天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养11头牛,那么21天能把草吃完；}\\\\ \\text{如果只放养10头牛,那么24天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养17头牛,那么28天能把草吃完；}\\\\ \\text{如果只放养11头牛,那么52天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养18头牛,那么70天能把草吃完；}\\\\ \\text{如果只放养19头牛,那么65天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养15头牛,那么90天能把草吃完；}\\\\ \\text{如果只放养21头牛,那么54天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养12头牛,那么18天能把草吃完；}\\\\ \\text{如果只放养9头牛,那么27天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养13头牛,那么60天能把草吃完；}\\\\ \\text{如果只放养17头牛,那么40天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养13头牛,那么40天能把草吃完；}\\\\ \\text{如果只放养14头牛,那么36天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养23头牛,那么117天能把草吃完；}\\\\ \\text{如果只放养22头牛,那么126天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养11头牛,那么24天能把草吃完；}\\\\ \\text{如果只放养10头牛,那么28天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养14头牛,那么39天能把草吃完；}\\\\ \\text{如果只放养16头牛,那么33天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养13头牛,那么24天能把草吃完；}\\\\ \\text{如果只放养10头牛,那么36天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养17头牛,那么56天能把草吃完；}\\\\ \\text{如果只放养18头牛,那么52天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养16头牛,那么24天能把草吃完；}\\\\ \\text{如果只放养10头牛,那么48天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养18头牛,那么42天能把草吃完；}\\\\ \\text{如果只放养17头牛,那么45天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养18头牛,那么78天能把草吃完；}\\\\ \\text{如果只放养19头牛,那么72天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养18头牛,那么33天能把草吃完；}\\\\ \\text{如果只放养14头牛,那么45天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养20头牛,那么98天能把草吃完；}\\\\ \\text{如果只放养21头牛,那么91天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养15头牛,那么33天能把草吃完；}\\\\ \\text{如果只放养14头牛,那么36天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养19头牛,那么72天能把草吃完；}\\\\ \\text{如果只放养18头牛,那么78天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养17头牛,那么84天能把草吃完；}\\\\ \\text{如果只放养19头牛,那么70天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养12头牛,那么36天能把草吃完；}\\\\ \\text{如果只放养15头牛,那么27天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养12头牛,那么24天能把草吃完；}\\\\ \\text{如果只放养10头牛,那么32天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养14头牛,那么55天能把草吃完；}\\\\ \\text{如果只放养16头牛,那么45天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养19头牛,那么48天能把草吃完；}\\\\ \\text{如果只放养14头牛,那么78天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养15头牛,那么45天能把草吃完；}\\\\ \\text{如果只放养18头牛,那么36天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养17头牛,那么44天能把草吃完；}\\\\ \\text{如果只放养15头牛,那么52天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{有一片牧场,每天都在均匀地生长草,每头牛每天吃1份草。}\\\\ \\text{如果在牧场上放养11头牛,那么36天能把草吃完；}\\\\ \\text{如果只放养15头牛,那么24天能把草吃完。}\\\\ \\text{如果要想一直有草吃,那么最多放_头牛？} \\end{array} \\]",
    "correctOption": {
      "single": "3"
    }
  }
]
};