window.JIUSHU_QUIZ = {
  topic: "盈亏问题06一个对象的特殊问题",
  questions: [
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到4个瓜，其他同学每人分到3个瓜，就会剩下115个瓜；}\\\\ \\text{如果每个同学都分到11个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "15"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到3个瓜，其他同学每人分到2个瓜，就会剩下22个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到4个瓜，就会剩下0个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到3个瓜，其他同学每人分到2个瓜，就会剩下17个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "8"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到6个瓜，其他同学每人分到5个瓜，就会剩下4个瓜；}\\\\ \\text{如果每个同学都分到6个瓜，就会缺2个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到10个瓜，其他同学每人分到4个瓜，就会剩下91个瓜；}\\\\ \\text{如果每个同学都分到13个瓜，就会缺2个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "11"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到12个瓜，其他同学每人分到6个瓜，就会剩下70个瓜；}\\\\ \\text{如果每个同学都分到15个瓜，就会缺5个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到9个瓜，其他同学每人分到6个瓜，就会剩下60个瓜；}\\\\ \\text{如果每个同学都分到12个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "11"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到4个瓜，就会剩下11个瓜；}\\\\ \\text{如果每个同学都分到7个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到10个瓜，其他同学每人分到6个瓜，就会剩下92个瓜；}\\\\ \\text{如果每个同学都分到15个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "11"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到3个瓜，其他同学每人分到2个瓜，就会剩下3个瓜；}\\\\ \\text{如果每个同学都分到3个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "8"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到10个瓜，其他同学每人分到4个瓜，就会剩下33个瓜；}\\\\ \\text{如果每个同学都分到11个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到12个瓜，其他同学每人分到5个瓜，就会剩下106个瓜；}\\\\ \\text{如果每个同学都分到14个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "13"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到8个瓜，其他同学每人分到5个瓜，就会剩下33个瓜；}\\\\ \\text{如果每个同学都分到9个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到6个瓜，其他同学每人分到5个瓜，就会剩下45个瓜；}\\\\ \\text{如果每个同学都分到9个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "13"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到2个瓜，就会剩下39个瓜；}\\\\ \\text{如果每个同学都分到6个瓜，就会缺2个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "11"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到6个瓜，就会剩下17个瓜；}\\\\ \\text{如果每个同学都分到8个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到12个瓜，其他同学每人分到4个瓜，就会剩下114个瓜；}\\\\ \\text{如果每个同学都分到13个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "14"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到9个瓜，其他同学每人分到5个瓜，就会剩下10个瓜；}\\\\ \\text{如果每个同学都分到9个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到8个瓜，其他同学每人分到5个瓜，就会剩下85个瓜；}\\\\ \\text{如果每个同学都分到12个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "13"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到3个瓜，就会剩下2个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到12个瓜，其他同学每人分到4个瓜，就会剩下42个瓜；}\\\\ \\text{如果每个同学都分到13个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到4个瓜，就会剩下18个瓜；}\\\\ \\text{如果每个同学都分到10个瓜，就会缺5个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到3个瓜，就会剩下54个瓜；}\\\\ \\text{如果每个同学都分到8个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "12"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到10个瓜，其他同学每人分到4个瓜，就会剩下72个瓜；}\\\\ \\text{如果每个同学都分到12个瓜，就会缺2个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到6个瓜，就会剩下3个瓜；}\\\\ \\text{如果每个同学都分到7个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到3个瓜，其他同学每人分到2个瓜，就会剩下34个瓜；}\\\\ \\text{如果每个同学都分到6个瓜，就会缺5个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到2个瓜，就会剩下23个瓜；}\\\\ \\text{如果每个同学都分到6个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "8"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到3个瓜，就会剩下20个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "13"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到4个瓜，就会剩下22个瓜；}\\\\ \\text{如果每个同学都分到7个瓜，就会缺2个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到2个瓜，就会剩下15个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到14个瓜，其他同学每人分到5个瓜，就会剩下123个瓜；}\\\\ \\text{如果每个同学都分到14个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "15"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到3个瓜，其他同学每人分到2个瓜，就会剩下11个瓜；}\\\\ \\text{如果每个同学都分到4个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "9"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到4个瓜，其他同学每人分到3个瓜，就会剩下9个瓜；}\\\\ \\text{如果每个同学都分到7个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到6个瓜，就会剩下28个瓜；}\\\\ \\text{如果每个同学都分到10个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "8"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到8个瓜，其他同学每人分到3个瓜，就会剩下21个瓜；}\\\\ \\text{如果每个同学都分到8个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "6"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到8个瓜，其他同学每人分到3个瓜，就会剩下112个瓜；}\\\\ \\text{如果每个同学都分到11个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "15"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到4个瓜，就会剩下32个瓜；}\\\\ \\text{如果每个同学都分到9个瓜，就会缺2个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到6个瓜，就会剩下-2个瓜；}\\\\ \\text{如果每个同学都分到7个瓜，就会缺5个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到6个瓜，其他同学每人分到5个瓜，就会剩下0个瓜；}\\\\ \\text{如果每个同学都分到6个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到8个瓜，其他同学每人分到5个瓜，就会剩下20个瓜；}\\\\ \\text{如果每个同学都分到9个瓜，就会缺5个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "7"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到8个瓜，其他同学每人分到5个瓜，就会剩下37个瓜；}\\\\ \\text{如果每个同学都分到8个瓜，就会缺5个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "15"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到12个瓜，其他同学每人分到6个瓜，就会剩下50个瓜；}\\\\ \\text{如果每个同学都分到12个瓜，就会缺4个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到5个瓜，其他同学每人分到4个瓜，就会剩下7个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "14"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到5个瓜，就会剩下22个瓜；}\\\\ \\text{如果每个同学都分到8个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "10"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到7个瓜，其他同学每人分到6个瓜，就会剩下6个瓜；}\\\\ \\text{如果每个同学都分到8个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到10个瓜，其他同学每人分到3个瓜，就会剩下113个瓜；}\\\\ \\text{如果每个同学都分到12个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "14"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到6个瓜，其他同学每人分到2个瓜，就会剩下13个瓜；}\\\\ \\text{如果每个同学都分到7个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "4"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到4个瓜，其他同学每人分到3个瓜，就会剩下22个瓜；}\\\\ \\text{如果每个同学都分到5个瓜，就会缺3个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "13"
    }
  },
  {
    "equation": "\\[ \\begin{array}{c} \\text{老师给同学们分西瓜，}\\\\ \\text{如果第一个同学分到6个瓜，其他同学每人分到3个瓜，就会剩下11个瓜；}\\\\ \\text{如果每个同学都分到7个瓜，就会缺6个瓜．}\\\\ \\text{那么共有__________个同学．} \\end{array} \\]",
    "correctOption": {
      "single": "5"
    }
  }
]
};